{"name":"Applin","id":"applin","num":840,"types":["Grass","Dragon"],"imgID":840,"baseStats":[40,40,80,40,40,20],"weight":0.5,"bst":260,"evos":["Flapple","Appletun","Dipplin"],"usage":0,"moves":[{"id":"astonish","name":"Astonish","desc":"Has a 30% chance to make the target flinch.","shortDesc":"30% chance to make the target flinch.","type":"Ghost","num":310,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":30},{"id":"defensecurl","name":"Defense Curl","desc":"Raises the user's Defense by 1 stage. As long as the user remains active, the power of the user's Ice Ball and Rollout will be doubled (this effect is not stackable).","shortDesc":"Raises the user's Defense by 1.","type":"Normal","num":111,"category":"Status","priority":0,"accuracy":true,"pp":40,"basePower":0},{"id":"pounce","name":"Pounce","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance to lower the target's Speed by 1.","type":"Bug","num":884,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":50},{"id":"recycle","name":"Recycle","desc":"The user regains the item it last used. Fails if the user is holding an item, if the user has not held an item, if the item was a popped Air Balloon, if the item was picked up by a Pokemon with the Pickup Ability, or if the item was lost to Bug Bite, Corrosive Gas, Covet, Incinerate, Knock Off, Pluck, or Thief. Items thrown with Fling can be regained.","shortDesc":"Restores the item the user last used.","type":"Normal","num":278,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"rollout","name":"Rollout","desc":"If this move is successful, the user is locked into this move and cannot make another move until it misses, 5 turns have passed, or the attack cannot be used. Power doubles with each successful hit of this move and doubles again if Defense Curl was used previously by the user. If this move is called by Sleep Talk, the move is used for one turn.","shortDesc":"Power doubles with each hit. Repeats for 5 turns.","type":"Rock","num":205,"category":"Physical","priority":0,"accuracy":90,"pp":20,"basePower":30},{"id":"suckerpunch","name":"Sucker Punch","desc":"Fails if the target did not select a physical attack, special attack, or Me First for use this turn, or if the target moves before the user.","shortDesc":"Usually goes first. Fails if target is not attacking.","type":"Dark","num":389,"category":"Physical","priority":1,"accuracy":100,"pp":5,"basePower":70},{"id":"terablast","name":"Tera Blast","desc":"If the user is Terastallized, this move becomes a physical attack if the user's Attack is greater than its Special Attack, including stat stage changes, and this move's type becomes the same as the user's Tera Type. In addition, if the user's Tera Type is Stellar, this move has 100 power, is super effective against Terastallized targets and neutral against other targets, and lowers the user's Attack and Special Attack by 1 stage.","shortDesc":"If Terastallized: Phys. if Atk > SpA, type = Tera.","type":"Normal","num":851,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80},{"id":"withdraw","name":"Withdraw","desc":"Raises the user's Defense by 1 stage.","shortDesc":"Raises the user's Defense by 1.","type":"Water","num":110,"category":"Status","priority":0,"accuracy":true,"pp":40,"basePower":0}],"abilities":[{"name":"Ripen","id":"ripen","desc":"When this Pokemon eats certain Berries, the effects are doubled. Berries that restore HP or PP have the amount doubled, Berries that raise stat stages have the amount doubled, Berries that halve damage taken quarter it instead, and a Jaboca Berry or Rowap Berry has the attacker lose 1/4 of its maximum HP, rounded down.","shortDesc":"When this Pokemon eats certain Berries, the effects are doubled.","num":247},{"name":"Gluttony","id":"gluttony","desc":"When this Pokemon is holding a Berry that usually activates with 1/4 or less of its maximum HP, it is eaten at 1/2 or less of its maximum HP instead.","shortDesc":"This Pokemon eats Berries at 1/2 max HP or less instead of their usual 1/4 max HP.","num":82},{"name":"Bulletproof","id":"bulletproof","desc":"This Pokemon is immune to bullet moves.","shortDesc":"This Pokemon is immune to bullet moves.","num":171}],"teammates":[],"items":[],"spreads":[]}