{"name":"Blissey","id":"blissey","num":242,"types":["Normal"],"imgID":242,"baseStats":[255,10,10,75,135,55],"weight":46.8,"bst":540,"prevo":"Chansey","usage":0.01,"moves":[{"id":"alluringvoice","name":"Alluring Voice","desc":"Has a 100% chance to confuse the target if it had a stat stage raised this turn.","shortDesc":"100% confuse target that had a stat rise this turn.","type":"Fairy","num":914,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80},{"id":"avalanche","name":"Avalanche","desc":"Power doubles if the user was hit by the target this turn.","shortDesc":"Power doubles if user is damaged by the target.","type":"Ice","num":419,"category":"Physical","priority":-4,"accuracy":100,"pp":10,"basePower":60},{"id":"blizzard","name":"Blizzard","desc":"Has a 10% chance to freeze the target. If the weather is Snow, this move does not check accuracy.","shortDesc":"10% chance to freeze foe(s). Can't miss in Snow.","type":"Ice","num":59,"category":"Special","priority":0,"accuracy":70,"pp":5,"basePower":110},{"id":"bodyslam","name":"Body Slam","desc":"Has a 30% chance to paralyze the target. Damage doubles and no accuracy check is done if the target has used Minimize while active.","shortDesc":"30% chance to paralyze the target.","type":"Normal","num":34,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":85},{"id":"brickbreak","name":"Brick Break","desc":"If this attack does not miss, the effects of Reflect, Light Screen, and Aurora Veil end for the target's side of the field before damage is calculated.","shortDesc":"Destroys screens, unless the target is immune.","type":"Fighting","num":280,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":75},{"id":"bulldoze","name":"Bulldoze","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance lower adjacent Pkmn Speed by 1.","type":"Ground","num":523,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":60},{"id":"calmmind","name":"Calm Mind","desc":"Raises the user's Special Attack and Special Defense by 1 stage.","shortDesc":"Raises the user's Sp. Atk and Sp. Def by 1.","type":"Psychic","num":347,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0},{"id":"charm","name":"Charm","desc":"Lowers the target's Attack by 2 stages.","shortDesc":"Lowers the target's Attack by 2.","type":"Fairy","num":204,"category":"Status","priority":0,"accuracy":100,"pp":20,"basePower":0},{"id":"chillingwater","name":"Chilling Water","desc":"Has a 100% chance to lower the target's Attack by 1 stage.","shortDesc":"100% chance to lower the target's Attack by 1.","type":"Water","num":886,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":50},{"id":"copycat","name":"Copycat","desc":"The user uses the last move used by any Pokemon, including itself. Fails if no move has been used, or if the last move used was Assist, Baneful Bunker, Beak Blast, Behemoth Bash, Behemoth Blade, Belch, Bestow, Blazing Torque, Celebrate, Chatter, Circle Throw, Combat Torque, Copycat, Counter, Covet, Destiny Bond, Detect, Dragon Tail, Dynamax Cannon, Endure, Feint, Focus Punch, Follow Me, Helping Hand, Hold Hands, King's Shield, Magical Torque, Mat Block, Me First, Metronome, Mimic, Mirror Move, Nature Power, Noxious Torque, Protect, Rage Powder, Roar, Shell Trap, Sketch, Sleep Talk, Snatch, Spiky Shield, Spotlight, Struggle, Switcheroo, Tera Starstorm, Thief, Transform, Trick, Whirlwind, or Wicked Torque.","shortDesc":"Uses the last move used in the battle.","type":"Normal","num":383,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0},{"id":"covet","name":"Covet","desc":"If this attack was successful and the user has not fainted, it steals the target's held item if the user is not holding one. The target's item is not stolen if it is a Mail or Z-Crystal, or if the target is a Kyogre holding a Blue Orb, a Groudon holding a Red Orb, a Giratina holding a Griseous Orb, an Arceus holding a Plate, a Genesect holding a Drive, a Silvally holding a Memory, or a Pokemon that can Mega Evolve holding the Mega Stone for its species. Items lost to this move cannot be regained with Recycle or the Harvest Ability.","shortDesc":"If the user has no item, it steals the target's.","type":"Normal","num":343,"category":"Physical","priority":0,"accuracy":100,"pp":25,"basePower":60},{"id":"dazzlinggleam","name":"Dazzling Gleam","desc":"No additional effect.","shortDesc":"No additional effect. Hits adjacent foes.","type":"Fairy","num":605,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80},{"id":"defensecurl","name":"Defense Curl","desc":"Raises the user's Defense by 1 stage. As long as the user remains active, the power of the user's Ice Ball and Rollout will be doubled (this effect is not stackable).","shortDesc":"Raises the user's Defense by 1.","type":"Normal","num":111,"category":"Status","priority":0,"accuracy":true,"pp":40,"basePower":0},{"id":"disarmingvoice","name":"Disarming Voice","desc":"This move does not check accuracy.","shortDesc":"This move does not check accuracy. Hits foes.","type":"Fairy","num":574,"category":"Special","priority":0,"accuracy":true,"pp":15,"basePower":40},{"id":"doubleedge","name":"Double-Edge","desc":"If the target lost HP, the user takes recoil damage equal to 33% the HP lost by the target, rounded half up, but not less than 1 HP.","shortDesc":"Has 33% recoil.","type":"Normal","num":38,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":120},{"id":"drainpunch","name":"Drain Punch","desc":"The user recovers 1/2 the HP lost by the target, rounded half up. If Big Root is held by the user, the HP recovered is 1.3x normal, rounded half down.","shortDesc":"User recovers 50% of the damage dealt.","type":"Fighting","num":409,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":75},{"id":"earthquake","name":"Earthquake","desc":"Damage doubles if the target is using Dig.","shortDesc":"Hits adjacent Pokemon. Double damage on Dig.","type":"Ground","num":89,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":100},{"id":"echoedvoice","name":"Echoed Voice","desc":"For every consecutive turn that this move is used by at least one Pokemon, this move's power is multiplied by the number of turns to pass, but not more than 5.","shortDesc":"Power increases when used on consecutive turns.","type":"Normal","num":497,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":40},{"id":"electricterrain","name":"Electric Terrain","desc":"For 5 turns, the terrain becomes Electric Terrain. During the effect, the power of Electric-type attacks made by grounded Pokemon is multiplied by 1.3 and grounded Pokemon cannot fall asleep; Pokemon already asleep do not wake up. Grounded Pokemon cannot become affected by Yawn or fall asleep from its effect. Camouflage transforms the user into an Electric type, Nature Power becomes Thunderbolt, and Secret Power has a 30% chance to cause paralysis. Fails if the current terrain is Electric Terrain.","shortDesc":"5 turns. Grounded: +Electric power, can't sleep.","type":"Electric","num":604,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"endeavor","name":"Endeavor","desc":"Deals damage to the target equal to (target's current HP - user's current HP). The target is unaffected if its current HP is less than or equal to the user's current HP.","shortDesc":"Lowers the target's HP to the user's HP.","type":"Normal","num":283,"category":"Physical","priority":0,"accuracy":100,"pp":5,"basePower":0},{"id":"endure","name":"Endure","desc":"The user will survive attacks made by other Pokemon during this turn with at least 1 HP. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"User survives attacks this turn with at least 1 HP.","type":"Normal","num":203,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0},{"id":"facade","name":"Facade","desc":"Power doubles if the user is burned, paralyzed, or poisoned. The physical damage halving effect from the user's burn is ignored.","shortDesc":"Power doubles if user is burn/poison/paralyzed.","type":"Normal","num":263,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":70},{"id":"fireblast","name":"Fire Blast","desc":"Has a 10% chance to burn the target.","shortDesc":"10% chance to burn the target.","type":"Fire","num":126,"category":"Special","priority":0,"accuracy":85,"pp":5,"basePower":110},{"id":"firepunch","name":"Fire Punch","desc":"Has a 10% chance to burn the target.","shortDesc":"10% chance to burn the target.","type":"Fire","num":7,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":75},{"id":"flamethrower","name":"Flamethrower","desc":"Has a 10% chance to burn the target.","shortDesc":"10% chance to burn the target.","type":"Fire","num":53,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":90},{"id":"fling","name":"Fling","desc":"The power of this move is based on the user's held item. The held item is lost and it activates for the target if applicable. If there is no target or the target avoids this move by protecting itself, the user's held item is still lost. The user can regain a thrown item with Recycle or the Harvest Ability. Fails if the user has no held item, if the held item cannot be thrown, if the user is under the effect of Embargo or Magic Room, or if the user has the Klutz Ability.","shortDesc":"Flings the user's item at the target. Power varies.","type":"Dark","num":374,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":0},{"id":"focusblast","name":"Focus Blast","desc":"Has a 10% chance to lower the target's Special Defense by 1 stage.","shortDesc":"10% chance to lower the target's Sp. Def by 1.","type":"Fighting","num":411,"category":"Special","priority":0,"accuracy":70,"pp":5,"basePower":120},{"id":"focuspunch","name":"Focus Punch","desc":"The user loses its focus and does nothing if it is hit by a damaging attack this turn before it can execute the move.","shortDesc":"Fails if the user takes damage before it hits.","type":"Fighting","num":264,"category":"Physical","priority":-3,"accuracy":100,"pp":20,"basePower":150},{"id":"gigaimpact","name":"Giga Impact","desc":"If this move is successful, the user must recharge on the following turn and cannot select a move.","shortDesc":"User cannot move next turn.","type":"Normal","num":416,"category":"Physical","priority":0,"accuracy":90,"pp":5,"basePower":150},{"id":"grassknot","name":"Grass Knot","desc":"This move's power is 20 if the target weighs less than 10 kg, 40 if less than 25 kg, 60 if less than 50 kg, 80 if less than 100 kg, 100 if less than 200 kg, and 120 if greater than or equal to 200 kg.","shortDesc":"More power the heavier the target.","type":"Grass","num":447,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":0},{"id":"gravity","name":"Gravity","desc":"For 5 turns, the evasiveness of all active Pokemon is multiplied by 0.6. At the time of use, Bounce, Fly, Magnet Rise, Sky Drop, and Telekinesis end immediately for all active Pokemon. During the effect, Bounce, Fly, Flying Press, High Jump Kick, Jump Kick, Magnet Rise, Sky Drop, Splash, and Telekinesis are prevented from being used by all active Pokemon. Ground-type attacks, Spikes, Toxic Spikes, Sticky Web, and the Arena Trap Ability can affect Flying types or Pokemon with the Levitate Ability. Fails if this move is already in effect.","shortDesc":"5 turns: no Ground immunities, 1.67x accuracy.","type":"Psychic","num":356,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0},{"id":"healingwish","name":"Healing Wish","desc":"The user faints, and if the Pokemon brought out to replace it does not have full HP or has a non-volatile status condition, its HP is fully restored along with having any non-volatile status condition cured. The replacement is sent out at the end of the turn, and the healing happens before hazards take effect. This effect continues until a Pokemon that meets either of these conditions switches in at the user's position or gets swapped into the position with Ally Switch. Fails if the user is the last unfainted Pokemon in its party.","shortDesc":"User faints. Next hurt Pokemon is fully healed.","type":"Psychic","num":361,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"healpulse","name":"Heal Pulse","desc":"The target restores 1/2 of its maximum HP, rounded half up. If the user has the Mega Launcher Ability, the target instead restores 3/4 of its maximum HP, rounded half down.","shortDesc":"Heals the target by 50% of its max HP.","type":"Psychic","num":505,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"helpinghand","name":"Helping Hand","desc":"The power of the target's attack this turn is multiplied by 1.5 (this effect is stackable). Fails if there is no ally adjacent to the user or if the ally already moved this turn, but does not fail if the ally is using a two-turn move.","shortDesc":"One adjacent ally's move power is 1.5x this turn.","type":"Normal","num":270,"category":"Status","priority":5,"accuracy":true,"pp":20,"basePower":0},{"id":"hyperbeam","name":"Hyper Beam","desc":"If this move is successful, the user must recharge on the following turn and cannot select a move.","shortDesc":"User cannot move next turn.","type":"Normal","num":63,"category":"Special","priority":0,"accuracy":90,"pp":5,"basePower":150},{"id":"hypervoice","name":"Hyper Voice","desc":"No additional effect.","shortDesc":"No additional effect. Hits adjacent foes.","type":"Normal","num":304,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":90},{"id":"icebeam","name":"Ice Beam","desc":"Has a 10% chance to freeze the target.","shortDesc":"10% chance to freeze the target.","type":"Ice","num":58,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":90},{"id":"icepunch","name":"Ice Punch","desc":"Has a 10% chance to freeze the target.","shortDesc":"10% chance to freeze the target.","type":"Ice","num":8,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":75},{"id":"icywind","name":"Icy Wind","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance to lower the foe(s) Speed by 1.","type":"Ice","num":196,"category":"Special","priority":0,"accuracy":95,"pp":15,"basePower":55},{"id":"lastresort","name":"Last Resort","desc":"This move fails unless the user knows this move and at least one other move, and has used all the other moves it knows at least once each since it became active or Transformed.","shortDesc":"Fails unless each known move has been used.","type":"Normal","num":387,"category":"Physical","priority":0,"accuracy":100,"pp":5,"basePower":140},{"id":"lifedew","name":"Life Dew","desc":"Each Pokemon on the user's side restores 1/4 of its maximum HP, rounded half up.","shortDesc":"Heals the user and its allies by 1/4 their max HP.","type":"Water","num":791,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"lightscreen","name":"Light Screen","desc":"For 5 turns, the user and its party members take 0.5x damage from special attacks, or 0.66x damage if in a Double Battle. Damage is not reduced further with Aurora Veil. Critical hits ignore this effect. It is removed from the user's side if the user or an ally is successfully hit by Brick Break, Psychic Fangs, or Defog. Lasts for 8 turns if the user is holding Light Clay. Fails if the effect is already active on the user's side.","shortDesc":"For 5 turns, special damage to allies is halved.","type":"Psychic","num":113,"category":"Status","priority":0,"accuracy":true,"pp":30,"basePower":0},{"id":"metronome","name":"Metronome","desc":"A random move is selected for use, other than After You, Apple Acid, Armor Cannon, Assist, Astral Barrage, Aura Wheel, Baneful Bunker, Beak Blast, Behemoth Bash, Behemoth Blade, Belch, Bestow, Blazing Torque, Body Press, Branch Poke, Breaking Swipe, Celebrate, Chatter, Chilling Water, Chilly Reception, Clangorous Soul, Collision Course, Combat Torque, Comeuppance, Copycat, Counter, Covet, Crafty Shield, Decorate, Destiny Bond, Detect, Diamond Storm, Doodle, Double Iron Bash, Double Shock, Dragon Ascent, Dragon Energy, Drum Beating, Dynamax Cannon, Electro Drift, Endure, Eternabeam, False Surrender, Feint, Fiery Wrath, Fillet Away, Fleur Cannon, Focus Punch, Follow Me, Freeze Shock, Freezing Glare, Glacial Lance, Grav Apple, Helping Hand, Hold Hands, Hyper Drill, Hyperspace Fury, Hyperspace Hole, Ice Burn, Instruct, Jet Punch, Jungle Healing, King's Shield, Life Dew, Light of Ruin, Magical Torque, Make It Rain, Mat Block, Me First, Meteor Assault, Metronome, Mimic, Mind Blown, Mirror Coat, Mirror Move, Moongeist Beam, Nature Power, Nature's Madness, Noxious Torque, Obstruct, Order Up, Origin Pulse, Overdrive, Photon Geyser, Plasma Fists, Population Bomb, Pounce, Power Shift, Precipice Blades, Protect, Pyro Ball, Quash, Quick Guard, Rage Fist, Rage Powder, Raging Bull, Raging Fury, Relic Song, Revival Blessing, Ruination, Salt Cure, Secret Sword, Shed Tail, Shell Trap, Silk Trap, Sketch, Sleep Talk, Snap Trap, Snarl, Snatch, Snore, Snowscape, Spectral Thief, Spicy Extract, Spiky Shield, Spirit Break, Spotlight, Springtide Storm, Steam Eruption, Steel Beam, Strange Steam, Struggle, Sunsteel Strike, Surging Strikes, Switcheroo, Techno Blast, Tera Starstorm, Thief, Thousand Arrows, Thousand Waves, Thunder Cage, Thunderous Kick, Tidy Up, Trailblaze, Transform, Trick, Twin Beam, V-create, Wicked Blow, Wicked Torque, or Wide Guard.","shortDesc":"Picks a random move.","type":"Normal","num":118,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"pound","name":"Pound","desc":"No additional effect.","shortDesc":"No additional effect.","type":"Normal","num":1,"category":"Physical","priority":0,"accuracy":100,"pp":35,"basePower":40},{"id":"protect","name":"Protect","desc":"The user is protected from most attacks made by other Pokemon during this turn. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"Prevents moves from affecting the user this turn.","type":"Normal","num":182,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0},{"id":"psychic","name":"Psychic","desc":"Has a 10% chance to lower the target's Special Defense by 1 stage.","shortDesc":"10% chance to lower the target's Sp. Def by 1.","type":"Psychic","num":94,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":90},{"id":"psychup","name":"Psych Up","desc":"The user copies all of the target's current stat stage changes.","shortDesc":"Copies the target's current stat stages.","type":"Normal","num":244,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"raindance","name":"Rain Dance","desc":"For 5 turns, the weather becomes Rain Dance. The damage of Water-type attacks is multiplied by 1.5 and the damage of Fire-type attacks is multiplied by 0.5 during the effect. Lasts for 8 turns if the user is holding Damp Rock. Fails if the current weather is Rain Dance.","shortDesc":"For 5 turns, heavy rain powers Water moves.","type":"Water","num":240,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0},{"id":"rest","name":"Rest","desc":"The user falls asleep for the next two turns and restores all of its HP, curing itself of any non-volatile status condition in the process. Fails if the user has full HP, is already asleep, or if another effect is preventing sleep.","shortDesc":"User sleeps 2 turns and restores HP and status.","type":"Psychic","num":156,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0},{"id":"rockslide","name":"Rock Slide","desc":"Has a 30% chance to make the target flinch.","shortDesc":"30% chance to make the foe(s) flinch.","type":"Rock","num":157,"category":"Physical","priority":0,"accuracy":90,"pp":10,"basePower":75},{"id":"rocktomb","name":"Rock Tomb","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance to lower the target's Speed by 1.","type":"Rock","num":317,"category":"Physical","priority":0,"accuracy":95,"pp":15,"basePower":60},{"id":"sandstorm","name":"Sandstorm","desc":"For 5 turns, the weather becomes Sandstorm. At the end of each turn except the last, all active Pokemon lose 1/16 of their maximum HP, rounded down, unless they are a Ground, Rock, or Steel type, or have the Magic Guard, Overcoat, Sand Force, Sand Rush, or Sand Veil Abilities. During the effect, the Special Defense of Rock-type Pokemon is multiplied by 1.5 when taking damage from a special attack. Lasts for 8 turns if the user is holding Smooth Rock. Fails if the current weather is Sandstorm.","shortDesc":"For 5 turns, a sandstorm rages. Rock: 1.5x SpD.","type":"Rock","num":201,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"shadowball","name":"Shadow Ball","desc":"Has a 20% chance to lower the target's Special Defense by 1 stage.","shortDesc":"20% chance to lower the target's Sp. Def by 1.","type":"Ghost","num":247,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":80},{"id":"sing","name":"Sing","desc":"Causes the target to fall asleep.","shortDesc":"Causes the target to fall asleep.","type":"Normal","num":47,"category":"Status","priority":0,"accuracy":55,"pp":15,"basePower":0},{"id":"skillswap","name":"Skill Swap","desc":"The user swaps its Ability with the target's Ability. Fails if either the user or the target's Ability is As One, Battle Bond, Comatose, Commander, Disguise, Embody Aspect, Hunger Switch, Ice Face, Illusion, Multitype, Neutralizing Gas, Poison Puppeteer, Power Construct, Protosynthesis, Quark Drive, RKS System, Schooling, Shields Down, Stance Change, Tera Shell, Tera Shift, Teraform Zero, Wonder Guard, Zen Mode, or Zero to Hero.","shortDesc":"The user and the target trade Abilities.","type":"Psychic","num":285,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"sleeptalk","name":"Sleep Talk","desc":"One of the user's known moves, besides this move, is selected for use at random. Fails if the user is not asleep. The selected move does not have PP deducted from it, and can currently have 0 PP. This move cannot select Assist, Beak Blast, Belch, Bide, Blazing Torque, Celebrate, Chatter, Combat Torque, Copycat, Dynamax Cannon, Focus Punch, Hold Hands, Magical Torque, Me First, Metronome, Mimic, Mirror Move, Nature Power, Noxious Torque, Shell Trap, Sketch, Sleep Talk, Struggle, Uproar, Wicked Torque, or any two-turn move.","shortDesc":"User must be asleep. Uses another known move.","type":"Normal","num":214,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"snowscape","name":"Snowscape","desc":"For 5 turns, the weather becomes Snow. During the effect, the Defense of Ice-type Pokemon is multiplied by 1.5 when taking damage from a physical attack. Lasts for 8 turns if the user is holding Icy Rock. Fails if the current weather is Snow.","shortDesc":"For 5 turns, snow falls. Ice: 1.5x Def.","type":"Ice","num":883,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"softboiled","name":"Soft-Boiled","desc":"The user restores 1/2 of its maximum HP, rounded half up.","shortDesc":"Heals the user by 50% of its max HP.","type":"Normal","num":135,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0},{"id":"solarbeam","name":"Solar Beam","desc":"This attack charges on the first turn and executes on the second. Power is halved if the weather is Primordial Sea, Rain Dance, Sandstorm, or Snow and the user is not holding Utility Umbrella. If the user is holding a Power Herb or the weather is Desolate Land or Sunny Day, the move completes in one turn. If the user is holding Utility Umbrella and the weather is Desolate Land or Sunny Day, the move still requires a turn to charge.","shortDesc":"Charges turn 1. Hits turn 2. No charge in sunlight.","type":"Grass","num":76,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":120},{"id":"stealthrock","name":"Stealth Rock","desc":"Sets up a hazard on the opposing side of the field, damaging each opposing Pokemon that switches in. Fails if the effect is already active on the opposing side. Foes lose 1/32, 1/16, 1/8, 1/4, or 1/2 of their maximum HP, rounded down, based on their weakness to the Rock type; 0.25x, 0.5x, neutral, 2x, or 4x, respectively. Can be removed from the opposing side if any opposing Pokemon uses Mortal Spin, Rapid Spin, or Defog successfully, or is hit by Defog.","shortDesc":"Hurts foes on switch-in. Factors Rock weakness.","type":"Rock","num":446,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0},{"id":"stompingtantrum","name":"Stomping Tantrum","desc":"Power doubles if the user's last move on the previous turn, including moves called by other moves or those used through Instruct, Magic Coat, Snatch, or the Dancer or Magic Bounce Abilities, failed to do any of its normal effects, not including damage from an unsuccessful High Jump Kick, Jump Kick, or Mind Blown, or if the user was prevented from moving by any effect other than recharging or Sky Drop. A move that was blocked by Baneful Bunker, Detect, King's Shield, Protect, Spiky Shield, Crafty Shield, Mat Block, Quick Guard, or Wide Guard will not double this move's power, nor will Bounce or Fly ending early due to the effect of Gravity, Smack Down, or Thousand Arrows.","shortDesc":"Power doubles if the user's last move failed.","type":"Ground","num":707,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":75},{"id":"storedpower","name":"Stored Power","desc":"Power is equal to 20+(X*20), where X is the user's total stat stage changes that are greater than 0.","shortDesc":" + 20 power for each of the user's stat boosts.","type":"Psychic","num":500,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":20},{"id":"substitute","name":"Substitute","desc":"The user takes 1/4 of its maximum HP, rounded down, and puts it into a substitute to take its place in battle. The substitute is removed once enough damage is inflicted on it, or if the user switches out or faints. Baton Pass can be used to transfer the substitute to an ally, and the substitute will keep its remaining HP. Until the substitute is broken, it receives damage from all attacks made by other Pokemon and shields the user from status effects and stat stage changes caused by other Pokemon. Sound-based moves and Pokemon with the Infiltrator Ability ignore substitutes. The user still takes normal damage from weather and status effects while behind its substitute. If the substitute breaks during a multi-hit attack, the user will take damage from any remaining hits. If a substitute is created while the user is trapped by a binding move, the binding effect ends immediately. Fails if the user does not have enough HP remaining to create a substitute without fainting, or if it already has a substitute.","shortDesc":"User takes 1/4 its max HP to put in a substitute.","type":"Normal","num":164,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"sunnyday","name":"Sunny Day","desc":"For 5 turns, the weather becomes Sunny Day. The damage of Fire-type attacks is multiplied by 1.5 and the damage of Water-type attacks is multiplied by 0.5 during the effect. Lasts for 8 turns if the user is holding Heat Rock. Fails if the current weather is Sunny Day.","shortDesc":"For 5 turns, intense sunlight powers Fire moves.","type":"Fire","num":241,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0},{"id":"sweetkiss","name":"Sweet Kiss","desc":"Causes the target to become confused.","shortDesc":"Causes the target to become confused.","type":"Fairy","num":186,"category":"Status","priority":0,"accuracy":75,"pp":10,"basePower":0},{"id":"swift","name":"Swift","desc":"This move does not check accuracy.","shortDesc":"This move does not check accuracy. Hits foes.","type":"Normal","num":129,"category":"Special","priority":0,"accuracy":true,"pp":20,"basePower":60},{"id":"tailwhip","name":"Tail Whip","desc":"Lowers the target's Defense by 1 stage.","shortDesc":"Lowers the foe(s) Defense by 1.","type":"Normal","num":39,"category":"Status","priority":0,"accuracy":100,"pp":30,"basePower":0},{"id":"takedown","name":"Take Down","desc":"If the target lost HP, the user takes recoil damage equal to 1/4 the HP lost by the target, rounded half up, but not less than 1 HP.","shortDesc":"Has 1/4 recoil.","type":"Normal","num":36,"category":"Physical","priority":0,"accuracy":85,"pp":20,"basePower":90},{"id":"terablast","name":"Tera Blast","desc":"If the user is Terastallized, this move becomes a physical attack if the user's Attack is greater than its Special Attack, including stat stage changes, and this move's type becomes the same as the user's Tera Type. In addition, if the user's Tera Type is Stellar, this move has 100 power, is super effective against Terastallized targets and neutral against other targets, and lowers the user's Attack and Special Attack by 1 stage.","shortDesc":"If Terastallized: Phys. if Atk > SpA, type = Tera.","type":"Normal","num":851,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80},{"id":"thief","name":"Thief","desc":"If this attack was successful and the user has not fainted, it steals the target's held item if the user is not holding one. The target's item is not stolen if it is a Mail or Z-Crystal, or if the target is a Kyogre holding a Blue Orb, a Groudon holding a Red Orb, a Giratina holding a Griseous Orb, an Arceus holding a Plate, a Genesect holding a Drive, a Silvally holding a Memory, or a Pokemon that can Mega Evolve holding the Mega Stone for its species. Items lost to this move cannot be regained with Recycle or the Harvest Ability.","shortDesc":"If the user has no item, it steals the target's.","type":"Dark","num":168,"category":"Physical","priority":0,"accuracy":100,"pp":25,"basePower":60},{"id":"thunder","name":"Thunder","desc":"Has a 30% chance to paralyze the target. This move can hit a target using Bounce, Fly, or Sky Drop, or is under the effect of Sky Drop. If the weather is Primordial Sea or Rain Dance, this move does not check accuracy. If the weather is Desolate Land or Sunny Day, this move's accuracy is 50%. If this move is used against a Pokemon holding Utility Umbrella, this move's accuracy remains at 70%.","shortDesc":"30% chance to paralyze. Can't miss in rain.","type":"Electric","num":87,"category":"Special","priority":0,"accuracy":70,"pp":10,"basePower":110},{"id":"thunderbolt","name":"Thunderbolt","desc":"Has a 10% chance to paralyze the target.","shortDesc":"10% chance to paralyze the target.","type":"Electric","num":85,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":90},{"id":"thunderpunch","name":"Thunder Punch","desc":"Has a 10% chance to paralyze the target.","shortDesc":"10% chance to paralyze the target.","type":"Electric","num":9,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":75},{"id":"thunderwave","name":"Thunder Wave","desc":"Paralyzes the target. This move does not ignore type immunity.","shortDesc":"Paralyzes the target.","type":"Electric","num":86,"category":"Status","priority":0,"accuracy":90,"pp":20,"basePower":0},{"id":"trailblaze","name":"Trailblaze","desc":"Has a 100% chance to raise the user's Speed by 1 stage.","shortDesc":"100% chance to raise the user's Speed by 1.","type":"Grass","num":885,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":50},{"id":"trick","name":"Trick","desc":"The user swaps its held item with the target's held item. Fails if either the user or the target is holding a Mail or Z-Crystal, if neither is holding an item, if the user is trying to give or take a Mega Stone to or from the species that can Mega Evolve with it, or if the user is trying to give or take a Blue Orb, a Red Orb, a Griseous Orb, a Plate, a Drive, or a Memory to or from a Kyogre, a Groudon, a Giratina, an Arceus, a Genesect, or a Silvally, respectively. The target is immune to this move if it has the Sticky Hold Ability.","shortDesc":"User switches its held item with the target's.","type":"Psychic","num":271,"category":"Status","priority":0,"accuracy":100,"pp":10,"basePower":0},{"id":"waterpulse","name":"Water Pulse","desc":"Has a 20% chance to confuse the target.","shortDesc":"20% chance to confuse the target.","type":"Water","num":352,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":60},{"id":"wildcharge","name":"Wild Charge","desc":"If the target lost HP, the user takes recoil damage equal to 1/4 the HP lost by the target, rounded half up, but not less than 1 HP.","shortDesc":"Has 1/4 recoil.","type":"Electric","num":528,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":90},{"id":"zenheadbutt","name":"Zen Headbutt","desc":"Has a 20% chance to make the target flinch.","shortDesc":"20% chance to make the target flinch.","type":"Psychic","num":428,"category":"Physical","priority":0,"accuracy":90,"pp":15,"basePower":80}],"abilities":[{"name":"Natural Cure","id":"naturalcure","desc":"This Pokemon has its non-volatile status condition cured when it switches out.","shortDesc":"This Pokemon has its non-volatile status condition cured when it switches out.","num":30},{"name":"Serene Grace","id":"serenegrace","desc":"This Pokemon's moves have their secondary effect chance doubled. This effect stacks with the Rainbow effect, except for secondary effects that cause the target to flinch.","shortDesc":"This Pokemon's moves have their secondary effect chance doubled.","num":32},{"name":"Healer","id":"healer","desc":"30% chance this Pokemon's ally has its non-volatile status condition cured at the end of each turn.","shortDesc":"30% chance this Pokemon's ally has its status cured at the end of each turn.","num":131}],"teammates":[],"items":[],"spreads":[]}