{"name":"Brambleghast","id":"brambleghast","num":947,"moves":[{"id":"poltergeist","name":"Poltergeist","desc":"Fails if the target has no held item.","shortDesc":"Fails if the target has no held item.","type":"Ghost","num":809,"category":"Physical","priority":0,"accuracy":90,"pp":5,"basePower":110,"weightedUsage":0.9492478466105243},{"id":"shadowsneak","name":"Shadow Sneak","desc":"No additional effect.","shortDesc":"Usually goes first.","type":"Ghost","num":425,"category":"Physical","priority":1,"accuracy":100,"pp":30,"basePower":40,"weightedUsage":0.8352244971866524},{"id":"protect","name":"Protect","desc":"The user is protected from most attacks made by other Pokemon during this turn. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"Prevents moves from affecting the user this turn.","type":"Normal","num":182,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.7747390062525833},{"id":"powerwhip","name":"Power Whip","desc":"No additional effect.","shortDesc":"No additional effect.","type":"Grass","num":438,"category":"Physical","priority":0,"accuracy":85,"pp":10,"basePower":120,"weightedUsage":0.6004888263974621},{"id":"seedbomb","name":"Seed Bomb","desc":"No additional effect.","shortDesc":"No additional effect.","type":"Grass","num":402,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":80,"weightedUsage":0.3919312402746949},{"id":"strengthsap","name":"Strength Sap","desc":"Lowers the target's Attack by 1 stage. The user restores its HP equal to the target's Attack stat calculated with its stat stage before this move was used. If Big Root is held by the user, the HP recovered is 1.3x normal, rounded half down. Fails if the target's Attack stat stage is -6.","shortDesc":"User heals HP=target's Atk stat. Lowers Atk by 1.","type":"Grass","num":668,"category":"Status","priority":0,"accuracy":100,"pp":10,"basePower":0,"weightedUsage":0.243340304902265},{"id":"terablast","name":"Tera Blast","desc":"If the user is Terastallized, this move becomes a physical attack if the user's Attack is greater than its Special Attack, including stat stage changes, and this move's type becomes the same as the user's Tera Type. In addition, if the user's Tera Type is Stellar, this move has 100 power, is super effective against Terastallized targets and neutral against other targets, and lowers the user's Attack and Special Attack by 1 stage.","shortDesc":"If Terastallized: Phys. if Atk > SpA, type = Tera.","type":"Normal","num":851,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80,"weightedUsage":0.15404230616140954},{"id":"bulletseed","name":"Bullet Seed","desc":"Hits two to five times. Has a 35% chance to hit two or three times and a 15% chance to hit four or five times. If one of the hits breaks the target's substitute, it will take damage for the remaining hits. If the user has the Skill Link Ability, this move will always hit five times.","shortDesc":"Hits 2-5 times in one turn.","type":"Grass","num":331,"category":"Physical","priority":0,"accuracy":100,"pp":30,"basePower":25,"weightedUsage":0.01413263346157786},{"id":"phantomforce","name":"Phantom Force","desc":"If this move is successful, it breaks through the target's Baneful Bunker, Detect, King's Shield, Protect, or Spiky Shield for this turn, allowing other Pokemon to attack the target normally. If the target's side is protected by Crafty Shield, Mat Block, Quick Guard, or Wide Guard, that protection is also broken for this turn and other Pokemon may attack the target's side normally. This attack charges on the first turn and executes on the second. On the first turn, the user avoids all attacks. If the user is holding a Power Herb, the move completes in one turn.","shortDesc":"Disappears turn 1. Hits turn 2. Breaks protection.","type":"Ghost","num":566,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":90,"weightedUsage":0.011973294023948047},{"id":"infestation","name":"Infestation","desc":"Prevents the target from switching for four or five turns (seven turns if the user is holding Grip Claw). Causes damage to the target equal to 1/8 of its maximum HP (1/6 if the user is holding Binding Band), rounded down, at the end of each turn during effect. The target can still switch out if it is holding Shed Shell or uses Baton Pass, Flip Turn, Parting Shot, Shed Tail, Teleport, U-turn, or Volt Switch. The effect ends if either the user or the target leaves the field, or if the target uses Mortal Spin, Rapid Spin, or Substitute successfully. This effect is not stackable or reset by using this or another binding move.","shortDesc":"Traps and damages the target for 4-5 turns.","type":"Bug","num":611,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":20,"weightedUsage":0.005269455393258617},{"id":"gigadrain","name":"Giga Drain","desc":"The user recovers 1/2 the HP lost by the target, rounded half up. If Big Root is held by the user, the HP recovered is 1.3x normal, rounded half down.","shortDesc":"User recovers 50% of the damage dealt.","type":"Grass","num":202,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":75,"weightedUsage":0.005165464135003134},{"id":"curse","name":"Curse","desc":"If the user is not a Ghost type, lowers the user's Speed by 1 stage and raises the user's Attack and Defense by 1 stage. If the user is a Ghost type, the user loses 1/2 of its maximum HP, rounded down and even if it would cause fainting, in exchange for the target losing 1/4 of its maximum HP, rounded down, at the end of each turn while it is active. If the target uses Baton Pass, the replacement will continue to be affected. Fails if there is no target or if the target is already affected.","shortDesc":"Curses if Ghost, else -1 Spe, +1 Atk, +1 Def.","type":"Ghost","num":174,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.004265157756592106},{"id":"pounce","name":"Pounce","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance to lower the target's Speed by 1.","type":"Bug","num":884,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":50,"weightedUsage":0.002255446391492488},{"id":"beatup","name":"Beat Up","desc":"Hits one time for the user and one time for each unfainted Pokemon without a non-volatile status condition in the user's party. The power of each hit is equal to 5+(X/10), where X is each participating Pokemon's base Attack; each hit is considered to come from the user.","shortDesc":"All healthy allies aid in damaging the target.","type":"Dark","num":251,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":0,"weightedUsage":0.0020190256311896386},{"id":"trailblaze","name":"Trailblaze","desc":"Has a 100% chance to raise the user's Speed by 1 stage.","shortDesc":"100% chance to raise the user's Speed by 1.","type":"Grass","num":885,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":50,"weightedUsage":0.001519949435731918},{"id":"nightshade","name":"Night Shade","desc":"Deals damage to the target equal to the user's level.","shortDesc":"Does damage equal to the user's level.","type":"Ghost","num":101,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":0,"weightedUsage":0.0010051770907170171},{"id":"rapidspin","name":"Rapid Spin","desc":"If this move is successful and the user has not fainted, the effects of Leech Seed and binding moves end for the user, and all hazards are removed from the user's side of the field. Has a 100% chance to raise the user's Speed by 1 stage.","shortDesc":"Free user from hazards/bind/Leech Seed; +1 Spe.","type":"Normal","num":229,"category":"Physical","priority":0,"accuracy":100,"pp":40,"basePower":50,"weightedUsage":0.0008534905479486061},{"id":"thief","name":"Thief","desc":"If this attack was successful and the user has not fainted, it steals the target's held item if the user is not holding one. The target's item is not stolen if it is a Mail or Z-Crystal, or if the target is a Kyogre holding a Blue Orb, a Groudon holding a Red Orb, a Giratina holding a Griseous Orb, an Arceus holding a Plate, a Genesect holding a Drive, a Silvally holding a Memory, or a Pokemon that can Mega Evolve holding the Mega Stone for its species. Items lost to this move cannot be regained with Recycle or the Harvest Ability.","shortDesc":"If the user has no item, it steals the target's.","type":"Dark","num":168,"category":"Physical","priority":0,"accuracy":100,"pp":25,"basePower":60,"weightedUsage":0.0008114052366035299},{"id":"leechseed","name":"Leech Seed","desc":"The Pokemon at the user's position steals 1/8 of the target's maximum HP, rounded down, at the end of each turn. If Big Root is held by the recipient, the HP recovered is 1.3x normal, rounded half down. If the target uses Baton Pass, the replacement will continue being leeched. If the target switches out or uses Mortal Spin or Rapid Spin successfully, the effect ends. Grass-type Pokemon are immune to this move on use, but not its effect.","shortDesc":"1/8 of target's HP is restored to user every turn.","type":"Grass","num":73,"category":"Status","priority":0,"accuracy":90,"pp":10,"basePower":0,"weightedUsage":0.0007213719973641134},{"id":"skittersmack","name":"Skitter Smack","desc":"Has a 100% chance to lower the target's Special Attack by 1 stage.","shortDesc":"100% chance to lower target's Sp. Atk by 1.","type":"Bug","num":806,"category":"Physical","priority":0,"accuracy":90,"pp":10,"basePower":70,"weightedUsage":0.00032093392204893094},{"id":"spikes","name":"Spikes","desc":"Sets up a hazard on the opposing side of the field, damaging each opposing Pokemon that switches in, unless it is a Flying-type Pokemon or has the Levitate Ability. Can be used up to three times before failing. Opponents lose 1/8 of their maximum HP with one layer, 1/6 of their maximum HP with two layers, and 1/4 of their maximum HP with three layers, all rounded down. Can be removed from the opposing side if any opposing Pokemon uses Mortal Spin, Rapid Spin, or Defog successfully, or is hit by Defog.","shortDesc":"Hurts grounded foes on switch-in. Max 3 layers.","type":"Ground","num":191,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0,"weightedUsage":0.00027966502476814333},{"id":"facade","name":"Facade","desc":"Power doubles if the user is burned, paralyzed, or poisoned. The physical damage halving effect from the user's burn is ignored.","shortDesc":"Power doubles if user is burn/poison/paralyzed.","type":"Normal","num":263,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":70,"weightedUsage":0.00023035301616980975},{"id":"grassyglide","name":"Grassy Glide","desc":"If the current terrain is Grassy Terrain and the user is grounded, this move has its priority increased by 1.","shortDesc":"User on Grassy Terrain: +1 priority.","type":"Grass","num":803,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":55,"weightedUsage":0.00011793454837042371},{"id":"disable","name":"Disable","desc":"For 4 turns, the target's last move used becomes disabled. Fails if one of the target's moves is already disabled, if the target has not made a move, if the target no longer knows the move, or if the move was a Max or G-Max Move.","shortDesc":"For 4 turns, disables the target's last move used.","type":"Normal","num":50,"category":"Status","priority":0,"accuracy":100,"pp":20,"basePower":0,"weightedUsage":0.000028383976841054798},{"id":"substitute","name":"Substitute","desc":"The user takes 1/4 of its maximum HP, rounded down, and puts it into a substitute to take its place in battle. The substitute is removed once enough damage is inflicted on it, or if the user switches out or faints. Baton Pass can be used to transfer the substitute to an ally, and the substitute will keep its remaining HP. Until the substitute is broken, it receives damage from all attacks made by other Pokemon and shields the user from status effects and stat stage changes caused by other Pokemon. Sound-based moves and Pokemon with the Infiltrator Ability ignore substitutes. The user still takes normal damage from weather and status effects while behind its substitute. If the substitute breaks during a multi-hit attack, the user will take damage from any remaining hits. If a substitute is created while the user is trapped by a binding move, the binding effect ends immediately. Fails if the user does not have enough HP remaining to create a substitute without fainting, or if it already has a substitute.","shortDesc":"User takes 1/4 its max HP to put in a substitute.","type":"Normal","num":164,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.000011381592618893528},{"id":"hex","name":"Hex","desc":"Power doubles if the target has a non-volatile status condition.","shortDesc":"Power doubles if the target has a status ailment.","type":"Ghost","num":506,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":65,"weightedUsage":0.000003482445425195642},{"id":"gigaimpact","name":"Giga Impact","desc":"If this move is successful, the user must recharge on the following turn and cannot select a move.","shortDesc":"User cannot move next turn.","type":"Normal","num":416,"category":"Physical","priority":0,"accuracy":90,"pp":5,"basePower":150,"weightedUsage":0.0000011525479956978191},{"id":"confuseray","name":"Confuse Ray","desc":"Causes the target to become confused.","shortDesc":"Confuses the target.","type":"Ghost","num":109,"category":"Status","priority":0,"accuracy":100,"pp":10,"basePower":0,"weightedUsage":7.321733389568815e-7},{"id":"painsplit","name":"Pain Split","desc":"The user and the target's HP become the average of their current HP, rounded down, but not more than the maximum HP of either one.","shortDesc":"Shares HP of user and target equally.","type":"Normal","num":220,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0,"weightedUsage":5.2888274514211995e-8},{"id":"megadrain","name":"Mega Drain","desc":"The user recovers 1/2 the HP lost by the target, rounded half up. If Big Root is held by the user, the HP recovered is 1.3x normal, rounded half down.","shortDesc":"User recovers 50% of the damage dealt.","type":"Grass","num":72,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":40,"weightedUsage":2.8576922485929375e-8},{"id":"leafstorm","name":"Leaf Storm","desc":"Lowers the user's Special Attack by 2 stages.","shortDesc":"Lowers the user's Sp. Atk by 2.","type":"Grass","num":437,"category":"Special","priority":0,"accuracy":90,"pp":5,"basePower":130,"weightedUsage":1.833094909848257e-10},{"id":"energyball","name":"Energy Ball","desc":"Has a 10% chance to lower the target's Special Defense by 1 stage.","shortDesc":"10% chance to lower the target's Sp. Def by 1.","type":"Grass","num":412,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":90,"weightedUsage":4.197365230592192e-15},{"id":"grassyterrain","name":"Grassy Terrain","desc":"For 5 turns, the terrain becomes Grassy Terrain. During the effect, the power of Grass-type attacks used by grounded Pokemon is multiplied by 1.3, the power of Bulldoze, Earthquake, and Magnitude used against grounded Pokemon is multiplied by 0.5, and grounded Pokemon have 1/16 of their maximum HP, rounded down, restored at the end of each turn, including the last turn. Camouflage transforms the user into a Grass type, Nature Power becomes Energy Ball, and Secret Power has a 30% chance to cause sleep. Fails if the current terrain is Grassy Terrain.","shortDesc":"5 turns. Grounded: +Grass power, +1/16 max HP.","type":"Grass","num":580,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":8.278826884797223e-18},{"id":"rest","name":"Rest","desc":"The user falls asleep for the next two turns and restores all of its HP, curing itself of any non-volatile status condition in the process. Fails if the user has full HP, is already asleep, or if another effect is preventing sleep.","shortDesc":"User sleeps 2 turns and restores HP and status.","type":"Psychic","num":156,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0,"weightedUsage":0},{"id":"grassknot","name":"Grass Knot","desc":"This move's power is 20 if the target weighs less than 10 kg, 40 if less than 25 kg, 60 if less than 50 kg, 80 if less than 100 kg, 100 if less than 200 kg, and 120 if greater than or equal to 200 kg.","shortDesc":"More power the heavier the target.","type":"Grass","num":447,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":0,"weightedUsage":0},{"id":"shadowball","name":"Shadow Ball","desc":"Has a 20% chance to lower the target's Special Defense by 1 stage.","shortDesc":"20% chance to lower the target's Sp. Def by 1.","type":"Ghost","num":247,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":80,"weightedUsage":0},{"id":"rollout","name":"Rollout","desc":"If this move is successful, the user is locked into this move and cannot make another move until it misses, 5 turns have passed, or the attack cannot be used. Power doubles with each successful hit of this move and doubles again if Defense Curl was used previously by the user. If this move is called by Sleep Talk, the move is used for one turn.","shortDesc":"Power doubles with each hit. Repeats for 5 turns.","type":"Rock","num":205,"category":"Physical","priority":0,"accuracy":90,"pp":20,"basePower":30,"weightedUsage":0}]}