{"name":"Cramorant","id":"cramorant","num":845,"moves":[{"id":"surf","name":"Surf","desc":"Damage doubles if the target is using Dive.","shortDesc":"Hits adjacent Pokemon. Double damage on Dive.","type":"Water","num":57,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":90,"weightedUsage":0.9964481496320968},{"id":"icywind","name":"Icy Wind","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance to lower the foe(s) Speed by 1.","type":"Ice","num":196,"category":"Special","priority":0,"accuracy":95,"pp":15,"basePower":55,"weightedUsage":0.9161620297377735},{"id":"protect","name":"Protect","desc":"The user is protected from most attacks made by other Pokemon during this turn. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"Prevents moves from affecting the user this turn.","type":"Normal","num":182,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.8957798944440823},{"id":"tailwind","name":"Tailwind","desc":"For 4 turns, the user and its party members have their Speed doubled. Fails if this move is already in effect for the user's side.","shortDesc":"For 4 turns, allies' Speed is doubled.","type":"Flying","num":366,"category":"Status","priority":0,"accuracy":true,"pp":15,"basePower":0,"weightedUsage":0.7734126868573694},{"id":"hurricane","name":"Hurricane","desc":"Has a 30% chance to confuse the target. This move can hit a target using Bounce, Fly, or Sky Drop, or is under the effect of Sky Drop. If the weather is Primordial Sea or Rain Dance, this move does not check accuracy. If the weather is Desolate Land or Sunny Day, this move's accuracy is 50%. If this move is used against a Pokemon holding Utility Umbrella, this move's accuracy remains at 70%.","shortDesc":"30% chance to confuse target. Can't miss in rain.","type":"Flying","num":542,"category":"Special","priority":0,"accuracy":70,"pp":10,"basePower":110,"weightedUsage":0.22316648107906703},{"id":"icebeam","name":"Ice Beam","desc":"Has a 10% chance to freeze the target.","shortDesc":"10% chance to freeze the target.","type":"Ice","num":58,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":90,"weightedUsage":0.10403563365964917},{"id":"weatherball","name":"Weather Ball","desc":"Power doubles if a weather condition other than Delta Stream is active, and this move's type changes to match. Ice type during Snow, Water type during Primordial Sea or Rain Dance, Rock type during Sandstorm, and Fire type during Desolate Land or Sunny Day. If the user is holding Utility Umbrella and uses Weather Ball during Primordial Sea, Rain Dance, Desolate Land, or Sunny Day, this move remains Normal type and does not double in power.","shortDesc":"Power doubles and type varies in each weather.","type":"Normal","num":311,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":50,"weightedUsage":0.07920739826624733},{"id":"dive","name":"Dive","desc":"This attack charges on the first turn and executes on the second. On the first turn, the user avoids all attacks other than Surf and Whirlpool but takes double damage from them, and is also unaffected by weather. If the user is holding a Power Herb, the move completes in one turn.","shortDesc":"Dives underwater turn 1, strikes turn 2.","type":"Water","num":291,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":80,"weightedUsage":0.003849062018845728},{"id":"featherdance","name":"Feather Dance","desc":"Lowers the target's Attack by 2 stages.","shortDesc":"Lowers the target's Attack by 2.","type":"Flying","num":297,"category":"Status","priority":0,"accuracy":100,"pp":15,"basePower":0,"weightedUsage":0.0025766826589529047},{"id":"terablast","name":"Tera Blast","desc":"If the user is Terastallized, this move becomes a physical attack if the user's Attack is greater than its Special Attack, including stat stage changes, and this move's type becomes the same as the user's Tera Type. In addition, if the user's Tera Type is Stellar, this move has 100 power, is super effective against Terastallized targets and neutral against other targets, and lowers the user's Attack and Special Attack by 1 stage.","shortDesc":"If Terastallized: Phys. if Atk > SpA, type = Tera.","type":"Normal","num":851,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80,"weightedUsage":0.0013466781837255357},{"id":"chillingwater","name":"Chilling Water","desc":"Has a 100% chance to lower the target's Attack by 1 stage.","shortDesc":"100% chance to lower the target's Attack by 1.","type":"Water","num":886,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":50,"weightedUsage":0.0011230301967452203},{"id":"stockpile","name":"Stockpile","desc":"Raises the user's Defense and Special Defense by 1 stage. The user's Stockpile count increases by 1. Fails if the user's Stockpile count is 3. The user's Stockpile count is reset to 0 when it is no longer active.","shortDesc":"Raises user's Defense, Sp. Def by 1. Max 3 uses.","type":"Normal","num":254,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0,"weightedUsage":0.000701376052421015},{"id":"raindance","name":"Rain Dance","desc":"For 5 turns, the weather becomes Rain Dance. The damage of Water-type attacks is multiplied by 1.5 and the damage of Fire-type attacks is multiplied by 0.5 during the effect. Lasts for 8 turns if the user is holding Damp Rock. Fails if the current weather is Rain Dance.","shortDesc":"For 5 turns, heavy rain powers Water moves.","type":"Water","num":240,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0,"weightedUsage":0.0003308051818387292},{"id":"roost","name":"Roost","desc":"The user restores 1/2 of its maximum HP, rounded half up. If the user is not Terastallized, until the end of the turn Flying-type users lose their Flying type and pure Flying-type users become Normal type. Does nothing if the user's HP is full.","shortDesc":"Heals 50% HP. Flying-type removed 'til turn ends.","type":"Flying","num":355,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0,"weightedUsage":0.00021281755152361364},{"id":"endure","name":"Endure","desc":"The user will survive attacks made by other Pokemon during this turn with at least 1 HP. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"User survives attacks this turn with at least 1 HP.","type":"Normal","num":203,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.00016110710905206557},{"id":"airslash","name":"Air Slash","desc":"Has a 30% chance to make the target flinch.","shortDesc":"30% chance to make the target flinch.","type":"Flying","num":403,"category":"Special","priority":0,"accuracy":95,"pp":15,"basePower":75,"weightedUsage":0.00011791786549350636},{"id":"reversal","name":"Reversal","desc":"The power of this move is 20 if X is 33 to 48, 40 if X is 17 to 32, 80 if X is 10 to 16, 100 if X is 5 to 9, 150 if X is 2 to 4, and 200 if X is 0 or 1, where X is equal to (user's current HP * 48 / user's maximum HP), rounded down.","shortDesc":"More power the less HP the user has left.","type":"Fighting","num":179,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":0,"weightedUsage":0.00010900095125347289},{"id":"hydropump","name":"Hydro Pump","desc":"No additional effect.","shortDesc":"No additional effect.","type":"Water","num":56,"category":"Special","priority":0,"accuracy":80,"pp":5,"basePower":110,"weightedUsage":0.00009586849202751506},{"id":"acrobatics","name":"Acrobatics","desc":"Power doubles if the user has no held item.","shortDesc":"Power doubles if the user has no held item.","type":"Flying","num":512,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":55,"weightedUsage":0.000091621910254446},{"id":"drillpeck","name":"Drill Peck","desc":"No additional effect.","shortDesc":"No additional effect.","type":"Flying","num":65,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":80,"weightedUsage":0.0000509939984180085},{"id":"belch","name":"Belch","desc":"This move cannot be selected until the user eats a Berry, either by eating one that was held, stealing and eating one off another Pokemon with Bug Bite or Pluck, or eating one that was thrown at it with Fling. Once the condition is met, this move can be selected and used for the rest of the battle even if the user gains or uses another item or switches out. Consuming a Berry with Natural Gift does not count for the purposes of eating one.","shortDesc":"Cannot be selected until the user eats a Berry.","type":"Poison","num":562,"category":"Special","priority":0,"accuracy":90,"pp":10,"basePower":120,"weightedUsage":0.00003038688051307952},{"id":"whirlpool","name":"Whirlpool","desc":"Prevents the target from switching for four or five turns (seven turns if the user is holding Grip Claw). Causes damage to the target equal to 1/8 of its maximum HP (1/6 if the user is holding Binding Band), rounded down, at the end of each turn during effect. The target can still switch out if it is holding Shed Shell or uses Baton Pass, Flip Turn, Parting Shot, Shed Tail, Teleport, U-turn, or Volt Switch. The effect ends if either the user or the target leaves the field, or if the target uses Mortal Spin, Rapid Spin, or Substitute successfully. This effect is not stackable or reset by using this or another binding move.","shortDesc":"Traps and damages the target for 4-5 turns.","type":"Water","num":250,"category":"Special","priority":0,"accuracy":85,"pp":15,"basePower":35,"weightedUsage":0.00002510292024247596},{"id":"endeavor","name":"Endeavor","desc":"Deals damage to the target equal to (target's current HP - user's current HP). The target is unaffected if its current HP is less than or equal to the user's current HP.","shortDesc":"Lowers the target's HP to the user's HP.","type":"Normal","num":283,"category":"Physical","priority":0,"accuracy":100,"pp":5,"basePower":0,"weightedUsage":0.000018364942797919527},{"id":"bravebird","name":"Brave Bird","desc":"If the target lost HP, the user takes recoil damage equal to 33% the HP lost by the target, rounded half up, but not less than 1 HP.","shortDesc":"Has 33% recoil.","type":"Flying","num":413,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":120,"weightedUsage":0.0000027286395798953135},{"id":"spitup","name":"Spit Up","desc":"Power is equal to 100 times the user's Stockpile count. Fails if the user's Stockpile count is 0. Whether or not this move is successful, the user's Defense and Special Defense decrease by as many stages as Stockpile had increased them, and the user's Stockpile count resets to 0.","shortDesc":"More power with more uses of Stockpile.","type":"Normal","num":255,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":0,"weightedUsage":0.0000025187172605703586},{"id":"liquidation","name":"Liquidation","desc":"Has a 20% chance to lower the target's Defense by 1 stage.","shortDesc":"20% chance to lower the target's Defense by 1.","type":"Water","num":710,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":85,"weightedUsage":0.0000012963801564646952},{"id":"defog","name":"Defog","desc":"Lowers the target's evasiveness by 1 stage. If this move is successful and whether or not the target's evasiveness was affected, the effects of Reflect, Light Screen, Aurora Veil, Safeguard, Mist, Spikes, Toxic Spikes, Stealth Rock, and Sticky Web end for the target's side, and the effects of Spikes, Toxic Spikes, Stealth Rock, and Sticky Web end for the user's side. Ignores a target's substitute, although a substitute will still block the lowering of evasiveness. If there is a terrain active and this move is successful, the terrain will be cleared.","shortDesc":"-1 evasion; clears terrain and hazards on both sides.","type":"Flying","num":432,"category":"Status","priority":0,"accuracy":true,"pp":15,"basePower":0,"weightedUsage":3.4631583049400865e-8},{"id":"throatchop","name":"Throat Chop","desc":"For 2 turns, the target cannot use sound-based moves.","shortDesc":"For 2 turns, the target cannot use sound moves.","type":"Dark","num":675,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":80,"weightedUsage":9.731298192418368e-12},{"id":"blizzard","name":"Blizzard","desc":"Has a 10% chance to freeze the target. If the weather is Snow, this move does not check accuracy.","shortDesc":"10% chance to freeze foe(s). Can't miss in Snow.","type":"Ice","num":59,"category":"Special","priority":0,"accuracy":70,"pp":5,"basePower":110,"weightedUsage":9.696956030994155e-12},{"id":"sleeptalk","name":"Sleep Talk","desc":"One of the user's known moves, besides this move, is selected for use at random. Fails if the user is not asleep. The selected move does not have PP deducted from it, and can currently have 0 PP. This move cannot select Assist, Beak Blast, Belch, Bide, Blazing Torque, Celebrate, Chatter, Combat Torque, Copycat, Dynamax Cannon, Focus Punch, Hold Hands, Magical Torque, Me First, Metronome, Mimic, Mirror Move, Nature Power, Noxious Torque, Shell Trap, Sketch, Sleep Talk, Struggle, Uproar, Wicked Torque, or any two-turn move.","shortDesc":"User must be asleep. Uses another known move.","type":"Normal","num":214,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":5.22461393691363e-16},{"id":"substitute","name":"Substitute","desc":"The user takes 1/4 of its maximum HP, rounded down, and puts it into a substitute to take its place in battle. The substitute is removed once enough damage is inflicted on it, or if the user switches out or faints. Baton Pass can be used to transfer the substitute to an ally, and the substitute will keep its remaining HP. Until the substitute is broken, it receives damage from all attacks made by other Pokemon and shields the user from status effects and stat stage changes caused by other Pokemon. Sound-based moves and Pokemon with the Infiltrator Ability ignore substitutes. The user still takes normal damage from weather and status effects while behind its substitute. If the substitute breaks during a multi-hit attack, the user will take damage from any remaining hits. If a substitute is created while the user is trapped by a binding move, the binding effect ends immediately. Fails if the user does not have enough HP remaining to create a substitute without fainting, or if it already has a substitute.","shortDesc":"User takes 1/4 its max HP to put in a substitute.","type":"Normal","num":164,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":3.8217083427423776e-16},{"id":"rest","name":"Rest","desc":"The user falls asleep for the next two turns and restores all of its HP, curing itself of any non-volatile status condition in the process. Fails if the user has full HP, is already asleep, or if another effect is preventing sleep.","shortDesc":"User sleeps 2 turns and restores HP and status.","type":"Psychic","num":156,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0,"weightedUsage":2.1285464187425901e-16},{"id":"pounce","name":"Pounce","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance to lower the target's Speed by 1.","type":"Bug","num":884,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":50,"weightedUsage":0},{"id":"aircutter","name":"Air Cutter","desc":"Has a higher chance for a critical hit.","shortDesc":"High critical hit ratio. Hits adjacent foes.","type":"Flying","num":314,"category":"Special","priority":0,"accuracy":95,"pp":25,"basePower":60,"weightedUsage":0},{"id":"agility","name":"Agility","desc":"Raises the user's Speed by 2 stages.","shortDesc":"Raises the user's Speed by 2.","type":"Psychic","num":97,"category":"Status","priority":0,"accuracy":true,"pp":30,"basePower":0,"weightedUsage":0},{"id":"aquacutter","name":"Aqua Cutter","desc":"Has a higher chance for a critical hit.","shortDesc":"High critical hit ratio.","type":"Water","num":895,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":70,"weightedUsage":0},{"id":"pluck","name":"Pluck","desc":"If this move is successful and the user has not fainted, it steals the target's held Berry if it is holding one and eats it immediately, gaining its effects even if the user's item is being ignored. Items lost to this move cannot be regained with Recycle or the Harvest Ability.","shortDesc":"User steals and eats the target's Berry.","type":"Flying","num":365,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":60,"weightedUsage":0}]}