{"name":"Dedenne","id":"dedenne","num":702,"types":["Electric","Fairy"],"imgID":702,"baseStats":[67,58,57,81,67,101],"weight":2.2,"bst":431,"usage":0,"moves":[{"id":"agility","name":"Agility","desc":"Raises the user's Speed by 2 stages.","shortDesc":"Raises the user's Speed by 2.","type":"Psychic","num":97,"category":"Status","priority":0,"accuracy":true,"pp":30,"basePower":0},{"id":"charge","name":"Charge","desc":"Raises the user's Special Defense by 1 stage. The user's next Electric-type attack will have its power doubled; the effect ends when the user is no longer active, or after the user attempts to use any Electric-type move besides Charge, even if it is not successful.","shortDesc":"+1 SpD, user's next Electric move 2x power.","type":"Electric","num":268,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0},{"id":"chargebeam","name":"Charge Beam","desc":"Has a 70% chance to raise the user's Special Attack by 1 stage.","shortDesc":"70% chance to raise the user's Sp. Atk by 1.","type":"Electric","num":451,"category":"Special","priority":0,"accuracy":90,"pp":10,"basePower":50},{"id":"charm","name":"Charm","desc":"Lowers the target's Attack by 2 stages.","shortDesc":"Lowers the target's Attack by 2.","type":"Fairy","num":204,"category":"Status","priority":0,"accuracy":100,"pp":20,"basePower":0},{"id":"covet","name":"Covet","desc":"If this attack was successful and the user has not fainted, it steals the target's held item if the user is not holding one. The target's item is not stolen if it is a Mail or Z-Crystal, or if the target is a Kyogre holding a Blue Orb, a Groudon holding a Red Orb, a Giratina holding a Griseous Orb, an Arceus holding a Plate, a Genesect holding a Drive, a Silvally holding a Memory, or a Pokemon that can Mega Evolve holding the Mega Stone for its species. Items lost to this move cannot be regained with Recycle or the Harvest Ability.","shortDesc":"If the user has no item, it steals the target's.","type":"Normal","num":343,"category":"Physical","priority":0,"accuracy":100,"pp":25,"basePower":60},{"id":"dazzlinggleam","name":"Dazzling Gleam","desc":"No additional effect.","shortDesc":"No additional effect. Hits adjacent foes.","type":"Fairy","num":605,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80},{"id":"dig","name":"Dig","desc":"This attack charges on the first turn and executes on the second. On the first turn, the user avoids all attacks other than Earthquake and Magnitude but takes double damage from them, and is also unaffected by weather. If the user is holding a Power Herb, the move completes in one turn.","shortDesc":"Digs underground turn 1, strikes turn 2.","type":"Ground","num":91,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":80},{"id":"discharge","name":"Discharge","desc":"Has a 30% chance to paralyze the target.","shortDesc":"30% chance to paralyze adjacent Pokemon.","type":"Electric","num":435,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":80},{"id":"drainingkiss","name":"Draining Kiss","desc":"The user recovers 3/4 the HP lost by the target, rounded half up. If Big Root is held by the user, the HP recovered is 1.3x normal, rounded half down.","shortDesc":"User recovers 75% of the damage dealt.","type":"Fairy","num":577,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":50},{"id":"eerieimpulse","name":"Eerie Impulse","desc":"Lowers the target's Special Attack by 2 stages.","shortDesc":"Lowers the target's Sp. Atk by 2.","type":"Electric","num":598,"category":"Status","priority":0,"accuracy":100,"pp":15,"basePower":0},{"id":"electricterrain","name":"Electric Terrain","desc":"For 5 turns, the terrain becomes Electric Terrain. During the effect, the power of Electric-type attacks made by grounded Pokemon is multiplied by 1.3 and grounded Pokemon cannot fall asleep; Pokemon already asleep do not wake up. Grounded Pokemon cannot become affected by Yawn or fall asleep from its effect. Camouflage transforms the user into an Electric type, Nature Power becomes Thunderbolt, and Secret Power has a 30% chance to cause paralysis. Fails if the current terrain is Electric Terrain.","shortDesc":"5 turns. Grounded: +Electric power, can't sleep.","type":"Electric","num":604,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"electroball","name":"Electro Ball","desc":"The power of this move depends on (user's current Speed / target's current Speed), rounded down. Power is equal to 150 if the result is 4 or more, 120 if 3, 80 if 2, 60 if 1, 40 if less than 1. If the target's current Speed is 0, this move's power is 40.","shortDesc":"More power the faster the user is than the target.","type":"Electric","num":486,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":0},{"id":"electroweb","name":"Electroweb","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance to lower the foe(s) Speed by 1.","type":"Electric","num":527,"category":"Special","priority":0,"accuracy":95,"pp":15,"basePower":55},{"id":"endeavor","name":"Endeavor","desc":"Deals damage to the target equal to (target's current HP - user's current HP). The target is unaffected if its current HP is less than or equal to the user's current HP.","shortDesc":"Lowers the target's HP to the user's HP.","type":"Normal","num":283,"category":"Physical","priority":0,"accuracy":100,"pp":5,"basePower":0},{"id":"endure","name":"Endure","desc":"The user will survive attacks made by other Pokemon during this turn with at least 1 HP. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"User survives attacks this turn with at least 1 HP.","type":"Normal","num":203,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0},{"id":"entrainment","name":"Entrainment","desc":"Causes the target's Ability to become the same as the user's. Fails if the target's Ability is As One, Battle Bond, Comatose, Disguise, Gulp Missile, Ice Face, Multitype, Power Construct, RKS System, Schooling, Shields Down, Stance Change, Tera Shift, Truant, Zen Mode, or Zero to Hero, or the same Ability as the user, or if the user's Ability is As One, Battle Bond, Comatose, Commander, Disguise, Embody Aspect, Flower Gift, Forecast, Hunger Switch, Ice Face, Illusion, Imposter, Multitype, Neutralizing Gas, Poison Puppeteer, Power Construct, Power of Alchemy, Protosynthesis, Quark Drive, Receiver, RKS System, Schooling, Shields Down, Stance Change, Tera Shell, Tera Shift, Teraform Zero, Trace, Wonder Guard, Zen Mode, or Zero to Hero.","shortDesc":"The target's Ability changes to match the user's.","type":"Normal","num":494,"category":"Status","priority":0,"accuracy":100,"pp":15,"basePower":0},{"id":"facade","name":"Facade","desc":"Power doubles if the user is burned, paralyzed, or poisoned. The physical damage halving effect from the user's burn is ignored.","shortDesc":"Power doubles if user is burn/poison/paralyzed.","type":"Normal","num":263,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":70},{"id":"fling","name":"Fling","desc":"The power of this move is based on the user's held item. The held item is lost and it activates for the target if applicable. If there is no target or the target avoids this move by protecting itself, the user's held item is still lost. The user can regain a thrown item with Recycle or the Harvest Ability. Fails if the user has no held item, if the held item cannot be thrown, if the user is under the effect of Embargo or Magic Room, or if the user has the Klutz Ability.","shortDesc":"Flings the user's item at the target. Power varies.","type":"Dark","num":374,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":0},{"id":"gigaimpact","name":"Giga Impact","desc":"If this move is successful, the user must recharge on the following turn and cannot select a move.","shortDesc":"User cannot move next turn.","type":"Normal","num":416,"category":"Physical","priority":0,"accuracy":90,"pp":5,"basePower":150},{"id":"grassknot","name":"Grass Knot","desc":"This move's power is 20 if the target weighs less than 10 kg, 40 if less than 25 kg, 60 if less than 50 kg, 80 if less than 100 kg, 100 if less than 200 kg, and 120 if greater than or equal to 200 kg.","shortDesc":"More power the heavier the target.","type":"Grass","num":447,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":0},{"id":"helpinghand","name":"Helping Hand","desc":"The power of the target's attack this turn is multiplied by 1.5 (this effect is stackable). Fails if there is no ally adjacent to the user or if the ally already moved this turn, but does not fail if the ally is using a two-turn move.","shortDesc":"One adjacent ally's move power is 1.5x this turn.","type":"Normal","num":270,"category":"Status","priority":5,"accuracy":true,"pp":20,"basePower":0},{"id":"hyperbeam","name":"Hyper Beam","desc":"If this move is successful, the user must recharge on the following turn and cannot select a move.","shortDesc":"User cannot move next turn.","type":"Normal","num":63,"category":"Special","priority":0,"accuracy":90,"pp":5,"basePower":150},{"id":"lightscreen","name":"Light Screen","desc":"For 5 turns, the user and its party members take 0.5x damage from special attacks, or 0.66x damage if in a Double Battle. Damage is not reduced further with Aurora Veil. Critical hits ignore this effect. It is removed from the user's side if the user or an ally is successfully hit by Brick Break, Psychic Fangs, or Defog. Lasts for 8 turns if the user is holding Light Clay. Fails if the effect is already active on the user's side.","shortDesc":"For 5 turns, special damage to allies is halved.","type":"Psychic","num":113,"category":"Status","priority":0,"accuracy":true,"pp":30,"basePower":0},{"id":"magnetrise","name":"Magnet Rise","desc":"For 5 turns, the user is immune to Ground-type attacks and the effects of Spikes, Toxic Spikes, Sticky Web, and the Arena Trap Ability as long as it remains active. If the user uses Baton Pass, the replacement will gain the effect. Ingrain, Smack Down, Thousand Arrows, and Iron Ball override this move if the user is under any of their effects. Fails if the user is already under this effect or the effects of Ingrain, Smack Down, or Thousand Arrows.","shortDesc":"For 5 turns, the user has immunity to Ground.","type":"Electric","num":393,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"mistyterrain","name":"Misty Terrain","desc":"For 5 turns, the terrain becomes Misty Terrain. During the effect, the power of Dragon-type attacks used against grounded Pokemon is multiplied by 0.5 and grounded Pokemon cannot be inflicted with a non-volatile status condition nor confusion. Grounded Pokemon can become affected by Yawn but cannot fall asleep from its effect. Camouflage transforms the user into a Fairy type, Nature Power becomes Moonblast, and Secret Power has a 30% chance to lower Special Attack by 1 stage. Fails if the current terrain is Misty Terrain.","shortDesc":"5 turns. Can't status,-Dragon power vs grounded.","type":"Fairy","num":581,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"nuzzle","name":"Nuzzle","desc":"Has a 100% chance to paralyze the target.","shortDesc":"100% chance to paralyze the target.","type":"Electric","num":609,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":20},{"id":"paraboliccharge","name":"Parabolic Charge","desc":"The user recovers 1/2 the HP lost by the target, rounded half up. If Big Root is held by the user, the HP recovered is 1.3x normal, rounded half down.","shortDesc":"User recovers 50% of the damage dealt.","type":"Electric","num":570,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":65},{"id":"playrough","name":"Play Rough","desc":"Has a 10% chance to lower the target's Attack by 1 stage.","shortDesc":"10% chance to lower the target's Attack by 1.","type":"Fairy","num":583,"category":"Physical","priority":0,"accuracy":90,"pp":10,"basePower":90},{"id":"protect","name":"Protect","desc":"The user is protected from most attacks made by other Pokemon during this turn. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"Prevents moves from affecting the user this turn.","type":"Normal","num":182,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0},{"id":"raindance","name":"Rain Dance","desc":"For 5 turns, the weather becomes Rain Dance. The damage of Water-type attacks is multiplied by 1.5 and the damage of Fire-type attacks is multiplied by 0.5 during the effect. Lasts for 8 turns if the user is holding Damp Rock. Fails if the current weather is Rain Dance.","shortDesc":"For 5 turns, heavy rain powers Water moves.","type":"Water","num":240,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0},{"id":"rest","name":"Rest","desc":"The user falls asleep for the next two turns and restores all of its HP, curing itself of any non-volatile status condition in the process. Fails if the user has full HP, is already asleep, or if another effect is preventing sleep.","shortDesc":"User sleeps 2 turns and restores HP and status.","type":"Psychic","num":156,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0},{"id":"seedbomb","name":"Seed Bomb","desc":"No additional effect.","shortDesc":"No additional effect.","type":"Grass","num":402,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":80},{"id":"sleeptalk","name":"Sleep Talk","desc":"One of the user's known moves, besides this move, is selected for use at random. Fails if the user is not asleep. The selected move does not have PP deducted from it, and can currently have 0 PP. This move cannot select Assist, Beak Blast, Belch, Bide, Blazing Torque, Celebrate, Chatter, Combat Torque, Copycat, Dynamax Cannon, Focus Punch, Hold Hands, Magical Torque, Me First, Metronome, Mimic, Mirror Move, Nature Power, Noxious Torque, Shell Trap, Sketch, Sleep Talk, Struggle, Uproar, Wicked Torque, or any two-turn move.","shortDesc":"User must be asleep. Uses another known move.","type":"Normal","num":214,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"snore","name":"Snore","desc":"Has a 30% chance to make the target flinch. Fails if the user is not asleep.","shortDesc":"User must be asleep. 30% chance to flinch target.","type":"Normal","num":173,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":50},{"id":"substitute","name":"Substitute","desc":"The user takes 1/4 of its maximum HP, rounded down, and puts it into a substitute to take its place in battle. The substitute is removed once enough damage is inflicted on it, or if the user switches out or faints. Baton Pass can be used to transfer the substitute to an ally, and the substitute will keep its remaining HP. Until the substitute is broken, it receives damage from all attacks made by other Pokemon and shields the user from status effects and stat stage changes caused by other Pokemon. Sound-based moves and Pokemon with the Infiltrator Ability ignore substitutes. The user still takes normal damage from weather and status effects while behind its substitute. If the substitute breaks during a multi-hit attack, the user will take damage from any remaining hits. If a substitute is created while the user is trapped by a binding move, the binding effect ends immediately. Fails if the user does not have enough HP remaining to create a substitute without fainting, or if it already has a substitute.","shortDesc":"User takes 1/4 its max HP to put in a substitute.","type":"Normal","num":164,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"sunnyday","name":"Sunny Day","desc":"For 5 turns, the weather becomes Sunny Day. The damage of Fire-type attacks is multiplied by 1.5 and the damage of Water-type attacks is multiplied by 0.5 during the effect. Lasts for 8 turns if the user is holding Heat Rock. Fails if the current weather is Sunny Day.","shortDesc":"For 5 turns, intense sunlight powers Fire moves.","type":"Fire","num":241,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0},{"id":"superfang","name":"Super Fang","desc":"Deals damage to the target equal to half of its current HP, rounded down, but not less than 1 HP.","shortDesc":"Does damage equal to 1/2 target's current HP.","type":"Normal","num":162,"category":"Physical","priority":0,"accuracy":90,"pp":10,"basePower":0},{"id":"swift","name":"Swift","desc":"This move does not check accuracy.","shortDesc":"This move does not check accuracy. Hits foes.","type":"Normal","num":129,"category":"Special","priority":0,"accuracy":true,"pp":20,"basePower":60},{"id":"tackle","name":"Tackle","desc":"No additional effect.","shortDesc":"No additional effect.","type":"Normal","num":33,"category":"Physical","priority":0,"accuracy":100,"pp":35,"basePower":40},{"id":"tailwhip","name":"Tail Whip","desc":"Lowers the target's Defense by 1 stage.","shortDesc":"Lowers the foe(s) Defense by 1.","type":"Normal","num":39,"category":"Status","priority":0,"accuracy":100,"pp":30,"basePower":0},{"id":"takedown","name":"Take Down","desc":"If the target lost HP, the user takes recoil damage equal to 1/4 the HP lost by the target, rounded half up, but not less than 1 HP.","shortDesc":"Has 1/4 recoil.","type":"Normal","num":36,"category":"Physical","priority":0,"accuracy":85,"pp":20,"basePower":90},{"id":"tearfullook","name":"Tearful Look","desc":"Lowers the target's Attack and Special Attack by 1 stage.","shortDesc":"Lowers the target's Attack and Sp. Atk by 1.","type":"Normal","num":715,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0},{"id":"terablast","name":"Tera Blast","desc":"If the user is Terastallized, this move becomes a physical attack if the user's Attack is greater than its Special Attack, including stat stage changes, and this move's type becomes the same as the user's Tera Type. In addition, if the user's Tera Type is Stellar, this move has 100 power, is super effective against Terastallized targets and neutral against other targets, and lowers the user's Attack and Special Attack by 1 stage.","shortDesc":"If Terastallized: Phys. if Atk > SpA, type = Tera.","type":"Normal","num":851,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80},{"id":"thief","name":"Thief","desc":"If this attack was successful and the user has not fainted, it steals the target's held item if the user is not holding one. The target's item is not stolen if it is a Mail or Z-Crystal, or if the target is a Kyogre holding a Blue Orb, a Groudon holding a Red Orb, a Giratina holding a Griseous Orb, an Arceus holding a Plate, a Genesect holding a Drive, a Silvally holding a Memory, or a Pokemon that can Mega Evolve holding the Mega Stone for its species. Items lost to this move cannot be regained with Recycle or the Harvest Ability.","shortDesc":"If the user has no item, it steals the target's.","type":"Dark","num":168,"category":"Physical","priority":0,"accuracy":100,"pp":25,"basePower":60},{"id":"thunder","name":"Thunder","desc":"Has a 30% chance to paralyze the target. This move can hit a target using Bounce, Fly, or Sky Drop, or is under the effect of Sky Drop. If the weather is Primordial Sea or Rain Dance, this move does not check accuracy. If the weather is Desolate Land or Sunny Day, this move's accuracy is 50%. If this move is used against a Pokemon holding Utility Umbrella, this move's accuracy remains at 70%.","shortDesc":"30% chance to paralyze. Can't miss in rain.","type":"Electric","num":87,"category":"Special","priority":0,"accuracy":70,"pp":10,"basePower":110},{"id":"thunderbolt","name":"Thunderbolt","desc":"Has a 10% chance to paralyze the target.","shortDesc":"10% chance to paralyze the target.","type":"Electric","num":85,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":90},{"id":"thunderpunch","name":"Thunder Punch","desc":"Has a 10% chance to paralyze the target.","shortDesc":"10% chance to paralyze the target.","type":"Electric","num":9,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":75},{"id":"thundershock","name":"Thunder Shock","desc":"Has a 10% chance to paralyze the target.","shortDesc":"10% chance to paralyze the target.","type":"Electric","num":84,"category":"Special","priority":0,"accuracy":100,"pp":30,"basePower":40},{"id":"thunderwave","name":"Thunder Wave","desc":"Paralyzes the target. This move does not ignore type immunity.","shortDesc":"Paralyzes the target.","type":"Electric","num":86,"category":"Status","priority":0,"accuracy":90,"pp":20,"basePower":0},{"id":"trailblaze","name":"Trailblaze","desc":"Has a 100% chance to raise the user's Speed by 1 stage.","shortDesc":"100% chance to raise the user's Speed by 1.","type":"Grass","num":885,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":50},{"id":"uturn","name":"U-turn","desc":"If this move is successful and the user has not fainted, the user switches out even if it is trapped and is replaced immediately by a selected party member. The user does not switch out if there are no unfainted party members, or if the target switched out using an Eject Button or through the effect of the Emergency Exit or Wimp Out Abilities.","shortDesc":"User switches out after damaging the target.","type":"Bug","num":369,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":70},{"id":"voltswitch","name":"Volt Switch","desc":"If this move is successful and the user has not fainted, the user switches out even if it is trapped and is replaced immediately by a selected party member. The user does not switch out if there are no unfainted party members, or if the target switched out using an Eject Button or through the effect of the Emergency Exit or Wimp Out Abilities.","shortDesc":"User switches out after damaging the target.","type":"Electric","num":521,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":70},{"id":"wildcharge","name":"Wild Charge","desc":"If the target lost HP, the user takes recoil damage equal to 1/4 the HP lost by the target, rounded half up, but not less than 1 HP.","shortDesc":"Has 1/4 recoil.","type":"Electric","num":528,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":90}],"abilities":[{"name":"Cheek Pouch","id":"cheekpouch","desc":"If this Pokemon eats a held Berry, it restores 1/3 of its maximum HP, rounded down, in addition to the Berry's effect. This effect can also activate after the effects of Bug Bite, Fling, Pluck, Stuff Cheeks, and Teatime if the eaten Berry had an effect on this Pokemon.","shortDesc":"If this Pokemon eats a Berry, it restores 1/3 of its max HP after the Berry's effect.","num":167},{"name":"Pickup","id":"pickup","desc":"If this Pokemon has no item, it finds one used by an adjacent Pokemon this turn.","shortDesc":"If this Pokemon has no item, it finds one used by an adjacent Pokemon this turn.","num":53},{"name":"Plus","id":"plus","desc":"If an active ally has this Ability or the Minus Ability, this Pokemon's Special Attack is multiplied by 1.5.","shortDesc":"If an active ally has this Ability or the Minus Ability, this Pokemon's Sp. Atk is 1.5x.","num":57}],"teammates":[],"items":[],"spreads":[]}