{"name":"Drakloak","id":"drakloak","num":886,"types":["Dragon","Ghost"],"imgID":886,"baseStats":[68,80,50,60,50,102],"weight":11,"bst":410,"evos":["Dragapult"],"prevo":"Dreepy","usage":0,"moves":[{"id":"acrobatics","name":"Acrobatics","desc":"Power doubles if the user has no held item.","shortDesc":"Power doubles if the user has no held item.","type":"Flying","num":512,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":55},{"id":"agility","name":"Agility","desc":"Raises the user's Speed by 2 stages.","shortDesc":"Raises the user's Speed by 2.","type":"Psychic","num":97,"category":"Status","priority":0,"accuracy":true,"pp":30,"basePower":0},{"id":"assurance","name":"Assurance","desc":"Power doubles if the target has already taken damage this turn, other than direct damage from Belly Drum, confusion, Curse, or Pain Split.","shortDesc":"Power doubles if target was damaged this turn.","type":"Dark","num":372,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":60},{"id":"astonish","name":"Astonish","desc":"Has a 30% chance to make the target flinch.","shortDesc":"30% chance to make the target flinch.","type":"Ghost","num":310,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":30},{"id":"batonpass","name":"Baton Pass","desc":"The user is replaced with another Pokemon in its party. The selected Pokemon has the user's stat stage changes, confusion, and certain move effects transferred to it.","shortDesc":"User switches, passing stat changes and more.","type":"Normal","num":226,"category":"Status","priority":0,"accuracy":true,"pp":40,"basePower":0},{"id":"bite","name":"Bite","desc":"Has a 30% chance to make the target flinch.","shortDesc":"30% chance to make the target flinch.","type":"Dark","num":44,"category":"Physical","priority":0,"accuracy":100,"pp":25,"basePower":60},{"id":"breakingswipe","name":"Breaking Swipe","desc":"Has a 100% chance to lower the target's Attack by 1 stage.","shortDesc":"100% chance to lower the foe(s) Attack by 1.","type":"Dragon","num":784,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":60},{"id":"confuseray","name":"Confuse Ray","desc":"Causes the target to become confused.","shortDesc":"Confuses the target.","type":"Ghost","num":109,"category":"Status","priority":0,"accuracy":100,"pp":10,"basePower":0},{"id":"curse","name":"Curse","desc":"If the user is not a Ghost type, lowers the user's Speed by 1 stage and raises the user's Attack and Defense by 1 stage. If the user is a Ghost type, the user loses 1/2 of its maximum HP, rounded down and even if it would cause fainting, in exchange for the target losing 1/4 of its maximum HP, rounded down, at the end of each turn while it is active. If the target uses Baton Pass, the replacement will continue to be affected. Fails if there is no target or if the target is already affected.","shortDesc":"Curses if Ghost, else -1 Spe, +1 Atk, +1 Def.","type":"Ghost","num":174,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"doubleedge","name":"Double-Edge","desc":"If the target lost HP, the user takes recoil damage equal to 33% the HP lost by the target, rounded half up, but not less than 1 HP.","shortDesc":"Has 33% recoil.","type":"Normal","num":38,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":120},{"id":"doublehit","name":"Double Hit","desc":"Hits twice. If the first hit breaks the target's substitute, it will take damage for the second hit.","shortDesc":"Hits 2 times in one turn.","type":"Normal","num":458,"category":"Physical","priority":0,"accuracy":90,"pp":10,"basePower":35},{"id":"dracometeor","name":"Draco Meteor","desc":"Lowers the user's Special Attack by 2 stages.","shortDesc":"Lowers the user's Sp. Atk by 2.","type":"Dragon","num":434,"category":"Special","priority":0,"accuracy":90,"pp":5,"basePower":130},{"id":"dragoncheer","name":"Dragon Cheer","desc":"Raises the target's chance for a critical hit by 1 stage, or by 2 stages if the target is Dragon type. Fails if there is no ally adjacent to the user, or if the target already has this effect or the Focus Energy effect. Baton Pass can be used to transfer this effect to an ally.","shortDesc":"Ally: Crit ratio +1, or +2 if ally is Dragon type.","type":"Dragon","num":913,"category":"Status","priority":0,"accuracy":true,"pp":15,"basePower":0},{"id":"dragondance","name":"Dragon Dance","desc":"Raises the user's Attack and Speed by 1 stage.","shortDesc":"Raises the user's Attack and Speed by 1.","type":"Dragon","num":349,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0},{"id":"dragonpulse","name":"Dragon Pulse","desc":"No additional effect.","shortDesc":"No additional effect.","type":"Dragon","num":406,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":85},{"id":"dragonrush","name":"Dragon Rush","desc":"Has a 20% chance to make the target flinch. Damage doubles and no accuracy check is done if the target has used Minimize while active.","shortDesc":"20% chance to make the target flinch.","type":"Dragon","num":407,"category":"Physical","priority":0,"accuracy":75,"pp":10,"basePower":100},{"id":"dragontail","name":"Dragon Tail","desc":"If both the user and the target have not fainted, the target is forced to switch out and be replaced with a random unfainted ally. This effect fails if the target used Ingrain previously, has the Suction Cups Ability, or this move hit a substitute.","shortDesc":"Forces the target to switch to a random ally.","type":"Dragon","num":525,"category":"Physical","priority":-6,"accuracy":90,"pp":10,"basePower":60},{"id":"endure","name":"Endure","desc":"The user will survive attacks made by other Pokemon during this turn with at least 1 HP. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"User survives attacks this turn with at least 1 HP.","type":"Normal","num":203,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0},{"id":"facade","name":"Facade","desc":"Power doubles if the user is burned, paralyzed, or poisoned. The physical damage halving effect from the user's burn is ignored.","shortDesc":"Power doubles if user is burn/poison/paralyzed.","type":"Normal","num":263,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":70},{"id":"fireblast","name":"Fire Blast","desc":"Has a 10% chance to burn the target.","shortDesc":"10% chance to burn the target.","type":"Fire","num":126,"category":"Special","priority":0,"accuracy":85,"pp":5,"basePower":110},{"id":"flamethrower","name":"Flamethrower","desc":"Has a 10% chance to burn the target.","shortDesc":"10% chance to burn the target.","type":"Fire","num":53,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":90},{"id":"helpinghand","name":"Helping Hand","desc":"The power of the target's attack this turn is multiplied by 1.5 (this effect is stackable). Fails if there is no ally adjacent to the user or if the ally already moved this turn, but does not fail if the ally is using a two-turn move.","shortDesc":"One adjacent ally's move power is 1.5x this turn.","type":"Normal","num":270,"category":"Status","priority":5,"accuracy":true,"pp":20,"basePower":0},{"id":"hex","name":"Hex","desc":"Power doubles if the target has a non-volatile status condition.","shortDesc":"Power doubles if the target has a status ailment.","type":"Ghost","num":506,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":65},{"id":"hydropump","name":"Hydro Pump","desc":"No additional effect.","shortDesc":"No additional effect.","type":"Water","num":56,"category":"Special","priority":0,"accuracy":80,"pp":5,"basePower":110},{"id":"infestation","name":"Infestation","desc":"Prevents the target from switching for four or five turns (seven turns if the user is holding Grip Claw). Causes damage to the target equal to 1/8 of its maximum HP (1/6 if the user is holding Binding Band), rounded down, at the end of each turn during effect. The target can still switch out if it is holding Shed Shell or uses Baton Pass, Flip Turn, Parting Shot, Shed Tail, Teleport, U-turn, or Volt Switch. The effect ends if either the user or the target leaves the field, or if the target uses Mortal Spin, Rapid Spin, or Substitute successfully. This effect is not stackable or reset by using this or another binding move.","shortDesc":"Traps and damages the target for 4-5 turns.","type":"Bug","num":611,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":20},{"id":"lastresort","name":"Last Resort","desc":"This move fails unless the user knows this move and at least one other move, and has used all the other moves it knows at least once each since it became active or Transformed.","shortDesc":"Fails unless each known move has been used.","type":"Normal","num":387,"category":"Physical","priority":0,"accuracy":100,"pp":5,"basePower":140},{"id":"lightscreen","name":"Light Screen","desc":"For 5 turns, the user and its party members take 0.5x damage from special attacks, or 0.66x damage if in a Double Battle. Damage is not reduced further with Aurora Veil. Critical hits ignore this effect. It is removed from the user's side if the user or an ally is successfully hit by Brick Break, Psychic Fangs, or Defog. Lasts for 8 turns if the user is holding Light Clay. Fails if the effect is already active on the user's side.","shortDesc":"For 5 turns, special damage to allies is halved.","type":"Psychic","num":113,"category":"Status","priority":0,"accuracy":true,"pp":30,"basePower":0},{"id":"lockon","name":"Lock-On","desc":"Until the end of the next turn, the target cannot avoid the user's moves, even if the target is in the middle of a two-turn move. The effect ends if either the user or the target leaves the field. Fails if this effect is active for the user.","shortDesc":"User's next move will not miss the target.","type":"Normal","num":199,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0},{"id":"nightshade","name":"Night Shade","desc":"Deals damage to the target equal to the user's level.","shortDesc":"Does damage equal to the user's level.","type":"Ghost","num":101,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":0},{"id":"outrage","name":"Outrage","desc":"The user spends two or three turns locked into this move and becomes confused immediately after its move on the last turn of the effect if it is not already. This move targets an opposing Pokemon at random on each turn. If the user is prevented from moving, is asleep at the beginning of a turn, or the attack is not successful against the target on the first turn of the effect or the second turn of a three-turn effect, the effect ends without causing confusion. If this move is called by Sleep Talk and the user is asleep, the move is used for one turn and does not confuse the user.","shortDesc":"Lasts 2-3 turns. Confuses the user afterwards.","type":"Dragon","num":200,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":120},{"id":"phantomforce","name":"Phantom Force","desc":"If this move is successful, it breaks through the target's Baneful Bunker, Detect, King's Shield, Protect, or Spiky Shield for this turn, allowing other Pokemon to attack the target normally. If the target's side is protected by Crafty Shield, Mat Block, Quick Guard, or Wide Guard, that protection is also broken for this turn and other Pokemon may attack the target's side normally. This attack charges on the first turn and executes on the second. On the first turn, the user avoids all attacks. If the user is holding a Power Herb, the move completes in one turn.","shortDesc":"Disappears turn 1. Hits turn 2. Breaks protection.","type":"Ghost","num":566,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":90},{"id":"pounce","name":"Pounce","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance to lower the target's Speed by 1.","type":"Bug","num":884,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":50},{"id":"protect","name":"Protect","desc":"The user is protected from most attacks made by other Pokemon during this turn. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"Prevents moves from affecting the user this turn.","type":"Normal","num":182,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0},{"id":"psychicfangs","name":"Psychic Fangs","desc":"If this attack does not miss, the effects of Reflect, Light Screen, and Aurora Veil end for the target's side of the field before damage is calculated.","shortDesc":"Destroys screens, unless the target is immune.","type":"Psychic","num":706,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":85},{"id":"quickattack","name":"Quick Attack","desc":"No additional effect.","shortDesc":"Usually goes first.","type":"Normal","num":98,"category":"Physical","priority":1,"accuracy":100,"pp":30,"basePower":40},{"id":"reflect","name":"Reflect","desc":"For 5 turns, the user and its party members take 0.5x damage from physical attacks, or 0.66x damage if in a Double Battle. Damage is not reduced further with Aurora Veil. Critical hits ignore this effect. It is removed from the user's side if the user or an ally is successfully hit by Brick Break, Psychic Fangs, or Defog. Lasts for 8 turns if the user is holding Light Clay. Fails if the effect is already active on the user's side.","shortDesc":"For 5 turns, physical damage to allies is halved.","type":"Psychic","num":115,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0},{"id":"rest","name":"Rest","desc":"The user falls asleep for the next two turns and restores all of its HP, curing itself of any non-volatile status condition in the process. Fails if the user has full HP, is already asleep, or if another effect is preventing sleep.","shortDesc":"User sleeps 2 turns and restores HP and status.","type":"Psychic","num":156,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0},{"id":"shadowball","name":"Shadow Ball","desc":"Has a 20% chance to lower the target's Special Defense by 1 stage.","shortDesc":"20% chance to lower the target's Sp. Def by 1.","type":"Ghost","num":247,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":80},{"id":"sleeptalk","name":"Sleep Talk","desc":"One of the user's known moves, besides this move, is selected for use at random. Fails if the user is not asleep. The selected move does not have PP deducted from it, and can currently have 0 PP. This move cannot select Assist, Beak Blast, Belch, Bide, Blazing Torque, Celebrate, Chatter, Combat Torque, Copycat, Dynamax Cannon, Focus Punch, Hold Hands, Magical Torque, Me First, Metronome, Mimic, Mirror Move, Nature Power, Noxious Torque, Shell Trap, Sketch, Sleep Talk, Struggle, Uproar, Wicked Torque, or any two-turn move.","shortDesc":"User must be asleep. Uses another known move.","type":"Normal","num":214,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"substitute","name":"Substitute","desc":"The user takes 1/4 of its maximum HP, rounded down, and puts it into a substitute to take its place in battle. The substitute is removed once enough damage is inflicted on it, or if the user switches out or faints. Baton Pass can be used to transfer the substitute to an ally, and the substitute will keep its remaining HP. Until the substitute is broken, it receives damage from all attacks made by other Pokemon and shields the user from status effects and stat stage changes caused by other Pokemon. Sound-based moves and Pokemon with the Infiltrator Ability ignore substitutes. The user still takes normal damage from weather and status effects while behind its substitute. If the substitute breaks during a multi-hit attack, the user will take damage from any remaining hits. If a substitute is created while the user is trapped by a binding move, the binding effect ends immediately. Fails if the user does not have enough HP remaining to create a substitute without fainting, or if it already has a substitute.","shortDesc":"User takes 1/4 its max HP to put in a substitute.","type":"Normal","num":164,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"sunnyday","name":"Sunny Day","desc":"For 5 turns, the weather becomes Sunny Day. The damage of Fire-type attacks is multiplied by 1.5 and the damage of Water-type attacks is multiplied by 0.5 during the effect. Lasts for 8 turns if the user is holding Heat Rock. Fails if the current weather is Sunny Day.","shortDesc":"For 5 turns, intense sunlight powers Fire moves.","type":"Fire","num":241,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0},{"id":"surf","name":"Surf","desc":"Damage doubles if the target is using Dive.","shortDesc":"Hits adjacent Pokemon. Double damage on Dive.","type":"Water","num":57,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":90},{"id":"swift","name":"Swift","desc":"This move does not check accuracy.","shortDesc":"This move does not check accuracy. Hits foes.","type":"Normal","num":129,"category":"Special","priority":0,"accuracy":true,"pp":20,"basePower":60},{"id":"takedown","name":"Take Down","desc":"If the target lost HP, the user takes recoil damage equal to 1/4 the HP lost by the target, rounded half up, but not less than 1 HP.","shortDesc":"Has 1/4 recoil.","type":"Normal","num":36,"category":"Physical","priority":0,"accuracy":85,"pp":20,"basePower":90},{"id":"terablast","name":"Tera Blast","desc":"If the user is Terastallized, this move becomes a physical attack if the user's Attack is greater than its Special Attack, including stat stage changes, and this move's type becomes the same as the user's Tera Type. In addition, if the user's Tera Type is Stellar, this move has 100 power, is super effective against Terastallized targets and neutral against other targets, and lowers the user's Attack and Special Attack by 1 stage.","shortDesc":"If Terastallized: Phys. if Atk > SpA, type = Tera.","type":"Normal","num":851,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80},{"id":"thief","name":"Thief","desc":"If this attack was successful and the user has not fainted, it steals the target's held item if the user is not holding one. The target's item is not stolen if it is a Mail or Z-Crystal, or if the target is a Kyogre holding a Blue Orb, a Groudon holding a Red Orb, a Giratina holding a Griseous Orb, an Arceus holding a Plate, a Genesect holding a Drive, a Silvally holding a Memory, or a Pokemon that can Mega Evolve holding the Mega Stone for its species. Items lost to this move cannot be regained with Recycle or the Harvest Ability.","shortDesc":"If the user has no item, it steals the target's.","type":"Dark","num":168,"category":"Physical","priority":0,"accuracy":100,"pp":25,"basePower":60},{"id":"thunder","name":"Thunder","desc":"Has a 30% chance to paralyze the target. This move can hit a target using Bounce, Fly, or Sky Drop, or is under the effect of Sky Drop. If the weather is Primordial Sea or Rain Dance, this move does not check accuracy. If the weather is Desolate Land or Sunny Day, this move's accuracy is 50%. If this move is used against a Pokemon holding Utility Umbrella, this move's accuracy remains at 70%.","shortDesc":"30% chance to paralyze. Can't miss in rain.","type":"Electric","num":87,"category":"Special","priority":0,"accuracy":70,"pp":10,"basePower":110},{"id":"thunderbolt","name":"Thunderbolt","desc":"Has a 10% chance to paralyze the target.","shortDesc":"10% chance to paralyze the target.","type":"Electric","num":85,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":90},{"id":"thunderwave","name":"Thunder Wave","desc":"Paralyzes the target. This move does not ignore type immunity.","shortDesc":"Paralyzes the target.","type":"Electric","num":86,"category":"Status","priority":0,"accuracy":90,"pp":20,"basePower":0},{"id":"uturn","name":"U-turn","desc":"If this move is successful and the user has not fainted, the user switches out even if it is trapped and is replaced immediately by a selected party member. The user does not switch out if there are no unfainted party members, or if the target switched out using an Eject Button or through the effect of the Emergency Exit or Wimp Out Abilities.","shortDesc":"User switches out after damaging the target.","type":"Bug","num":369,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":70},{"id":"willowisp","name":"Will-O-Wisp","desc":"Burns the target.","shortDesc":"Burns the target.","type":"Fire","num":261,"category":"Status","priority":0,"accuracy":85,"pp":15,"basePower":0}],"abilities":[{"name":"Clear Body","id":"clearbody","desc":"Prevents other Pokemon from lowering this Pokemon's stat stages.","shortDesc":"Prevents other Pokemon from lowering this Pokemon's stat stages.","num":29},{"name":"Infiltrator","id":"infiltrator","desc":"This Pokemon's moves ignore substitutes and the opposing side's Reflect, Light Screen, Safeguard, Mist, and Aurora Veil.","shortDesc":"Moves ignore substitutes and foe's Reflect/Light Screen/Safeguard/Mist/Aurora Veil.","num":151},{"name":"Cursed Body","id":"cursedbody","desc":"If this Pokemon is hit by an attack, there is a 30% chance that move gets disabled unless one of the attacker's moves is already disabled.","shortDesc":"If this Pokemon is hit by an attack, there is a 30% chance that move gets disabled.","num":130}],"teammates":[],"items":[],"spreads":[]}