{"name":"Grimmsnarl","id":"grimmsnarl","num":861,"moves":[{"id":"lightscreen","name":"Light Screen","desc":"For 5 turns, the user and its party members take 0.5x damage from special attacks, or 0.66x damage if in a Double Battle. Damage is not reduced further with Aurora Veil. Critical hits ignore this effect. It is removed from the user's side if the user or an ally is successfully hit by Brick Break, Psychic Fangs, or Defog. Lasts for 8 turns if the user is holding Light Clay. Fails if the effect is already active on the user's side.","shortDesc":"For 5 turns, special damage to allies is halved.","type":"Psychic","num":113,"category":"Status","priority":0,"accuracy":true,"pp":30,"basePower":0,"weightedUsage":0.8965590099462839},{"id":"reflect","name":"Reflect","desc":"For 5 turns, the user and its party members take 0.5x damage from physical attacks, or 0.66x damage if in a Double Battle. Damage is not reduced further with Aurora Veil. Critical hits ignore this effect. It is removed from the user's side if the user or an ally is successfully hit by Brick Break, Psychic Fangs, or Defog. Lasts for 8 turns if the user is holding Light Clay. Fails if the effect is already active on the user's side.","shortDesc":"For 5 turns, physical damage to allies is halved.","type":"Psychic","num":115,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0,"weightedUsage":0.8716262351146075},{"id":"spiritbreak","name":"Spirit Break","desc":"Has a 100% chance to lower the target's Special Attack by 1 stage.","shortDesc":"100% chance to lower the target's Sp. Atk by 1.","type":"Fairy","num":789,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":75,"weightedUsage":0.804831863156872},{"id":"partingshot","name":"Parting Shot","desc":"Lowers the target's Attack and Special Attack by 1 stage. If this move is successful, the user switches out even if it is trapped and is replaced immediately by a selected party member. The user does not switch out if the target's Attack and Special Attack stat stages were both unchanged, or if there are no unfainted party members.","shortDesc":"Lowers target's Atk, Sp. Atk by 1. User switches.","type":"Dark","num":575,"category":"Status","priority":0,"accuracy":100,"pp":20,"basePower":0,"weightedUsage":0.4055445186276833},{"id":"thunderwave","name":"Thunder Wave","desc":"Paralyzes the target. This move does not ignore type immunity.","shortDesc":"Paralyzes the target.","type":"Electric","num":86,"category":"Status","priority":0,"accuracy":90,"pp":20,"basePower":0,"weightedUsage":0.23459070621104308},{"id":"fakeout","name":"Fake Out","desc":"Has a 100% chance to make the target flinch. Fails unless it is the user's first turn on the field.","shortDesc":"Hits first. First turn out only. 100% flinch chance.","type":"Normal","num":252,"category":"Physical","priority":3,"accuracy":100,"pp":10,"basePower":40,"weightedUsage":0.19386469462509281},{"id":"mistyterrain","name":"Misty Terrain","desc":"For 5 turns, the terrain becomes Misty Terrain. During the effect, the power of Dragon-type attacks used against grounded Pokemon is multiplied by 0.5 and grounded Pokemon cannot be inflicted with a non-volatile status condition nor confusion. Grounded Pokemon can become affected by Yawn but cannot fall asleep from its effect. Camouflage transforms the user into a Fairy type, Nature Power becomes Moonblast, and Secret Power has a 30% chance to lower Special Attack by 1 stage. Fails if the current terrain is Misty Terrain.","shortDesc":"5 turns. Can't status,-Dragon power vs grounded.","type":"Fairy","num":581,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.16451442834111787},{"id":"suckerpunch","name":"Sucker Punch","desc":"Fails if the target did not select a physical attack, special attack, or Me First for use this turn, or if the target moves before the user.","shortDesc":"Usually goes first. Fails if target is not attacking.","type":"Dark","num":389,"category":"Physical","priority":1,"accuracy":100,"pp":5,"basePower":70,"weightedUsage":0.12478210760061018},{"id":"faketears","name":"Fake Tears","desc":"Lowers the target's Special Defense by 2 stages.","shortDesc":"Lowers the target's Sp. Def by 2.","type":"Dark","num":313,"category":"Status","priority":0,"accuracy":100,"pp":20,"basePower":0,"weightedUsage":0.1190168980531154},{"id":"taunt","name":"Taunt","desc":"Prevents the target from using non-damaging moves for its next three turns. Pokemon with the Oblivious Ability or protected by the Aroma Veil Ability are immune.","shortDesc":"Target can't use status moves its next 3 turns.","type":"Dark","num":269,"category":"Status","priority":0,"accuracy":100,"pp":20,"basePower":0,"weightedUsage":0.04284888968764449},{"id":"scaryface","name":"Scary Face","desc":"Lowers the target's Speed by 2 stages.","shortDesc":"Lowers the target's Speed by 2.","type":"Normal","num":184,"category":"Status","priority":0,"accuracy":100,"pp":10,"basePower":0,"weightedUsage":0.030049202697282684},{"id":"playrough","name":"Play Rough","desc":"Has a 10% chance to lower the target's Attack by 1 stage.","shortDesc":"10% chance to lower the target's Attack by 1.","type":"Fairy","num":583,"category":"Physical","priority":0,"accuracy":90,"pp":10,"basePower":90,"weightedUsage":0.023061702686526193},{"id":"throatchop","name":"Throat Chop","desc":"For 2 turns, the target cannot use sound-based moves.","shortDesc":"For 2 turns, the target cannot use sound moves.","type":"Dark","num":675,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":80,"weightedUsage":0.020930929033652634},{"id":"foulplay","name":"Foul Play","desc":"Damage is calculated using the target's Attack stat, including stat stage changes. The user's Ability, item, and burn are used as normal.","shortDesc":"Uses target's Attack stat in damage calculation.","type":"Dark","num":492,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":95,"weightedUsage":0.02006690483989958},{"id":"trick","name":"Trick","desc":"The user swaps its held item with the target's held item. Fails if either the user or the target is holding a Mail or Z-Crystal, if neither is holding an item, if the user is trying to give or take a Mega Stone to or from the species that can Mega Evolve with it, or if the user is trying to give or take a Blue Orb, a Red Orb, a Griseous Orb, a Plate, a Drive, or a Memory to or from a Kyogre, a Groudon, a Giratina, an Arceus, a Genesect, or a Silvally, respectively. The target is immune to this move if it has the Sticky Hold Ability.","shortDesc":"User switches its held item with the target's.","type":"Psychic","num":271,"category":"Status","priority":0,"accuracy":100,"pp":10,"basePower":0,"weightedUsage":0.014687320959000784},{"id":"terablast","name":"Tera Blast","desc":"If the user is Terastallized, this move becomes a physical attack if the user's Attack is greater than its Special Attack, including stat stage changes, and this move's type becomes the same as the user's Tera Type. In addition, if the user's Tera Type is Stellar, this move has 100 power, is super effective against Terastallized targets and neutral against other targets, and lowers the user's Attack and Special Attack by 1 stage.","shortDesc":"If Terastallized: Phys. if Atk > SpA, type = Tera.","type":"Normal","num":851,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80,"weightedUsage":0.00905450675007035},{"id":"protect","name":"Protect","desc":"The user is protected from most attacks made by other Pokemon during this turn. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"Prevents moves from affecting the user this turn.","type":"Normal","num":182,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.004769350863637305},{"id":"lowkick","name":"Low Kick","desc":"This move's power is 20 if the target weighs less than 10 kg, 40 if less than 25 kg, 60 if less than 50 kg, 80 if less than 100 kg, 100 if less than 200 kg, and 120 if greater than or equal to 200 kg.","shortDesc":"More power the heavier the target.","type":"Fighting","num":67,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":0,"weightedUsage":0.00424883280459135},{"id":"swagger","name":"Swagger","desc":"Raises the target's Attack by 2 stages and confuses it.","shortDesc":"Raises the target's Attack by 2 and confuses it.","type":"Normal","num":207,"category":"Status","priority":0,"accuracy":85,"pp":15,"basePower":0,"weightedUsage":0.0035368295054557923},{"id":"falsesurrender","name":"False Surrender","desc":"This move does not check accuracy.","shortDesc":"This move does not check accuracy.","type":"Dark","num":793,"category":"Physical","priority":0,"accuracy":true,"pp":10,"basePower":80,"weightedUsage":0.0026632690917909214},{"id":"crunch","name":"Crunch","desc":"Has a 20% chance to lower the target's Defense by 1 stage.","shortDesc":"20% chance to lower the target's Defense by 1.","type":"Dark","num":242,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":80,"weightedUsage":0.0023820555633000786},{"id":"chillingwater","name":"Chilling Water","desc":"Has a 100% chance to lower the target's Attack by 1 stage.","shortDesc":"100% chance to lower the target's Attack by 1.","type":"Water","num":886,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":50,"weightedUsage":0.0015970712794032753},{"id":"flatter","name":"Flatter","desc":"Raises the target's Special Attack by 1 stage and confuses it.","shortDesc":"Raises the target's Sp. Atk by 1 and confuses it.","type":"Dark","num":260,"category":"Status","priority":0,"accuracy":100,"pp":15,"basePower":0,"weightedUsage":0.0008721446371062658},{"id":"assurance","name":"Assurance","desc":"Power doubles if the target has already taken damage this turn, other than direct damage from Belly Drum, confusion, Curse, or Pain Split.","shortDesc":"Power doubles if target was damaged this turn.","type":"Dark","num":372,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":60,"weightedUsage":0.0007620707747590252},{"id":"burningjealousy","name":"Burning Jealousy","desc":"Has a 100% chance to burn the target if it had a stat stage raised this turn.","shortDesc":"100% burns a target that had a stat rise this turn.","type":"Fire","num":807,"category":"Special","priority":0,"accuracy":100,"pp":5,"basePower":70,"weightedUsage":0.0007593050695584233},{"id":"dazzlinggleam","name":"Dazzling Gleam","desc":"No additional effect.","shortDesc":"No additional effect. Hits adjacent foes.","type":"Fairy","num":605,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80,"weightedUsage":0.0005221801802078676},{"id":"torment","name":"Torment","desc":"Prevents the target from selecting the same move for use two turns in a row. This effect ends when the target is no longer active.","shortDesc":"Target can't select the same move twice in a row.","type":"Dark","num":259,"category":"Status","priority":0,"accuracy":100,"pp":15,"basePower":0,"weightedUsage":0.0004253293613267801},{"id":"drainpunch","name":"Drain Punch","desc":"The user recovers 1/2 the HP lost by the target, rounded half up. If Big Root is held by the user, the HP recovered is 1.3x normal, rounded half down.","shortDesc":"User recovers 50% of the damage dealt.","type":"Fighting","num":409,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":75,"weightedUsage":0.00040957517886530307},{"id":"darkpulse","name":"Dark Pulse","desc":"Has a 20% chance to make the target flinch.","shortDesc":"20% chance to make the target flinch.","type":"Dark","num":399,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":80,"weightedUsage":0.0003334223166224021},{"id":"lashout","name":"Lash Out","desc":"Power doubles if the user had a stat stage lowered this turn.","shortDesc":"2x power if the user had a stat lowered this turn.","type":"Dark","num":808,"category":"Physical","priority":0,"accuracy":100,"pp":5,"basePower":75,"weightedUsage":0.0002455924594457932},{"id":"brickbreak","name":"Brick Break","desc":"If this attack does not miss, the effects of Reflect, Light Screen, and Aurora Veil end for the target's side of the field before damage is calculated.","shortDesc":"Destroys screens, unless the target is immune.","type":"Fighting","num":280,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":75,"weightedUsage":0.00010685050102793174},{"id":"fling","name":"Fling","desc":"The power of this move is based on the user's held item. The held item is lost and it activates for the target if applicable. If there is no target or the target avoids this move by protecting itself, the user's held item is still lost. The user can regain a thrown item with Recycle or the Harvest Ability. Fails if the user has no held item, if the held item cannot be thrown, if the user is under the effect of Embargo or Magic Room, or if the user has the Klutz Ability.","shortDesc":"Flings the user's item at the target. Power varies.","type":"Dark","num":374,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":0,"weightedUsage":0.00005544056797353974},{"id":"hammerarm","name":"Hammer Arm","desc":"Lowers the user's Speed by 1 stage.","shortDesc":"Lowers the user's Speed by 1.","type":"Fighting","num":359,"category":"Physical","priority":0,"accuracy":90,"pp":10,"basePower":100,"weightedUsage":0.000054610834654245526},{"id":"leechlife","name":"Leech Life","desc":"The user recovers 1/2 the HP lost by the target, rounded half up. If Big Root is held by the user, the HP recovered is 1.3x normal, rounded half down.","shortDesc":"User recovers 50% of the damage dealt.","type":"Bug","num":141,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":80,"weightedUsage":0.000051893514098629986},{"id":"firepunch","name":"Fire Punch","desc":"Has a 10% chance to burn the target.","shortDesc":"10% chance to burn the target.","type":"Fire","num":7,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":75,"weightedUsage":0.000036641994865267476},{"id":"substitute","name":"Substitute","desc":"The user takes 1/4 of its maximum HP, rounded down, and puts it into a substitute to take its place in battle. The substitute is removed once enough damage is inflicted on it, or if the user switches out or faints. Baton Pass can be used to transfer the substitute to an ally, and the substitute will keep its remaining HP. Until the substitute is broken, it receives damage from all attacks made by other Pokemon and shields the user from status effects and stat stage changes caused by other Pokemon. Sound-based moves and Pokemon with the Infiltrator Ability ignore substitutes. The user still takes normal damage from weather and status effects while behind its substitute. If the substitute breaks during a multi-hit attack, the user will take damage from any remaining hits. If a substitute is created while the user is trapped by a binding move, the binding effect ends immediately. Fails if the user does not have enough HP remaining to create a substitute without fainting, or if it already has a substitute.","shortDesc":"User takes 1/4 its max HP to put in a substitute.","type":"Normal","num":164,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.00003239963958038547},{"id":"stompingtantrum","name":"Stomping Tantrum","desc":"Power doubles if the user's last move on the previous turn, including moves called by other moves or those used through Instruct, Magic Coat, Snatch, or the Dancer or Magic Bounce Abilities, failed to do any of its normal effects, not including damage from an unsuccessful High Jump Kick, Jump Kick, or Mind Blown, or if the user was prevented from moving by any effect other than recharging or Sky Drop. A move that was blocked by Baneful Bunker, Detect, King's Shield, Protect, Spiky Shield, Crafty Shield, Mat Block, Quick Guard, or Wide Guard will not double this move's power, nor will Bounce or Fly ending early due to the effect of Gravity, Smack Down, or Thousand Arrows.","shortDesc":"Power doubles if the user's last move failed.","type":"Ground","num":707,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":75,"weightedUsage":0.000020963325496943623},{"id":"metronome","name":"Metronome","desc":"A random move is selected for use, other than After You, Apple Acid, Armor Cannon, Assist, Astral Barrage, Aura Wheel, Baneful Bunker, Beak Blast, Behemoth Bash, Behemoth Blade, Belch, Bestow, Blazing Torque, Body Press, Branch Poke, Breaking Swipe, Celebrate, Chatter, Chilling Water, Chilly Reception, Clangorous Soul, Collision Course, Combat Torque, Comeuppance, Copycat, Counter, Covet, Crafty Shield, Decorate, Destiny Bond, Detect, Diamond Storm, Doodle, Double Iron Bash, Double Shock, Dragon Ascent, Dragon Energy, Drum Beating, Dynamax Cannon, Electro Drift, Endure, Eternabeam, False Surrender, Feint, Fiery Wrath, Fillet Away, Fleur Cannon, Focus Punch, Follow Me, Freeze Shock, Freezing Glare, Glacial Lance, Grav Apple, Helping Hand, Hold Hands, Hyper Drill, Hyperspace Fury, Hyperspace Hole, Ice Burn, Instruct, Jet Punch, Jungle Healing, King's Shield, Life Dew, Light of Ruin, Magical Torque, Make It Rain, Mat Block, Me First, Meteor Assault, Metronome, Mimic, Mind Blown, Mirror Coat, Mirror Move, Moongeist Beam, Nature Power, Nature's Madness, Noxious Torque, Obstruct, Order Up, Origin Pulse, Overdrive, Photon Geyser, Plasma Fists, Population Bomb, Pounce, Power Shift, Precipice Blades, Protect, Pyro Ball, Quash, Quick Guard, Rage Fist, Rage Powder, Raging Bull, Raging Fury, Relic Song, Revival Blessing, Ruination, Salt Cure, Secret Sword, Shed Tail, Shell Trap, Silk Trap, Sketch, Sleep Talk, Snap Trap, Snarl, Snatch, Snore, Snowscape, Spectral Thief, Spicy Extract, Spiky Shield, Spirit Break, Spotlight, Springtide Storm, Steam Eruption, Steel Beam, Strange Steam, Struggle, Sunsteel Strike, Surging Strikes, Switcheroo, Techno Blast, Tera Starstorm, Thief, Thousand Arrows, Thousand Waves, Thunder Cage, Thunderous Kick, Tidy Up, Trailblaze, Transform, Trick, Twin Beam, V-create, Wicked Blow, Wicked Torque, or Wide Guard.","shortDesc":"Picks a random move.","type":"Normal","num":118,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.000012053420107060482},{"id":"drainingkiss","name":"Draining Kiss","desc":"The user recovers 3/4 the HP lost by the target, rounded half up. If Big Root is held by the user, the HP recovered is 1.3x normal, rounded half down.","shortDesc":"User recovers 75% of the damage dealt.","type":"Fairy","num":577,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":50,"weightedUsage":0.000011612369560526019},{"id":"imprison","name":"Imprison","desc":"The user prevents all opposing Pokemon from using any moves that the user also knows as long as the user remains active.","shortDesc":"No foe can use any move known by the user.","type":"Psychic","num":286,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.000010088181341953929},{"id":"icepunch","name":"Ice Punch","desc":"Has a 10% chance to freeze the target.","shortDesc":"10% chance to freeze the target.","type":"Ice","num":8,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":75,"weightedUsage":0.00000853865849257761},{"id":"bulkup","name":"Bulk Up","desc":"Raises the user's Attack and Defense by 1 stage.","shortDesc":"Raises the user's Attack and Defense by 1.","type":"Fighting","num":339,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0,"weightedUsage":0.000005472693854390121},{"id":"rest","name":"Rest","desc":"The user falls asleep for the next two turns and restores all of its HP, curing itself of any non-volatile status condition in the process. Fails if the user has full HP, is already asleep, or if another effect is preventing sleep.","shortDesc":"User sleeps 2 turns and restores HP and status.","type":"Psychic","num":156,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0,"weightedUsage":0.0000021703165919599763},{"id":"bodyslam","name":"Body Slam","desc":"Has a 30% chance to paralyze the target. Damage doubles and no accuracy check is done if the target has used Minimize while active.","shortDesc":"30% chance to paralyze the target.","type":"Normal","num":34,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":85,"weightedUsage":9.72685012195713e-7},{"id":"shadowclaw","name":"Shadow Claw","desc":"Has a higher chance for a critical hit.","shortDesc":"High critical hit ratio.","type":"Ghost","num":421,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":70,"weightedUsage":4.237583661915035e-7},{"id":"nastyplot","name":"Nasty Plot","desc":"Raises the user's Special Attack by 2 stages.","shortDesc":"Raises the user's Sp. Atk by 2.","type":"Dark","num":417,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0,"weightedUsage":3.3212543318380234e-7},{"id":"confide","name":"Confide","desc":"Lowers the target's Special Attack by 1 stage.","shortDesc":"Lowers the target's Sp. Atk by 1.","type":"Normal","num":590,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0,"weightedUsage":1.8366303084335492e-7},{"id":"bodypress","name":"Body Press","desc":"Damage is calculated using the user's Defense stat as its Attack, including stat stage changes. Other effects that modify the Attack stat are used as normal.","shortDesc":"Uses user's Def stat as Atk in damage calculation.","type":"Fighting","num":776,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":80,"weightedUsage":8.861179701425259e-8},{"id":"facade","name":"Facade","desc":"Power doubles if the user is burned, paralyzed, or poisoned. The physical damage halving effect from the user's burn is ignored.","shortDesc":"Power doubles if user is burn/poison/paralyzed.","type":"Normal","num":263,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":70,"weightedUsage":5.3319513131163373e-8},{"id":"trailblaze","name":"Trailblaze","desc":"Has a 100% chance to raise the user's Speed by 1 stage.","shortDesc":"100% chance to raise the user's Speed by 1.","type":"Grass","num":885,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":50,"weightedUsage":2.8173463834028916e-8},{"id":"sleeptalk","name":"Sleep Talk","desc":"One of the user's known moves, besides this move, is selected for use at random. Fails if the user is not asleep. The selected move does not have PP deducted from it, and can currently have 0 PP. This move cannot select Assist, Beak Blast, Belch, Bide, Blazing Torque, Celebrate, Chatter, Combat Torque, Copycat, Dynamax Cannon, Focus Punch, Hold Hands, Magical Torque, Me First, Metronome, Mimic, Mirror Move, Nature Power, Noxious Torque, Shell Trap, Sketch, Sleep Talk, Struggle, Uproar, Wicked Torque, or any two-turn move.","shortDesc":"User must be asleep. Uses another known move.","type":"Normal","num":214,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":1.736628512806671e-8},{"id":"thief","name":"Thief","desc":"If this attack was successful and the user has not fainted, it steals the target's held item if the user is not holding one. The target's item is not stolen if it is a Mail or Z-Crystal, or if the target is a Kyogre holding a Blue Orb, a Groudon holding a Red Orb, a Giratina holding a Griseous Orb, an Arceus holding a Plate, a Genesect holding a Drive, a Silvally holding a Memory, or a Pokemon that can Mega Evolve holding the Mega Stone for its species. Items lost to this move cannot be regained with Recycle or the Harvest Ability.","shortDesc":"If the user has no item, it steals the target's.","type":"Dark","num":168,"category":"Physical","priority":0,"accuracy":100,"pp":25,"basePower":60,"weightedUsage":2.6604263193550355e-10},{"id":"focuspunch","name":"Focus Punch","desc":"The user loses its focus and does nothing if it is hit by a damaging attack this turn before it can execute the move.","shortDesc":"Fails if the user takes damage before it hits.","type":"Fighting","num":264,"category":"Physical","priority":-3,"accuracy":100,"pp":20,"basePower":150,"weightedUsage":0},{"id":"endure","name":"Endure","desc":"The user will survive attacks made by other Pokemon during this turn with at least 1 HP. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"User survives attacks this turn with at least 1 HP.","type":"Normal","num":203,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0},{"id":"lowsweep","name":"Low Sweep","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance to lower the target's Speed by 1.","type":"Fighting","num":490,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":65,"weightedUsage":0},{"id":"focusblast","name":"Focus Blast","desc":"Has a 10% chance to lower the target's Special Defense by 1 stage.","shortDesc":"10% chance to lower the target's Sp. Def by 1.","type":"Fighting","num":411,"category":"Special","priority":0,"accuracy":70,"pp":5,"basePower":120,"weightedUsage":0}]}