{"name":"Indeedee","id":"indeedee","num":876,"moves":[{"id":"expandingforce","name":"Expanding Force","desc":"If the current terrain is Psychic Terrain and the user is grounded, this move hits all opposing Pokemon and has its power multiplied by 1.5.","shortDesc":"User on Psychic Terrain: 1.5x power, hits foes.","type":"Psychic","num":797,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80,"weightedUsage":0.958499086681918},{"id":"dazzlinggleam","name":"Dazzling Gleam","desc":"No additional effect.","shortDesc":"No additional effect. Hits adjacent foes.","type":"Fairy","num":605,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80,"weightedUsage":0.7881054974949822},{"id":"hypervoice","name":"Hyper Voice","desc":"No additional effect.","shortDesc":"No additional effect. Hits adjacent foes.","type":"Normal","num":304,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":90,"weightedUsage":0.387858770444786},{"id":"gravity","name":"Gravity","desc":"For 5 turns, the evasiveness of all active Pokemon is multiplied by 0.6. At the time of use, Bounce, Fly, Magnet Rise, Sky Drop, and Telekinesis end immediately for all active Pokemon. During the effect, Bounce, Fly, Flying Press, High Jump Kick, Jump Kick, Magnet Rise, Sky Drop, Splash, and Telekinesis are prevented from being used by all active Pokemon. Ground-type attacks, Spikes, Toxic Spikes, Sticky Web, and the Arena Trap Ability can affect Flying types or Pokemon with the Levitate Ability. Fails if this move is already in effect.","shortDesc":"5 turns: no Ground immunities, 1.67x accuracy.","type":"Psychic","num":356,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0,"weightedUsage":0.34701327656592507},{"id":"trickroom","name":"Trick Room","desc":"For 5 turns, the Speed of every Pokemon is recalculated for the purposes of determining turn order. During the effect, each Pokemon's Speed is considered to be (10000 - its normal Speed), and if this value is greater than 8191, 8192 is subtracted from it. If this move is used during the effect, the effect ends.","shortDesc":"Goes last. For 5 turns, turn order is reversed.","type":"Psychic","num":433,"category":"Status","priority":-7,"accuracy":true,"pp":5,"basePower":0,"weightedUsage":0.32691288148125147},{"id":"trick","name":"Trick","desc":"The user swaps its held item with the target's held item. Fails if either the user or the target is holding a Mail or Z-Crystal, if neither is holding an item, if the user is trying to give or take a Mega Stone to or from the species that can Mega Evolve with it, or if the user is trying to give or take a Blue Orb, a Red Orb, a Griseous Orb, a Plate, a Drive, or a Memory to or from a Kyogre, a Groudon, a Giratina, an Arceus, a Genesect, or a Silvally, respectively. The target is immune to this move if it has the Sticky Hold Ability.","shortDesc":"User switches its held item with the target's.","type":"Psychic","num":271,"category":"Status","priority":0,"accuracy":100,"pp":10,"basePower":0,"weightedUsage":0.3099831907146003},{"id":"protect","name":"Protect","desc":"The user is protected from most attacks made by other Pokemon during this turn. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"Prevents moves from affecting the user this turn.","type":"Normal","num":182,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.17677116984447167},{"id":"psyshock","name":"Psyshock","desc":"Deals damage to the target based on its Defense instead of Special Defense.","shortDesc":"Damages target based on Defense, not Sp. Def.","type":"Psychic","num":473,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80,"weightedUsage":0.13575602678503942},{"id":"imprison","name":"Imprison","desc":"The user prevents all opposing Pokemon from using any moves that the user also knows as long as the user remains active.","shortDesc":"No foe can use any move known by the user.","type":"Psychic","num":286,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.11252400300687028},{"id":"helpinghand","name":"Helping Hand","desc":"The power of the target's attack this turn is multiplied by 1.5 (this effect is stackable). Fails if there is no ally adjacent to the user or if the ally already moved this turn, but does not fail if the ally is using a two-turn move.","shortDesc":"One adjacent ally's move power is 1.5x this turn.","type":"Normal","num":270,"category":"Status","priority":5,"accuracy":true,"pp":20,"basePower":0,"weightedUsage":0.11218440581104004},{"id":"skillswap","name":"Skill Swap","desc":"The user swaps its Ability with the target's Ability. Fails if either the user or the target's Ability is As One, Battle Bond, Comatose, Commander, Disguise, Embody Aspect, Hunger Switch, Ice Face, Illusion, Multitype, Neutralizing Gas, Poison Puppeteer, Power Construct, Protosynthesis, Quark Drive, RKS System, Schooling, Shields Down, Stance Change, Tera Shell, Tera Shift, Teraform Zero, Wonder Guard, Zen Mode, or Zero to Hero.","shortDesc":"The user and the target trade Abilities.","type":"Psychic","num":285,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.07562250857308031},{"id":"terablast","name":"Tera Blast","desc":"If the user is Terastallized, this move becomes a physical attack if the user's Attack is greater than its Special Attack, including stat stage changes, and this move's type becomes the same as the user's Tera Type. In addition, if the user's Tera Type is Stellar, this move has 100 power, is super effective against Terastallized targets and neutral against other targets, and lowers the user's Attack and Special Attack by 1 stage.","shortDesc":"If Terastallized: Phys. if Atk > SpA, type = Tera.","type":"Normal","num":851,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80,"weightedUsage":0.05621949529042162},{"id":"psychicterrain","name":"Psychic Terrain","desc":"For 5 turns, the terrain becomes Psychic Terrain. During the effect, the power of Psychic-type attacks made by grounded Pokemon is multiplied by 1.3 and grounded Pokemon cannot be hit by moves with priority greater than 0, unless the target is an ally. Camouflage transforms the user into a Psychic type, Nature Power becomes Psychic, and Secret Power has a 30% chance to lower the target's Speed by 1 stage. Fails if the current terrain is Psychic Terrain.","shortDesc":"5 turns. Grounded: +Psychic power, priority-safe.","type":"Psychic","num":678,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.04308211562441447},{"id":"shadowball","name":"Shadow Ball","desc":"Has a 20% chance to lower the target's Special Defense by 1 stage.","shortDesc":"20% chance to lower the target's Sp. Def by 1.","type":"Ghost","num":247,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":80,"weightedUsage":0.0387477303833541},{"id":"psychic","name":"Psychic","desc":"Has a 10% chance to lower the target's Special Defense by 1 stage.","shortDesc":"10% chance to lower the target's Sp. Def by 1.","type":"Psychic","num":94,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":90,"weightedUsage":0.035701480963608916},{"id":"afteryou","name":"After You","desc":"The target makes its move immediately after the user this turn, no matter the priority of its selected move. Fails if the target would have moved next anyway, or if the target already moved this turn.","shortDesc":"The target makes its move right after the user.","type":"Normal","num":495,"category":"Status","priority":0,"accuracy":true,"pp":15,"basePower":0,"weightedUsage":0.018065592191272323},{"id":"energyball","name":"Energy Ball","desc":"Has a 10% chance to lower the target's Special Defense by 1 stage.","shortDesc":"10% chance to lower the target's Sp. Def by 1.","type":"Grass","num":412,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":90,"weightedUsage":0.01273332026848066},{"id":"fakeout","name":"Fake Out","desc":"Has a 100% chance to make the target flinch. Fails unless it is the user's first turn on the field.","shortDesc":"Hits first. First turn out only. 100% flinch chance.","type":"Normal","num":252,"category":"Physical","priority":3,"accuracy":100,"pp":10,"basePower":40,"weightedUsage":0.005584365086812887},{"id":"calmmind","name":"Calm Mind","desc":"Raises the user's Special Attack and Special Defense by 1 stage.","shortDesc":"Raises the user's Sp. Atk and Sp. Def by 1.","type":"Psychic","num":347,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0,"weightedUsage":0.005509539452947404},{"id":"drainpunch","name":"Drain Punch","desc":"The user recovers 1/2 the HP lost by the target, rounded half up. If Big Root is held by the user, the HP recovered is 1.3x normal, rounded half down.","shortDesc":"User recovers 50% of the damage dealt.","type":"Fighting","num":409,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":75,"weightedUsage":0.00493144591469377},{"id":"healingwish","name":"Healing Wish","desc":"The user faints, and if the Pokemon brought out to replace it does not have full HP or has a non-volatile status condition, its HP is fully restored along with having any non-volatile status condition cured. The replacement is sent out at the end of the turn, and the healing happens before hazards take effect. This effect continues until a Pokemon that meets either of these conditions switches in at the user's position or gets swapped into the position with Ally Switch. Fails if the user is the last unfainted Pokemon in its party.","shortDesc":"User faints. Next hurt Pokemon is fully healed.","type":"Psychic","num":361,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.003125932748062195},{"id":"drainingkiss","name":"Draining Kiss","desc":"The user recovers 3/4 the HP lost by the target, rounded half up. If Big Root is held by the user, the HP recovered is 1.3x normal, rounded half down.","shortDesc":"User recovers 75% of the damage dealt.","type":"Fairy","num":577,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":50,"weightedUsage":0.0009527627937076948},{"id":"psychicnoise","name":"Psychic Noise","desc":"For 2 turns, the target is prevented from restoring any HP as long as it remains active. During the effect, healing and draining moves are unusable, and Abilities and items that grant healing will not heal the user. If an affected Pokemon uses Baton Pass, the replacement will remain unable to restore its HP. Pain Split and the Regenerator Ability are unaffected.","shortDesc":"For 2 turns, the target is prevented from healing.","type":"Psychic","num":917,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":75,"weightedUsage":0.00021782550398482587},{"id":"psychup","name":"Psych Up","desc":"The user copies all of the target's current stat stage changes.","shortDesc":"Copies the target's current stat stages.","type":"Normal","num":244,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.00020991597220372215},{"id":"sleeptalk","name":"Sleep Talk","desc":"One of the user's known moves, besides this move, is selected for use at random. Fails if the user is not asleep. The selected move does not have PP deducted from it, and can currently have 0 PP. This move cannot select Assist, Beak Blast, Belch, Bide, Blazing Torque, Celebrate, Chatter, Combat Torque, Copycat, Dynamax Cannon, Focus Punch, Hold Hands, Magical Torque, Me First, Metronome, Mimic, Mirror Move, Nature Power, Noxious Torque, Shell Trap, Sketch, Sleep Talk, Struggle, Uproar, Wicked Torque, or any two-turn move.","shortDesc":"User must be asleep. Uses another known move.","type":"Normal","num":214,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.00020242850761230646},{"id":"powersplit","name":"Power Split","desc":"The user and the target have their Attack and Special Attack stats set to be equal to the average of the user and the target's Attack and Special Attack stats, respectively, rounded down. Stat stage changes are unaffected.","shortDesc":"Averages Attack and Sp. Atk stats with target.","type":"Psychic","num":471,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.00011628220963264693},{"id":"storedpower","name":"Stored Power","desc":"Power is equal to 20+(X*20), where X is the user's total stat stage changes that are greater than 0.","shortDesc":" + 20 power for each of the user's stat boosts.","type":"Psychic","num":500,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":20,"weightedUsage":0.00003955626954343819},{"id":"substitute","name":"Substitute","desc":"The user takes 1/4 of its maximum HP, rounded down, and puts it into a substitute to take its place in battle. The substitute is removed once enough damage is inflicted on it, or if the user switches out or faints. Baton Pass can be used to transfer the substitute to an ally, and the substitute will keep its remaining HP. Until the substitute is broken, it receives damage from all attacks made by other Pokemon and shields the user from status effects and stat stage changes caused by other Pokemon. Sound-based moves and Pokemon with the Infiltrator Ability ignore substitutes. The user still takes normal damage from weather and status effects while behind its substitute. If the substitute breaks during a multi-hit attack, the user will take damage from any remaining hits. If a substitute is created while the user is trapped by a binding move, the binding effect ends immediately. Fails if the user does not have enough HP remaining to create a substitute without fainting, or if it already has a substitute.","shortDesc":"User takes 1/4 its max HP to put in a substitute.","type":"Normal","num":164,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.000024129659799517697},{"id":"bodyslam","name":"Body Slam","desc":"Has a 30% chance to paralyze the target. Damage doubles and no accuracy check is done if the target has used Minimize while active.","shortDesc":"30% chance to paralyze the target.","type":"Normal","num":34,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":85,"weightedUsage":0.000009749177747838276},{"id":"lastresort","name":"Last Resort","desc":"This move fails unless the user knows this move and at least one other move, and has used all the other moves it knows at least once each since it became active or Transformed.","shortDesc":"Fails unless each known move has been used.","type":"Normal","num":387,"category":"Physical","priority":0,"accuracy":100,"pp":5,"basePower":140,"weightedUsage":0.000009710781986020864},{"id":"playrough","name":"Play Rough","desc":"Has a 10% chance to lower the target's Attack by 1 stage.","shortDesc":"10% chance to lower the target's Attack by 1.","type":"Fairy","num":583,"category":"Physical","priority":0,"accuracy":90,"pp":10,"basePower":90,"weightedUsage":0.000007002747925701946},{"id":"metronome","name":"Metronome","desc":"A random move is selected for use, other than After You, Apple Acid, Armor Cannon, Assist, Astral Barrage, Aura Wheel, Baneful Bunker, Beak Blast, Behemoth Bash, Behemoth Blade, Belch, Bestow, Blazing Torque, Body Press, Branch Poke, Breaking Swipe, Celebrate, Chatter, Chilling Water, Chilly Reception, Clangorous Soul, Collision Course, Combat Torque, Comeuppance, Copycat, Counter, Covet, Crafty Shield, Decorate, Destiny Bond, Detect, Diamond Storm, Doodle, Double Iron Bash, Double Shock, Dragon Ascent, Dragon Energy, Drum Beating, Dynamax Cannon, Electro Drift, Endure, Eternabeam, False Surrender, Feint, Fiery Wrath, Fillet Away, Fleur Cannon, Focus Punch, Follow Me, Freeze Shock, Freezing Glare, Glacial Lance, Grav Apple, Helping Hand, Hold Hands, Hyper Drill, Hyperspace Fury, Hyperspace Hole, Ice Burn, Instruct, Jet Punch, Jungle Healing, King's Shield, Life Dew, Light of Ruin, Magical Torque, Make It Rain, Mat Block, Me First, Meteor Assault, Metronome, Mimic, Mind Blown, Mirror Coat, Mirror Move, Moongeist Beam, Nature Power, Nature's Madness, Noxious Torque, Obstruct, Order Up, Origin Pulse, Overdrive, Photon Geyser, Plasma Fists, Population Bomb, Pounce, Power Shift, Precipice Blades, Protect, Pyro Ball, Quash, Quick Guard, Rage Fist, Rage Powder, Raging Bull, Raging Fury, Relic Song, Revival Blessing, Ruination, Salt Cure, Secret Sword, Shed Tail, Shell Trap, Silk Trap, Sketch, Sleep Talk, Snap Trap, Snarl, Snatch, Snore, Snowscape, Spectral Thief, Spicy Extract, Spiky Shield, Spirit Break, Spotlight, Springtide Storm, Steam Eruption, Steel Beam, Strange Steam, Struggle, Sunsteel Strike, Surging Strikes, Switcheroo, Techno Blast, Tera Starstorm, Thief, Thousand Arrows, Thousand Waves, Thunder Cage, Thunderous Kick, Tidy Up, Trailblaze, Transform, Trick, Twin Beam, V-create, Wicked Blow, Wicked Torque, or Wide Guard.","shortDesc":"Picks a random move.","type":"Normal","num":118,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.0000031064324016477957},{"id":"extrasensory","name":"Extrasensory","desc":"Has a 10% chance to make the target flinch.","shortDesc":"10% chance to make the target flinch.","type":"Psychic","num":326,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":80,"weightedUsage":0.00000110091154114996},{"id":"playnice","name":"Play Nice","desc":"Lowers the target's Attack by 1 stage.","shortDesc":"Lowers the target's Attack by 1.","type":"Normal","num":589,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0,"weightedUsage":5.390397735009721e-7},{"id":"psybeam","name":"Psybeam","desc":"Has a 10% chance to confuse the target.","shortDesc":"10% chance to confuse the target.","type":"Psychic","num":60,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":65,"weightedUsage":5.5362068663128864e-9},{"id":"magicalleaf","name":"Magical Leaf","desc":"This move does not check accuracy.","shortDesc":"This move does not check accuracy.","type":"Grass","num":345,"category":"Special","priority":0,"accuracy":true,"pp":20,"basePower":60,"weightedUsage":4.265192423417107e-10},{"id":"disarmingvoice","name":"Disarming Voice","desc":"This move does not check accuracy.","shortDesc":"This move does not check accuracy. Hits foes.","type":"Fairy","num":574,"category":"Special","priority":0,"accuracy":true,"pp":15,"basePower":40,"weightedUsage":9.324063739595189e-15},{"id":"endure","name":"Endure","desc":"The user will survive attacks made by other Pokemon during this turn with at least 1 HP. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"User survives attacks this turn with at least 1 HP.","type":"Normal","num":203,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":2.3469188784777074e-16},{"id":"swift","name":"Swift","desc":"This move does not check accuracy.","shortDesc":"This move does not check accuracy. Hits foes.","type":"Normal","num":129,"category":"Special","priority":0,"accuracy":true,"pp":20,"basePower":60,"weightedUsage":8.652781723680437e-17},{"id":"facade","name":"Facade","desc":"Power doubles if the user is burned, paralyzed, or poisoned. The physical damage halving effect from the user's burn is ignored.","shortDesc":"Power doubles if user is burn/poison/paralyzed.","type":"Normal","num":263,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":70,"weightedUsage":0},{"id":"zenheadbutt","name":"Zen Headbutt","desc":"Has a 20% chance to make the target flinch.","shortDesc":"20% chance to make the target flinch.","type":"Psychic","num":428,"category":"Physical","priority":0,"accuracy":90,"pp":15,"basePower":80,"weightedUsage":0}]}