{"name":"Luvdisc","id":"luvdisc","num":370,"types":["Water"],"imgID":370,"baseStats":[43,30,55,40,65,97],"weight":8.7,"bst":330,"usage":0,"moves":[{"id":"agility","name":"Agility","desc":"Raises the user's Speed by 2 stages.","shortDesc":"Raises the user's Speed by 2.","type":"Psychic","num":97,"category":"Status","priority":0,"accuracy":true,"pp":30,"basePower":0},{"id":"aquajet","name":"Aqua Jet","desc":"No additional effect.","shortDesc":"Usually goes first.","type":"Water","num":453,"category":"Physical","priority":1,"accuracy":100,"pp":20,"basePower":40},{"id":"aquaring","name":"Aqua Ring","desc":"The user has 1/16 of its maximum HP, rounded down, restored at the end of each turn while it remains active. If Big Root is held by the user, the HP recovered is 1.3x normal, rounded half down. If the user uses Baton Pass, the replacement will receive the healing effect.","shortDesc":"User recovers 1/16 max HP per turn.","type":"Water","num":392,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0},{"id":"attract","name":"Attract","desc":"Causes the target to become infatuated, making it unable to attack 50% of the time. Fails if both the user and the target are the same gender, if either is genderless, or if the target is already infatuated. The effect ends when either the user or the target is no longer active. Pokemon with the Oblivious Ability or protected by the Aroma Veil Ability are immune.","shortDesc":"A target of the opposite gender gets infatuated.","type":"Normal","num":213,"category":"Status","priority":0,"accuracy":100,"pp":15,"basePower":0},{"id":"babydolleyes","name":"Baby-Doll Eyes","desc":"Lowers the target's Attack by 1 stage.","shortDesc":"Lowers the target's Attack by 1.","type":"Fairy","num":608,"category":"Status","priority":1,"accuracy":100,"pp":30,"basePower":0},{"id":"blizzard","name":"Blizzard","desc":"Has a 10% chance to freeze the target. If the weather is Snow, this move does not check accuracy.","shortDesc":"10% chance to freeze foe(s). Can't miss in Snow.","type":"Ice","num":59,"category":"Special","priority":0,"accuracy":70,"pp":5,"basePower":110},{"id":"charm","name":"Charm","desc":"Lowers the target's Attack by 2 stages.","shortDesc":"Lowers the target's Attack by 2.","type":"Fairy","num":204,"category":"Status","priority":0,"accuracy":100,"pp":20,"basePower":0},{"id":"drainingkiss","name":"Draining Kiss","desc":"The user recovers 3/4 the HP lost by the target, rounded half up. If Big Root is held by the user, the HP recovered is 1.3x normal, rounded half down.","shortDesc":"User recovers 75% of the damage dealt.","type":"Fairy","num":577,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":50},{"id":"endeavor","name":"Endeavor","desc":"Deals damage to the target equal to (target's current HP - user's current HP). The target is unaffected if its current HP is less than or equal to the user's current HP.","shortDesc":"Lowers the target's HP to the user's HP.","type":"Normal","num":283,"category":"Physical","priority":0,"accuracy":100,"pp":5,"basePower":0},{"id":"endure","name":"Endure","desc":"The user will survive attacks made by other Pokemon during this turn with at least 1 HP. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"User survives attacks this turn with at least 1 HP.","type":"Normal","num":203,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0},{"id":"entrainment","name":"Entrainment","desc":"Causes the target's Ability to become the same as the user's. Fails if the target's Ability is As One, Battle Bond, Comatose, Disguise, Gulp Missile, Ice Face, Multitype, Power Construct, RKS System, Schooling, Shields Down, Stance Change, Tera Shift, Truant, Zen Mode, or Zero to Hero, or the same Ability as the user, or if the user's Ability is As One, Battle Bond, Comatose, Commander, Disguise, Embody Aspect, Flower Gift, Forecast, Hunger Switch, Ice Face, Illusion, Imposter, Multitype, Neutralizing Gas, Poison Puppeteer, Power Construct, Power of Alchemy, Protosynthesis, Quark Drive, Receiver, RKS System, Schooling, Shields Down, Stance Change, Tera Shell, Tera Shift, Teraform Zero, Trace, Wonder Guard, Zen Mode, or Zero to Hero.","shortDesc":"The target's Ability changes to match the user's.","type":"Normal","num":494,"category":"Status","priority":0,"accuracy":100,"pp":15,"basePower":0},{"id":"facade","name":"Facade","desc":"Power doubles if the user is burned, paralyzed, or poisoned. The physical damage halving effect from the user's burn is ignored.","shortDesc":"Power doubles if user is burn/poison/paralyzed.","type":"Normal","num":263,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":70},{"id":"flail","name":"Flail","desc":"The power of this move is 20 if X is 33 to 48, 40 if X is 17 to 32, 80 if X is 10 to 16, 100 if X is 5 to 9, 150 if X is 2 to 4, and 200 if X is 0 or 1, where X is equal to (user's current HP * 48 / user's maximum HP), rounded down.","shortDesc":"More power the less HP the user has left.","type":"Normal","num":175,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":0},{"id":"flipturn","name":"Flip Turn","desc":"If this move is successful and the user has not fainted, the user switches out even if it is trapped and is replaced immediately by a selected party member. The user does not switch out if there are no unfainted party members, or if the target switched out using an Eject Button or through the effect of the Emergency Exit or Wimp Out Abilities.","shortDesc":"User switches out after damaging the target.","type":"Water","num":812,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":60},{"id":"hydropump","name":"Hydro Pump","desc":"No additional effect.","shortDesc":"No additional effect.","type":"Water","num":56,"category":"Special","priority":0,"accuracy":80,"pp":5,"basePower":110},{"id":"icebeam","name":"Ice Beam","desc":"Has a 10% chance to freeze the target.","shortDesc":"10% chance to freeze the target.","type":"Ice","num":58,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":90},{"id":"icywind","name":"Icy Wind","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance to lower the foe(s) Speed by 1.","type":"Ice","num":196,"category":"Special","priority":0,"accuracy":95,"pp":15,"basePower":55},{"id":"liquidation","name":"Liquidation","desc":"Has a 20% chance to lower the target's Defense by 1 stage.","shortDesc":"20% chance to lower the target's Defense by 1.","type":"Water","num":710,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":85},{"id":"protect","name":"Protect","desc":"The user is protected from most attacks made by other Pokemon during this turn. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"Prevents moves from affecting the user this turn.","type":"Normal","num":182,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0},{"id":"psychup","name":"Psych Up","desc":"The user copies all of the target's current stat stage changes.","shortDesc":"Copies the target's current stat stages.","type":"Normal","num":244,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"raindance","name":"Rain Dance","desc":"For 5 turns, the weather becomes Rain Dance. The damage of Water-type attacks is multiplied by 1.5 and the damage of Fire-type attacks is multiplied by 0.5 during the effect. Lasts for 8 turns if the user is holding Damp Rock. Fails if the current weather is Rain Dance.","shortDesc":"For 5 turns, heavy rain powers Water moves.","type":"Water","num":240,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0},{"id":"rest","name":"Rest","desc":"The user falls asleep for the next two turns and restores all of its HP, curing itself of any non-volatile status condition in the process. Fails if the user has full HP, is already asleep, or if another effect is preventing sleep.","shortDesc":"User sleeps 2 turns and restores HP and status.","type":"Psychic","num":156,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0},{"id":"safeguard","name":"Safeguard","desc":"For 5 turns, the user and its party members cannot have non-volatile status conditions or confusion inflicted on them by other Pokemon. Pokemon on the user's side cannot become affected by Yawn but can fall asleep from its effect. It is removed from the user's side if the user or an ally is successfully hit by Defog. Fails if the effect is already active on the user's side.","shortDesc":"For 5 turns, protects user's party from status.","type":"Normal","num":219,"category":"Status","priority":0,"accuracy":true,"pp":25,"basePower":0},{"id":"scaleshot","name":"Scale Shot","desc":"Hits two to five times. Lowers the user's Defense by 1 stage and raises the user's Speed by 1 stage after the last hit. Has a 35% chance to hit two or three times and a 15% chance to hit four or five times. If one of the hits breaks the target's substitute, it will take damage for the remaining hits. If the user has the Skill Link Ability, this move will always hit five times.","shortDesc":"Hits 2-5 times. User: -1 Def, +1 Spe after last hit.","type":"Dragon","num":799,"category":"Physical","priority":0,"accuracy":90,"pp":20,"basePower":25},{"id":"sleeptalk","name":"Sleep Talk","desc":"One of the user's known moves, besides this move, is selected for use at random. Fails if the user is not asleep. The selected move does not have PP deducted from it, and can currently have 0 PP. This move cannot select Assist, Beak Blast, Belch, Bide, Blazing Torque, Celebrate, Chatter, Combat Torque, Copycat, Dynamax Cannon, Focus Punch, Hold Hands, Magical Torque, Me First, Metronome, Mimic, Mirror Move, Nature Power, Noxious Torque, Shell Trap, Sketch, Sleep Talk, Struggle, Uproar, Wicked Torque, or any two-turn move.","shortDesc":"User must be asleep. Uses another known move.","type":"Normal","num":214,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"snowscape","name":"Snowscape","desc":"For 5 turns, the weather becomes Snow. During the effect, the Defense of Ice-type Pokemon is multiplied by 1.5 when taking damage from a physical attack. Lasts for 8 turns if the user is holding Icy Rock. Fails if the current weather is Snow.","shortDesc":"For 5 turns, snow falls. Ice: 1.5x Def.","type":"Ice","num":883,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"soak","name":"Soak","desc":"Causes the target to become a Water type. Fails if the target is an Arceus or a Silvally, if the target is already purely Water type, or if the target is Terastallized.","shortDesc":"Changes the target's type to Water.","type":"Water","num":487,"category":"Status","priority":0,"accuracy":100,"pp":20,"basePower":0},{"id":"splash","name":"Splash","desc":"No competitive use.","shortDesc":"No competitive use.","type":"Normal","num":150,"category":"Status","priority":0,"accuracy":true,"pp":40,"basePower":0},{"id":"substitute","name":"Substitute","desc":"The user takes 1/4 of its maximum HP, rounded down, and puts it into a substitute to take its place in battle. The substitute is removed once enough damage is inflicted on it, or if the user switches out or faints. Baton Pass can be used to transfer the substitute to an ally, and the substitute will keep its remaining HP. Until the substitute is broken, it receives damage from all attacks made by other Pokemon and shields the user from status effects and stat stage changes caused by other Pokemon. Sound-based moves and Pokemon with the Infiltrator Ability ignore substitutes. The user still takes normal damage from weather and status effects while behind its substitute. If the substitute breaks during a multi-hit attack, the user will take damage from any remaining hits. If a substitute is created while the user is trapped by a binding move, the binding effect ends immediately. Fails if the user does not have enough HP remaining to create a substitute without fainting, or if it already has a substitute.","shortDesc":"User takes 1/4 its max HP to put in a substitute.","type":"Normal","num":164,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"supersonic","name":"Supersonic","desc":"Causes the target to become confused.","shortDesc":"Causes the target to become confused.","type":"Normal","num":48,"category":"Status","priority":0,"accuracy":55,"pp":20,"basePower":0},{"id":"surf","name":"Surf","desc":"Damage doubles if the target is using Dive.","shortDesc":"Hits adjacent Pokemon. Double damage on Dive.","type":"Water","num":57,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":90},{"id":"sweetkiss","name":"Sweet Kiss","desc":"Causes the target to become confused.","shortDesc":"Causes the target to become confused.","type":"Fairy","num":186,"category":"Status","priority":0,"accuracy":75,"pp":10,"basePower":0},{"id":"tackle","name":"Tackle","desc":"No additional effect.","shortDesc":"No additional effect.","type":"Normal","num":33,"category":"Physical","priority":0,"accuracy":100,"pp":35,"basePower":40},{"id":"takedown","name":"Take Down","desc":"If the target lost HP, the user takes recoil damage equal to 1/4 the HP lost by the target, rounded half up, but not less than 1 HP.","shortDesc":"Has 1/4 recoil.","type":"Normal","num":36,"category":"Physical","priority":0,"accuracy":85,"pp":20,"basePower":90},{"id":"terablast","name":"Tera Blast","desc":"If the user is Terastallized, this move becomes a physical attack if the user's Attack is greater than its Special Attack, including stat stage changes, and this move's type becomes the same as the user's Tera Type. In addition, if the user's Tera Type is Stellar, this move has 100 power, is super effective against Terastallized targets and neutral against other targets, and lowers the user's Attack and Special Attack by 1 stage.","shortDesc":"If Terastallized: Phys. if Atk > SpA, type = Tera.","type":"Normal","num":851,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80},{"id":"waterfall","name":"Waterfall","desc":"Has a 20% chance to make the target flinch.","shortDesc":"20% chance to make the target flinch.","type":"Water","num":127,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":80},{"id":"watergun","name":"Water Gun","desc":"No additional effect.","shortDesc":"No additional effect.","type":"Water","num":55,"category":"Special","priority":0,"accuracy":100,"pp":25,"basePower":40},{"id":"waterpulse","name":"Water Pulse","desc":"Has a 20% chance to confuse the target.","shortDesc":"20% chance to confuse the target.","type":"Water","num":352,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":60},{"id":"whirlpool","name":"Whirlpool","desc":"Prevents the target from switching for four or five turns (seven turns if the user is holding Grip Claw). Causes damage to the target equal to 1/8 of its maximum HP (1/6 if the user is holding Binding Band), rounded down, at the end of each turn during effect. The target can still switch out if it is holding Shed Shell or uses Baton Pass, Flip Turn, Parting Shot, Shed Tail, Teleport, U-turn, or Volt Switch. The effect ends if either the user or the target leaves the field, or if the target uses Mortal Spin, Rapid Spin, or Substitute successfully. This effect is not stackable or reset by using this or another binding move.","shortDesc":"Traps and damages the target for 4-5 turns.","type":"Water","num":250,"category":"Special","priority":0,"accuracy":85,"pp":15,"basePower":35},{"id":"wish","name":"Wish","desc":"At the end of the next turn, the Pokemon at the user's position has 1/2 of the user's maximum HP restored to it, rounded down. Fails if this move is already in effect for the user's position.","shortDesc":"Next turn, 50% of the user's max HP is restored.","type":"Normal","num":273,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0}],"abilities":[{"name":"Swift Swim","id":"swiftswim","desc":"If Rain Dance is active, this Pokemon's Speed is doubled. This effect is prevented if this Pokemon is holding a Utility Umbrella.","shortDesc":"If Rain Dance is active, this Pokemon's Speed is doubled.","num":33},{"name":"Hydration","id":"hydration","desc":"This Pokemon has its non-volatile status condition cured at the end of each turn if Rain Dance is active. This effect is prevented if this Pokemon is holding a Utility Umbrella.","shortDesc":"This Pokemon has its status cured at the end of each turn if Rain Dance is active.","num":93}],"teammates":[],"items":[],"spreads":[]}