{"name":"Munkidori","id":"munkidori","num":1015,"moves":[{"id":"fakeout","name":"Fake Out","desc":"Has a 100% chance to make the target flinch. Fails unless it is the user's first turn on the field.","shortDesc":"Hits first. First turn out only. 100% flinch chance.","type":"Normal","num":252,"category":"Physical","priority":3,"accuracy":100,"pp":10,"basePower":40,"weightedUsage":0.9304521906570166},{"id":"psychic","name":"Psychic","desc":"Has a 10% chance to lower the target's Special Defense by 1 stage.","shortDesc":"10% chance to lower the target's Sp. Def by 1.","type":"Psychic","num":94,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":90,"weightedUsage":0.7192783278257957},{"id":"partingshot","name":"Parting Shot","desc":"Lowers the target's Attack and Special Attack by 1 stage. If this move is successful, the user switches out even if it is trapped and is replaced immediately by a selected party member. The user does not switch out if the target's Attack and Special Attack stat stages were both unchanged, or if there are no unfainted party members.","shortDesc":"Lowers target's Atk, Sp. Atk by 1. User switches.","type":"Dark","num":575,"category":"Status","priority":0,"accuracy":100,"pp":20,"basePower":0,"weightedUsage":0.6256648245366055},{"id":"sludgewave","name":"Sludge Wave","desc":"Has a 10% chance to poison the target.","shortDesc":"10% chance to poison adjacent Pokemon.","type":"Poison","num":482,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":95,"weightedUsage":0.48145756648491755},{"id":"protect","name":"Protect","desc":"The user is protected from most attacks made by other Pokemon during this turn. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"Prevents moves from affecting the user this turn.","type":"Normal","num":182,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.36899764049841105},{"id":"shadowball","name":"Shadow Ball","desc":"Has a 20% chance to lower the target's Special Defense by 1 stage.","shortDesc":"20% chance to lower the target's Sp. Def by 1.","type":"Ghost","num":247,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":80,"weightedUsage":0.10003849371023014},{"id":"psychicnoise","name":"Psychic Noise","desc":"For 2 turns, the target is prevented from restoring any HP as long as it remains active. During the effect, healing and draining moves are unusable, and Abilities and items that grant healing will not heal the user. If an affected Pokemon uses Baton Pass, the replacement will remain unable to restore its HP. Pain Split and the Regenerator Ability are unaffected.","shortDesc":"For 2 turns, the target is prevented from healing.","type":"Psychic","num":917,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":75,"weightedUsage":0.07350509069809484},{"id":"taunt","name":"Taunt","desc":"Prevents the target from using non-damaging moves for its next three turns. Pokemon with the Oblivious Ability or protected by the Aroma Veil Ability are immune.","shortDesc":"Target can't use status moves its next 3 turns.","type":"Dark","num":269,"category":"Status","priority":0,"accuracy":100,"pp":20,"basePower":0,"weightedUsage":0.03450414681948842},{"id":"acidspray","name":"Acid Spray","desc":"Has a 100% chance to lower the target's Special Defense by 2 stages.","shortDesc":"100% chance to lower the target's Sp. Def by 2.","type":"Poison","num":491,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":40,"weightedUsage":0.03255522345774476},{"id":"uturn","name":"U-turn","desc":"If this move is successful and the user has not fainted, the user switches out even if it is trapped and is replaced immediately by a selected party member. The user does not switch out if there are no unfainted party members, or if the target switched out using an Eject Button or through the effect of the Emergency Exit or Wimp Out Abilities.","shortDesc":"User switches out after damaging the target.","type":"Bug","num":369,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":70,"weightedUsage":0.028126083342345547},{"id":"trick","name":"Trick","desc":"The user swaps its held item with the target's held item. Fails if either the user or the target is holding a Mail or Z-Crystal, if neither is holding an item, if the user is trying to give or take a Mega Stone to or from the species that can Mega Evolve with it, or if the user is trying to give or take a Blue Orb, a Red Orb, a Griseous Orb, a Plate, a Drive, or a Memory to or from a Kyogre, a Groudon, a Giratina, an Arceus, a Genesect, or a Silvally, respectively. The target is immune to this move if it has the Sticky Hold Ability.","shortDesc":"User switches its held item with the target's.","type":"Psychic","num":271,"category":"Status","priority":0,"accuracy":100,"pp":10,"basePower":0,"weightedUsage":0.02739330986663067},{"id":"venoshock","name":"Venoshock","desc":"Power doubles if the target is poisoned.","shortDesc":"Power doubles if the target is poisoned.","type":"Poison","num":474,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":65,"weightedUsage":0.017576498122122527},{"id":"clearsmog","name":"Clear Smog","desc":"Resets all of the target's stat stages to 0.","shortDesc":"Resets all of the target's stat stages to 0.","type":"Poison","num":499,"category":"Special","priority":0,"accuracy":true,"pp":15,"basePower":50,"weightedUsage":0.016775339101074514},{"id":"terablast","name":"Tera Blast","desc":"If the user is Terastallized, this move becomes a physical attack if the user's Attack is greater than its Special Attack, including stat stage changes, and this move's type becomes the same as the user's Tera Type. In addition, if the user's Tera Type is Stellar, this move has 100 power, is super effective against Terastallized targets and neutral against other targets, and lowers the user's Attack and Special Attack by 1 stage.","shortDesc":"If Terastallized: Phys. if Atk > SpA, type = Tera.","type":"Normal","num":851,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80,"weightedUsage":0.0065849795820001255},{"id":"psyshock","name":"Psyshock","desc":"Deals damage to the target based on its Defense instead of Special Defense.","shortDesc":"Damages target based on Defense, not Sp. Def.","type":"Psychic","num":473,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80,"weightedUsage":0.006521794737701005},{"id":"storedpower","name":"Stored Power","desc":"Power is equal to 20+(X*20), where X is the user's total stat stage changes that are greater than 0.","shortDesc":" + 20 power for each of the user's stat boosts.","type":"Psychic","num":500,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":20,"weightedUsage":0.006495612586000787},{"id":"batonpass","name":"Baton Pass","desc":"The user is replaced with another Pokemon in its party. The selected Pokemon has the user's stat stage changes, confusion, and certain move effects transferred to it.","shortDesc":"User switches, passing stat changes and more.","type":"Normal","num":226,"category":"Status","priority":0,"accuracy":true,"pp":40,"basePower":0,"weightedUsage":0.005007757105969621},{"id":"hyperbeam","name":"Hyper Beam","desc":"If this move is successful, the user must recharge on the following turn and cannot select a move.","shortDesc":"User cannot move next turn.","type":"Normal","num":63,"category":"Special","priority":0,"accuracy":90,"pp":5,"basePower":150,"weightedUsage":0.00438048653291654},{"id":"helpinghand","name":"Helping Hand","desc":"The power of the target's attack this turn is multiplied by 1.5 (this effect is stackable). Fails if there is no ally adjacent to the user or if the ally already moved this turn, but does not fail if the ally is using a two-turn move.","shortDesc":"One adjacent ally's move power is 1.5x this turn.","type":"Normal","num":270,"category":"Status","priority":5,"accuracy":true,"pp":20,"basePower":0,"weightedUsage":0.0042109737198852675},{"id":"fling","name":"Fling","desc":"The power of this move is based on the user's held item. The held item is lost and it activates for the target if applicable. If there is no target or the target avoids this move by protecting itself, the user's held item is still lost. The user can regain a thrown item with Recycle or the Harvest Ability. Fails if the user has no held item, if the held item cannot be thrown, if the user is under the effect of Embargo or Magic Room, or if the user has the Klutz Ability.","shortDesc":"Flings the user's item at the target. Power varies.","type":"Dark","num":374,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":0,"weightedUsage":0.0037923462944105934},{"id":"futuresight","name":"Future Sight","desc":"Deals damage two turns after this move is used. At the end of that turn, the damage is calculated at that time and dealt to the Pokemon at the position the target had when the move was used. If the user is no longer active at the time, damage is calculated based on the user's natural Special Attack stat, types, and level, with no boosts from its held item or Ability. Fails if this move or Doom Desire is already in effect for the target's position.","shortDesc":"Hits two turns after being used.","type":"Psychic","num":248,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":120,"weightedUsage":0.003172344768812584},{"id":"focusblast","name":"Focus Blast","desc":"Has a 10% chance to lower the target's Special Defense by 1 stage.","shortDesc":"10% chance to lower the target's Sp. Def by 1.","type":"Fighting","num":411,"category":"Special","priority":0,"accuracy":70,"pp":5,"basePower":120,"weightedUsage":0.0013767562906837787},{"id":"psychup","name":"Psych Up","desc":"The user copies all of the target's current stat stage changes.","shortDesc":"Copies the target's current stat stages.","type":"Normal","num":244,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.0013434166946402364},{"id":"calmmind","name":"Calm Mind","desc":"Raises the user's Special Attack and Special Defense by 1 stage.","shortDesc":"Raises the user's Sp. Atk and Sp. Def by 1.","type":"Psychic","num":347,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0,"weightedUsage":0.000809193460142271},{"id":"hex","name":"Hex","desc":"Power doubles if the target has a non-volatile status condition.","shortDesc":"Power doubles if the target has a status ailment.","type":"Ghost","num":506,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":65,"weightedUsage":0.0003300007318898116},{"id":"swift","name":"Swift","desc":"This move does not check accuracy.","shortDesc":"This move does not check accuracy. Hits foes.","type":"Normal","num":129,"category":"Special","priority":0,"accuracy":true,"pp":20,"basePower":60,"weightedUsage":0.0003228196509735884},{"id":"poisonjab","name":"Poison Jab","desc":"Has a 30% chance to poison the target.","shortDesc":"30% chance to poison the target.","type":"Poison","num":398,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":80,"weightedUsage":0.0003226527108567985},{"id":"poltergeist","name":"Poltergeist","desc":"Fails if the target has no held item.","shortDesc":"Fails if the target has no held item.","type":"Ghost","num":809,"category":"Physical","priority":0,"accuracy":90,"pp":5,"basePower":110,"weightedUsage":0.00032265271085617187},{"id":"psychicterrain","name":"Psychic Terrain","desc":"For 5 turns, the terrain becomes Psychic Terrain. During the effect, the power of Psychic-type attacks made by grounded Pokemon is multiplied by 1.3 and grounded Pokemon cannot be hit by moves with priority greater than 0, unless the target is an ally. Camouflage transforms the user into a Psychic type, Nature Power becomes Psychic, and Secret Power has a 30% chance to lower the target's Speed by 1 stage. Fails if the current terrain is Psychic Terrain.","shortDesc":"5 turns. Grounded: +Psychic power, priority-safe.","type":"Psychic","num":678,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.00024636224964343366},{"id":"psybeam","name":"Psybeam","desc":"Has a 10% chance to confuse the target.","shortDesc":"10% chance to confuse the target.","type":"Psychic","num":60,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":65,"weightedUsage":0.0001461910226647155},{"weightedUsage":0.00014535363846169842},{"id":"imprison","name":"Imprison","desc":"The user prevents all opposing Pokemon from using any moves that the user also knows as long as the user remains active.","shortDesc":"No foe can use any move known by the user.","type":"Psychic","num":286,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.000016158121422269083},{"id":"toxic","name":"Toxic","desc":"Badly poisons the target. If a Poison-type Pokemon uses this move, the target cannot avoid the attack, even if the target is in the middle of a two-turn move.","shortDesc":"Badly poisons the target. Poison types can't miss.","type":"Poison","num":92,"category":"Status","priority":0,"accuracy":90,"pp":10,"basePower":0,"weightedUsage":0.0000022413865665967097},{"id":"grassknot","name":"Grass Knot","desc":"This move's power is 20 if the target weighs less than 10 kg, 40 if less than 25 kg, 60 if less than 50 kg, 80 if less than 100 kg, 100 if less than 200 kg, and 120 if greater than or equal to 200 kg.","shortDesc":"More power the heavier the target.","type":"Grass","num":447,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":0,"weightedUsage":0.000002066994490380469},{"id":"nightshade","name":"Night Shade","desc":"Deals damage to the target equal to the user's level.","shortDesc":"Does damage equal to the user's level.","type":"Ghost","num":101,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":0,"weightedUsage":0.0000019611305980473114},{"id":"uproar","name":"Uproar","desc":"The user spends three turns locked into this move. This move targets an opponent at random on each turn. On the first of the three turns, all sleeping active Pokemon wake up. During the three turns, no active Pokemon can fall asleep by any means, and Pokemon switched in during the effect do not wake up. If the user is prevented from moving or the attack is not successful against the target during one of the turns, the effect ends.","shortDesc":"Lasts 3 turns. Active Pokemon cannot fall asleep.","type":"Normal","num":253,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":90,"weightedUsage":3.3715925481493366e-7},{"id":"mudslap","name":"Mud-Slap","desc":"Has a 100% chance to lower the target's accuracy by 1 stage.","shortDesc":"100% chance to lower the target's accuracy by 1.","type":"Ground","num":189,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":20,"weightedUsage":1.0575050297370945e-7},{"id":"gunkshot","name":"Gunk Shot","desc":"Has a 30% chance to poison the target.","shortDesc":"30% chance to poison the target.","type":"Poison","num":441,"category":"Physical","priority":0,"accuracy":80,"pp":5,"basePower":120,"weightedUsage":3.3184553796254533e-9},{"id":"lightscreen","name":"Light Screen","desc":"For 5 turns, the user and its party members take 0.5x damage from special attacks, or 0.66x damage if in a Double Battle. Damage is not reduced further with Aurora Veil. Critical hits ignore this effect. It is removed from the user's side if the user or an ally is successfully hit by Brick Break, Psychic Fangs, or Defog. Lasts for 8 turns if the user is holding Light Clay. Fails if the effect is already active on the user's side.","shortDesc":"For 5 turns, special damage to allies is halved.","type":"Psychic","num":113,"category":"Status","priority":0,"accuracy":true,"pp":30,"basePower":0,"weightedUsage":3.7796418337808246e-11},{"id":"facade","name":"Facade","desc":"Power doubles if the user is burned, paralyzed, or poisoned. The physical damage halving effect from the user's burn is ignored.","shortDesc":"Power doubles if user is burn/poison/paralyzed.","type":"Normal","num":263,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":70,"weightedUsage":1.007051106440984e-15},{"id":"rest","name":"Rest","desc":"The user falls asleep for the next two turns and restores all of its HP, curing itself of any non-volatile status condition in the process. Fails if the user has full HP, is already asleep, or if another effect is preventing sleep.","shortDesc":"User sleeps 2 turns and restores HP and status.","type":"Psychic","num":156,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0,"weightedUsage":0},{"id":"sleeptalk","name":"Sleep Talk","desc":"One of the user's known moves, besides this move, is selected for use at random. Fails if the user is not asleep. The selected move does not have PP deducted from it, and can currently have 0 PP. This move cannot select Assist, Beak Blast, Belch, Bide, Blazing Torque, Celebrate, Chatter, Combat Torque, Copycat, Dynamax Cannon, Focus Punch, Hold Hands, Magical Torque, Me First, Metronome, Mimic, Mirror Move, Nature Power, Noxious Torque, Shell Trap, Sketch, Sleep Talk, Struggle, Uproar, Wicked Torque, or any two-turn move.","shortDesc":"User must be asleep. Uses another known move.","type":"Normal","num":214,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0},{"id":"flatter","name":"Flatter","desc":"Raises the target's Special Attack by 1 stage and confuses it.","shortDesc":"Raises the target's Sp. Atk by 1 and confuses it.","type":"Dark","num":260,"category":"Status","priority":0,"accuracy":100,"pp":15,"basePower":0,"weightedUsage":0},{"id":"metronome","name":"Metronome","desc":"A random move is selected for use, other than After You, Apple Acid, Armor Cannon, Assist, Astral Barrage, Aura Wheel, Baneful Bunker, Beak Blast, Behemoth Bash, Behemoth Blade, Belch, Bestow, Blazing Torque, Body Press, Branch Poke, Breaking Swipe, Celebrate, Chatter, Chilling Water, Chilly Reception, Clangorous Soul, Collision Course, Combat Torque, Comeuppance, Copycat, Counter, Covet, Crafty Shield, Decorate, Destiny Bond, Detect, Diamond Storm, Doodle, Double Iron Bash, Double Shock, Dragon Ascent, Dragon Energy, Drum Beating, Dynamax Cannon, Electro Drift, Endure, Eternabeam, False Surrender, Feint, Fiery Wrath, Fillet Away, Fleur Cannon, Focus Punch, Follow Me, Freeze Shock, Freezing Glare, Glacial Lance, Grav Apple, Helping Hand, Hold Hands, Hyper Drill, Hyperspace Fury, Hyperspace Hole, Ice Burn, Instruct, Jet Punch, Jungle Healing, King's Shield, Life Dew, Light of Ruin, Magical Torque, Make It Rain, Mat Block, Me First, Meteor Assault, Metronome, Mimic, Mind Blown, Mirror Coat, Mirror Move, Moongeist Beam, Nature Power, Nature's Madness, Noxious Torque, Obstruct, Order Up, Origin Pulse, Overdrive, Photon Geyser, Plasma Fists, Population Bomb, Pounce, Power Shift, Precipice Blades, Protect, Pyro Ball, Quash, Quick Guard, Rage Fist, Rage Powder, Raging Bull, Raging Fury, Relic Song, Revival Blessing, Ruination, Salt Cure, Secret Sword, Shed Tail, Shell Trap, Silk Trap, Sketch, Sleep Talk, Snap Trap, Snarl, Snatch, Snore, Snowscape, Spectral Thief, Spicy Extract, Spiky Shield, Spirit Break, Spotlight, Springtide Storm, Steam Eruption, Steel Beam, Strange Steam, Struggle, Sunsteel Strike, Surging Strikes, Switcheroo, Techno Blast, Tera Starstorm, Thief, Thousand Arrows, Thousand Waves, Thunder Cage, Thunderous Kick, Tidy Up, Trailblaze, Transform, Trick, Twin Beam, V-create, Wicked Blow, Wicked Torque, or Wide Guard.","shortDesc":"Picks a random move.","type":"Normal","num":118,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0},{"id":"trailblaze","name":"Trailblaze","desc":"Has a 100% chance to raise the user's Speed by 1 stage.","shortDesc":"100% chance to raise the user's Speed by 1.","type":"Grass","num":885,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":50,"weightedUsage":0}]}