{"name":"Raboot","id":"raboot","num":814,"moves":[{"id":"acrobatics","name":"Acrobatics","desc":"Power doubles if the user has no held item.","shortDesc":"Power doubles if the user has no held item.","type":"Flying","num":512,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":55},{"id":"agility","name":"Agility","desc":"Raises the user's Speed by 2 stages.","shortDesc":"Raises the user's Speed by 2.","type":"Psychic","num":97,"category":"Status","priority":0,"accuracy":true,"pp":30,"basePower":0},{"id":"batonpass","name":"Baton Pass","desc":"The user is replaced with another Pokemon in its party. The selected Pokemon has the user's stat stage changes, confusion, and certain move effects transferred to it.","shortDesc":"User switches, passing stat changes and more.","type":"Normal","num":226,"category":"Status","priority":0,"accuracy":true,"pp":40,"basePower":0},{"id":"bounce","name":"Bounce","desc":"Has a 30% chance to paralyze the target. This attack charges on the first turn and executes on the second. On the first turn, the user avoids all attacks other than Gust, Hurricane, Sky Uppercut, Smack Down, Thousand Arrows, Thunder, and Twister, and Gust and Twister have doubled power when used against it. If the user is holding a Power Herb, the move completes in one turn.","shortDesc":"Bounces turn 1. Hits turn 2. 30% paralyze.","type":"Flying","num":340,"category":"Physical","priority":0,"accuracy":85,"pp":5,"basePower":85},{"id":"bulkup","name":"Bulk Up","desc":"Raises the user's Attack and Defense by 1 stage.","shortDesc":"Raises the user's Attack and Defense by 1.","type":"Fighting","num":339,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0},{"id":"burningjealousy","name":"Burning Jealousy","desc":"Has a 100% chance to burn the target if it had a stat stage raised this turn.","shortDesc":"100% burns a target that had a stat rise this turn.","type":"Fire","num":807,"category":"Special","priority":0,"accuracy":100,"pp":5,"basePower":70},{"id":"counter","name":"Counter","desc":"Deals damage to the last opposing Pokemon to hit the user with a physical attack this turn equal to twice the HP lost by the user from that attack. If the user did not lose HP from the attack, this move deals 1 HP of damage instead. If that opposing Pokemon's position is no longer in use and there is another opposing Pokemon on the field, the damage is done to it instead. Only the last hit of a multi-hit attack is counted. Fails if the user was not hit by an opposing Pokemon's physical attack this turn.","shortDesc":"If hit by physical attack, returns double damage.","type":"Fighting","num":68,"category":"Physical","priority":-5,"accuracy":100,"pp":20,"basePower":0},{"id":"doubleedge","name":"Double-Edge","desc":"If the target lost HP, the user takes recoil damage equal to 33% the HP lost by the target, rounded half up, but not less than 1 HP.","shortDesc":"Has 33% recoil.","type":"Normal","num":38,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":120},{"id":"doublekick","name":"Double Kick","desc":"Hits twice. If the first hit breaks the target's substitute, it will take damage for the second hit.","shortDesc":"Hits 2 times in one turn.","type":"Fighting","num":24,"category":"Physical","priority":0,"accuracy":100,"pp":30,"basePower":30},{"id":"electroball","name":"Electro Ball","desc":"The power of this move depends on (user's current Speed / target's current Speed), rounded down. Power is equal to 150 if the result is 4 or more, 120 if 3, 80 if 2, 60 if 1, 40 if less than 1. If the target's current Speed is 0, this move's power is 40.","shortDesc":"More power the faster the user is than the target.","type":"Electric","num":486,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":0},{"id":"ember","name":"Ember","desc":"Has a 10% chance to burn the target.","shortDesc":"10% chance to burn the target.","type":"Fire","num":52,"category":"Special","priority":0,"accuracy":100,"pp":25,"basePower":40},{"id":"endure","name":"Endure","desc":"The user will survive attacks made by other Pokemon during this turn with at least 1 HP. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"User survives attacks this turn with at least 1 HP.","type":"Normal","num":203,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0},{"id":"facade","name":"Facade","desc":"Power doubles if the user is burned, paralyzed, or poisoned. The physical damage halving effect from the user's burn is ignored.","shortDesc":"Power doubles if user is burn/poison/paralyzed.","type":"Normal","num":263,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":70},{"id":"fireblast","name":"Fire Blast","desc":"Has a 10% chance to burn the target.","shortDesc":"10% chance to burn the target.","type":"Fire","num":126,"category":"Special","priority":0,"accuracy":85,"pp":5,"basePower":110},{"id":"firefang","name":"Fire Fang","desc":"Has a 10% chance to burn the target and a 10% chance to make it flinch.","shortDesc":"10% chance to burn. 10% chance to flinch.","type":"Fire","num":424,"category":"Physical","priority":0,"accuracy":95,"pp":15,"basePower":65},{"id":"firepledge","name":"Fire Pledge","desc":"If one of the user's allies chose to use Grass Pledge or Water Pledge this turn and has not moved yet, it takes its turn immediately after the user and the user's move does nothing. If combined with Grass Pledge, the ally uses Fire Pledge with 150 power and a sea of fire appears on the target's side for 4 turns, which causes damage to non-Fire types equal to 1/8 of their maximum HP, rounded down, at the end of each turn during effect, including the last turn. If combined with Water Pledge, the ally uses Water Pledge with 150 power and a rainbow appears on the user's side for 4 turns, which doubles secondary effect chances and stacks with the Serene Grace Ability, except effects that cause flinching can only have their chance doubled once. When used as a combined move, this move gains STAB no matter what the user's type is. This move does not consume the user's Fire Gem.","shortDesc":"Use with Grass or Water Pledge for added effect.","type":"Fire","num":519,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80},{"id":"firespin","name":"Fire Spin","desc":"Prevents the target from switching for four or five turns (seven turns if the user is holding Grip Claw). Causes damage to the target equal to 1/8 of its maximum HP (1/6 if the user is holding Binding Band), rounded down, at the end of each turn during effect. The target can still switch out if it is holding Shed Shell or uses Baton Pass, Flip Turn, Parting Shot, Shed Tail, Teleport, U-turn, or Volt Switch. The effect ends if either the user or the target leaves the field, or if the target uses Mortal Spin, Rapid Spin, or Substitute successfully. This effect is not stackable or reset by using this or another binding move.","shortDesc":"Traps and damages the target for 4-5 turns.","type":"Fire","num":83,"category":"Special","priority":0,"accuracy":85,"pp":15,"basePower":35},{"id":"flamecharge","name":"Flame Charge","desc":"Has a 100% chance to raise the user's Speed by 1 stage.","shortDesc":"100% chance to raise the user's Speed by 1.","type":"Fire","num":488,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":50},{"id":"flamethrower","name":"Flamethrower","desc":"Has a 10% chance to burn the target.","shortDesc":"10% chance to burn the target.","type":"Fire","num":53,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":90},{"id":"flareblitz","name":"Flare Blitz","desc":"Has a 10% chance to burn the target. If the target lost HP, the user takes recoil damage equal to 33% the HP lost by the target, rounded half up, but not less than 1 HP.","shortDesc":"Has 33% recoil. 10% chance to burn. Thaws user.","type":"Fire","num":394,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":120},{"id":"growl","name":"Growl","desc":"Lowers the target's Attack by 1 stage.","shortDesc":"Lowers the foe(s) Attack by 1.","type":"Normal","num":45,"category":"Status","priority":0,"accuracy":100,"pp":40,"basePower":0},{"id":"gunkshot","name":"Gunk Shot","desc":"Has a 30% chance to poison the target.","shortDesc":"30% chance to poison the target.","type":"Poison","num":441,"category":"Physical","priority":0,"accuracy":80,"pp":5,"basePower":120},{"id":"headbutt","name":"Headbutt","desc":"Has a 30% chance to make the target flinch.","shortDesc":"30% chance to make the target flinch.","type":"Normal","num":29,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":70},{"id":"heatwave","name":"Heat Wave","desc":"Has a 10% chance to burn the target.","shortDesc":"10% chance to burn the foe(s).","type":"Fire","num":257,"category":"Special","priority":0,"accuracy":90,"pp":10,"basePower":95},{"id":"helpinghand","name":"Helping Hand","desc":"The power of the target's attack this turn is multiplied by 1.5 (this effect is stackable). Fails if there is no ally adjacent to the user or if the ally already moved this turn, but does not fail if the ally is using a two-turn move.","shortDesc":"One adjacent ally's move power is 1.5x this turn.","type":"Normal","num":270,"category":"Status","priority":5,"accuracy":true,"pp":20,"basePower":0},{"id":"lowkick","name":"Low Kick","desc":"This move's power is 20 if the target weighs less than 10 kg, 40 if less than 25 kg, 60 if less than 50 kg, 80 if less than 100 kg, 100 if less than 200 kg, and 120 if greater than or equal to 200 kg.","shortDesc":"More power the heavier the target.","type":"Fighting","num":67,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":0},{"id":"lowsweep","name":"Low Sweep","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance to lower the target's Speed by 1.","type":"Fighting","num":490,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":65},{"id":"mudshot","name":"Mud Shot","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance to lower the target's Speed by 1.","type":"Ground","num":341,"category":"Special","priority":0,"accuracy":95,"pp":15,"basePower":55},{"id":"overheat","name":"Overheat","desc":"Lowers the user's Special Attack by 2 stages.","shortDesc":"Lowers the user's Sp. Atk by 2.","type":"Fire","num":315,"category":"Special","priority":0,"accuracy":90,"pp":5,"basePower":130},{"id":"protect","name":"Protect","desc":"The user is protected from most attacks made by other Pokemon during this turn. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"Prevents moves from affecting the user this turn.","type":"Normal","num":182,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0},{"id":"quickattack","name":"Quick Attack","desc":"No additional effect.","shortDesc":"Usually goes first.","type":"Normal","num":98,"category":"Physical","priority":1,"accuracy":100,"pp":30,"basePower":40},{"id":"rest","name":"Rest","desc":"The user falls asleep for the next two turns and restores all of its HP, curing itself of any non-volatile status condition in the process. Fails if the user has full HP, is already asleep, or if another effect is preventing sleep.","shortDesc":"User sleeps 2 turns and restores HP and status.","type":"Psychic","num":156,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0},{"id":"reversal","name":"Reversal","desc":"The power of this move is 20 if X is 33 to 48, 40 if X is 17 to 32, 80 if X is 10 to 16, 100 if X is 5 to 9, 150 if X is 2 to 4, and 200 if X is 0 or 1, where X is equal to (user's current HP * 48 / user's maximum HP), rounded down.","shortDesc":"More power the less HP the user has left.","type":"Fighting","num":179,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":0},{"id":"sleeptalk","name":"Sleep Talk","desc":"One of the user's known moves, besides this move, is selected for use at random. Fails if the user is not asleep. The selected move does not have PP deducted from it, and can currently have 0 PP. This move cannot select Assist, Beak Blast, Belch, Bide, Blazing Torque, Celebrate, Chatter, Combat Torque, Copycat, Dynamax Cannon, Focus Punch, Hold Hands, Magical Torque, Me First, Metronome, Mimic, Mirror Move, Nature Power, Noxious Torque, Shell Trap, Sketch, Sleep Talk, Struggle, Uproar, Wicked Torque, or any two-turn move.","shortDesc":"User must be asleep. Uses another known move.","type":"Normal","num":214,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"substitute","name":"Substitute","desc":"The user takes 1/4 of its maximum HP, rounded down, and puts it into a substitute to take its place in battle. The substitute is removed once enough damage is inflicted on it, or if the user switches out or faints. Baton Pass can be used to transfer the substitute to an ally, and the substitute will keep its remaining HP. Until the substitute is broken, it receives damage from all attacks made by other Pokemon and shields the user from status effects and stat stage changes caused by other Pokemon. Sound-based moves and Pokemon with the Infiltrator Ability ignore substitutes. The user still takes normal damage from weather and status effects while behind its substitute. If the substitute breaks during a multi-hit attack, the user will take damage from any remaining hits. If a substitute is created while the user is trapped by a binding move, the binding effect ends immediately. Fails if the user does not have enough HP remaining to create a substitute without fainting, or if it already has a substitute.","shortDesc":"User takes 1/4 its max HP to put in a substitute.","type":"Normal","num":164,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"sunnyday","name":"Sunny Day","desc":"For 5 turns, the weather becomes Sunny Day. The damage of Fire-type attacks is multiplied by 1.5 and the damage of Water-type attacks is multiplied by 0.5 during the effect. Lasts for 8 turns if the user is holding Heat Rock. Fails if the current weather is Sunny Day.","shortDesc":"For 5 turns, intense sunlight powers Fire moves.","type":"Fire","num":241,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0},{"id":"superfang","name":"Super Fang","desc":"Deals damage to the target equal to half of its current HP, rounded down, but not less than 1 HP.","shortDesc":"Does damage equal to 1/2 target's current HP.","type":"Normal","num":162,"category":"Physical","priority":0,"accuracy":90,"pp":10,"basePower":0},{"id":"swift","name":"Swift","desc":"This move does not check accuracy.","shortDesc":"This move does not check accuracy. Hits foes.","type":"Normal","num":129,"category":"Special","priority":0,"accuracy":true,"pp":20,"basePower":60},{"id":"swordsdance","name":"Swords Dance","desc":"Raises the user's Attack by 2 stages.","shortDesc":"Raises the user's Attack by 2.","type":"Normal","num":14,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0},{"id":"tackle","name":"Tackle","desc":"No additional effect.","shortDesc":"No additional effect.","type":"Normal","num":33,"category":"Physical","priority":0,"accuracy":100,"pp":35,"basePower":40},{"id":"takedown","name":"Take Down","desc":"If the target lost HP, the user takes recoil damage equal to 1/4 the HP lost by the target, rounded half up, but not less than 1 HP.","shortDesc":"Has 1/4 recoil.","type":"Normal","num":36,"category":"Physical","priority":0,"accuracy":85,"pp":20,"basePower":90},{"id":"taunt","name":"Taunt","desc":"Prevents the target from using non-damaging moves for its next three turns. Pokemon with the Oblivious Ability or protected by the Aroma Veil Ability are immune.","shortDesc":"Target can't use status moves its next 3 turns.","type":"Dark","num":269,"category":"Status","priority":0,"accuracy":100,"pp":20,"basePower":0},{"id":"temperflare","name":"Temper Flare","desc":"Power doubles if the user's last move on the previous turn, including moves called by other moves or those used through Instruct, Magic Coat, Snatch, or the Dancer or Magic Bounce Abilities, failed to do any of its normal effects, not including damage from an unsuccessful High Jump Kick, Jump Kick, or Mind Blown, or if the user was prevented from moving by any effect other than recharging or Sky Drop. A move that was blocked by Baneful Bunker, Detect, King's Shield, Protect, Spiky Shield, Crafty Shield, Mat Block, Quick Guard, or Wide Guard will not double this move's power, nor will Bounce or Fly ending early due to the effect of Gravity, Smack Down, or Thousand Arrows.","shortDesc":"Power doubles if the user's last move failed.","type":"Fire","num":915,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":75},{"id":"terablast","name":"Tera Blast","desc":"If the user is Terastallized, this move becomes a physical attack if the user's Attack is greater than its Special Attack, including stat stage changes, and this move's type becomes the same as the user's Tera Type. In addition, if the user's Tera Type is Stellar, this move has 100 power, is super effective against Terastallized targets and neutral against other targets, and lowers the user's Attack and Special Attack by 1 stage.","shortDesc":"If Terastallized: Phys. if Atk > SpA, type = Tera.","type":"Normal","num":851,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80},{"id":"trailblaze","name":"Trailblaze","desc":"Has a 100% chance to raise the user's Speed by 1 stage.","shortDesc":"100% chance to raise the user's Speed by 1.","type":"Grass","num":885,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":50},{"id":"uturn","name":"U-turn","desc":"If this move is successful and the user has not fainted, the user switches out even if it is trapped and is replaced immediately by a selected party member. The user does not switch out if there are no unfainted party members, or if the target switched out using an Eject Button or through the effect of the Emergency Exit or Wimp Out Abilities.","shortDesc":"User switches out after damaging the target.","type":"Bug","num":369,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":70},{"id":"weatherball","name":"Weather Ball","desc":"Power doubles if a weather condition other than Delta Stream is active, and this move's type changes to match. Ice type during Snow, Water type during Primordial Sea or Rain Dance, Rock type during Sandstorm, and Fire type during Desolate Land or Sunny Day. If the user is holding Utility Umbrella and uses Weather Ball during Primordial Sea, Rain Dance, Desolate Land, or Sunny Day, this move remains Normal type and does not double in power.","shortDesc":"Power doubles and type varies in each weather.","type":"Normal","num":311,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":50}]}