{"name":"Snom","id":"snom","num":872,"moves":[{"id":"bugbite","name":"Bug Bite","desc":"If this move is successful and the user has not fainted, it steals the target's held Berry if it is holding one and eats it immediately, gaining its effects even if the user's item is being ignored. Items lost to this move cannot be regained with Recycle or the Harvest Ability.","shortDesc":"User steals and eats the target's Berry.","type":"Bug","num":450,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":60},{"id":"bugbuzz","name":"Bug Buzz","desc":"Has a 10% chance to lower the target's Special Defense by 1 stage.","shortDesc":"10% chance to lower the target's Sp. Def by 1.","type":"Bug","num":405,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":90},{"id":"facade","name":"Facade","desc":"Power doubles if the user is burned, paralyzed, or poisoned. The physical damage halving effect from the user's burn is ignored.","shortDesc":"Power doubles if user is burn/poison/paralyzed.","type":"Normal","num":263,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":70},{"id":"fairywind","name":"Fairy Wind","desc":"No additional effect.","shortDesc":"No additional effect.","type":"Fairy","num":584,"category":"Special","priority":0,"accuracy":100,"pp":30,"basePower":40},{"id":"iciclespear","name":"Icicle Spear","desc":"Hits two to five times. Has a 35% chance to hit two or three times and a 15% chance to hit four or five times. If one of the hits breaks the target's substitute, it will take damage for the remaining hits. If the user has the Skill Link Ability, this move will always hit five times.","shortDesc":"Hits 2-5 times in one turn.","type":"Ice","num":333,"category":"Physical","priority":0,"accuracy":100,"pp":30,"basePower":25},{"id":"icywind","name":"Icy Wind","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance to lower the foe(s) Speed by 1.","type":"Ice","num":196,"category":"Special","priority":0,"accuracy":95,"pp":15,"basePower":55},{"id":"lunge","name":"Lunge","desc":"Has a 100% chance to lower the target's Attack by 1 stage.","shortDesc":"100% chance to lower the target's Attack by 1.","type":"Bug","num":679,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":80},{"id":"mirrorcoat","name":"Mirror Coat","desc":"Deals damage to the last opposing Pokemon to hit the user with a special attack this turn equal to twice the HP lost by the user from that attack. If the user did not lose HP from the attack, this move deals 1 HP of damage instead. If that opposing Pokemon's position is no longer in use and there is another opposing Pokemon on the field, the damage is done to it instead. Only the last hit of a multi-hit attack is counted. Fails if the user was not hit by an opposing Pokemon's special attack this turn.","shortDesc":"If hit by special attack, returns double damage.","type":"Psychic","num":243,"category":"Special","priority":-5,"accuracy":100,"pp":20,"basePower":0},{"id":"pounce","name":"Pounce","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance to lower the target's Speed by 1.","type":"Bug","num":884,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":50},{"id":"powdersnow","name":"Powder Snow","desc":"Has a 10% chance to freeze the target.","shortDesc":"10% chance to freeze the foe(s).","type":"Ice","num":181,"category":"Special","priority":0,"accuracy":100,"pp":25,"basePower":40},{"id":"protect","name":"Protect","desc":"The user is protected from most attacks made by other Pokemon during this turn. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"Prevents moves from affecting the user this turn.","type":"Normal","num":182,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0},{"id":"rest","name":"Rest","desc":"The user falls asleep for the next two turns and restores all of its HP, curing itself of any non-volatile status condition in the process. Fails if the user has full HP, is already asleep, or if another effect is preventing sleep.","shortDesc":"User sleeps 2 turns and restores HP and status.","type":"Psychic","num":156,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0},{"id":"skittersmack","name":"Skitter Smack","desc":"Has a 100% chance to lower the target's Special Attack by 1 stage.","shortDesc":"100% chance to lower target's Sp. Atk by 1.","type":"Bug","num":806,"category":"Physical","priority":0,"accuracy":90,"pp":10,"basePower":70},{"id":"sleeptalk","name":"Sleep Talk","desc":"One of the user's known moves, besides this move, is selected for use at random. Fails if the user is not asleep. The selected move does not have PP deducted from it, and can currently have 0 PP. This move cannot select Assist, Beak Blast, Belch, Bide, Blazing Torque, Celebrate, Chatter, Combat Torque, Copycat, Dynamax Cannon, Focus Punch, Hold Hands, Magical Torque, Me First, Metronome, Mimic, Mirror Move, Nature Power, Noxious Torque, Shell Trap, Sketch, Sleep Talk, Struggle, Uproar, Wicked Torque, or any two-turn move.","shortDesc":"User must be asleep. Uses another known move.","type":"Normal","num":214,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"strugglebug","name":"Struggle Bug","desc":"Has a 100% chance to lower the target's Special Attack by 1 stage.","shortDesc":"100% chance to lower the foe(s) Sp. Atk by 1.","type":"Bug","num":522,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":50},{"id":"substitute","name":"Substitute","desc":"The user takes 1/4 of its maximum HP, rounded down, and puts it into a substitute to take its place in battle. The substitute is removed once enough damage is inflicted on it, or if the user switches out or faints. Baton Pass can be used to transfer the substitute to an ally, and the substitute will keep its remaining HP. Until the substitute is broken, it receives damage from all attacks made by other Pokemon and shields the user from status effects and stat stage changes caused by other Pokemon. Sound-based moves and Pokemon with the Infiltrator Ability ignore substitutes. The user still takes normal damage from weather and status effects while behind its substitute. If the substitute breaks during a multi-hit attack, the user will take damage from any remaining hits. If a substitute is created while the user is trapped by a binding move, the binding effect ends immediately. Fails if the user does not have enough HP remaining to create a substitute without fainting, or if it already has a substitute.","shortDesc":"User takes 1/4 its max HP to put in a substitute.","type":"Normal","num":164,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"terablast","name":"Tera Blast","desc":"If the user is Terastallized, this move becomes a physical attack if the user's Attack is greater than its Special Attack, including stat stage changes, and this move's type becomes the same as the user's Tera Type. In addition, if the user's Tera Type is Stellar, this move has 100 power, is super effective against Terastallized targets and neutral against other targets, and lowers the user's Attack and Special Attack by 1 stage.","shortDesc":"If Terastallized: Phys. if Atk > SpA, type = Tera.","type":"Normal","num":851,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80}]}