{"name":"Tornadus","id":"tornadus","num":641,"moves":[{"id":"tailwind","name":"Tailwind","desc":"For 4 turns, the user and its party members have their Speed doubled. Fails if this move is already in effect for the user's side.","shortDesc":"For 4 turns, allies' Speed is doubled.","type":"Flying","num":366,"category":"Status","priority":0,"accuracy":true,"pp":15,"basePower":0,"weightedUsage":0.9986785937502731},{"id":"bleakwindstorm","name":"Bleakwind Storm","desc":"Has a 30% chance to lower the target's Speed by 1 stage. If the weather is Primordial Sea or Rain Dance, this move does not check accuracy. If this move is used against a Pokemon holding Utility Umbrella, this move's accuracy remains at 80%.","shortDesc":"30% to lower foe(s) Speed by 1. Rain: can't miss.","type":"Flying","num":846,"category":"Special","priority":0,"accuracy":80,"pp":10,"basePower":100,"weightedUsage":0.9662614177686443},{"id":"protect","name":"Protect","desc":"The user is protected from most attacks made by other Pokemon during this turn. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"Prevents moves from affecting the user this turn.","type":"Normal","num":182,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.5234902394505336},{"id":"raindance","name":"Rain Dance","desc":"For 5 turns, the weather becomes Rain Dance. The damage of Water-type attacks is multiplied by 1.5 and the damage of Fire-type attacks is multiplied by 0.5 during the effect. Lasts for 8 turns if the user is holding Damp Rock. Fails if the current weather is Rain Dance.","shortDesc":"For 5 turns, heavy rain powers Water moves.","type":"Water","num":240,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0,"weightedUsage":0.4982995025542408},{"id":"taunt","name":"Taunt","desc":"Prevents the target from using non-damaging moves for its next three turns. Pokemon with the Oblivious Ability or protected by the Aroma Veil Ability are immune.","shortDesc":"Target can't use status moves its next 3 turns.","type":"Dark","num":269,"category":"Status","priority":0,"accuracy":100,"pp":20,"basePower":0,"weightedUsage":0.3057956409039964},{"id":"sunnyday","name":"Sunny Day","desc":"For 5 turns, the weather becomes Sunny Day. The damage of Fire-type attacks is multiplied by 1.5 and the damage of Water-type attacks is multiplied by 0.5 during the effect. Lasts for 8 turns if the user is holding Heat Rock. Fails if the current weather is Sunny Day.","shortDesc":"For 5 turns, intense sunlight powers Fire moves.","type":"Fire","num":241,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0,"weightedUsage":0.24767785315819726},{"id":"icywind","name":"Icy Wind","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance to lower the foe(s) Speed by 1.","type":"Ice","num":196,"category":"Special","priority":0,"accuracy":95,"pp":15,"basePower":55,"weightedUsage":0.19644812544291007},{"id":"scaryface","name":"Scary Face","desc":"Lowers the target's Speed by 2 stages.","shortDesc":"Lowers the target's Speed by 2.","type":"Normal","num":184,"category":"Status","priority":0,"accuracy":100,"pp":10,"basePower":0,"weightedUsage":0.1455325961806922},{"id":"airslash","name":"Air Slash","desc":"Has a 30% chance to make the target flinch.","shortDesc":"30% chance to make the target flinch.","type":"Flying","num":403,"category":"Special","priority":0,"accuracy":95,"pp":15,"basePower":75,"weightedUsage":0.02942884083138036},{"id":"heatwave","name":"Heat Wave","desc":"Has a 10% chance to burn the target.","shortDesc":"10% chance to burn the foe(s).","type":"Fire","num":257,"category":"Special","priority":0,"accuracy":90,"pp":10,"basePower":95,"weightedUsage":0.025241039280404755},{"id":"grassknot","name":"Grass Knot","desc":"This move's power is 20 if the target weighs less than 10 kg, 40 if less than 25 kg, 60 if less than 50 kg, 80 if less than 100 kg, 100 if less than 200 kg, and 120 if greater than or equal to 200 kg.","shortDesc":"More power the heavier the target.","type":"Grass","num":447,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":0,"weightedUsage":0.024821248526372443},{"id":"substitute","name":"Substitute","desc":"The user takes 1/4 of its maximum HP, rounded down, and puts it into a substitute to take its place in battle. The substitute is removed once enough damage is inflicted on it, or if the user switches out or faints. Baton Pass can be used to transfer the substitute to an ally, and the substitute will keep its remaining HP. Until the substitute is broken, it receives damage from all attacks made by other Pokemon and shields the user from status effects and stat stage changes caused by other Pokemon. Sound-based moves and Pokemon with the Infiltrator Ability ignore substitutes. The user still takes normal damage from weather and status effects while behind its substitute. If the substitute breaks during a multi-hit attack, the user will take damage from any remaining hits. If a substitute is created while the user is trapped by a binding move, the binding effect ends immediately. Fails if the user does not have enough HP remaining to create a substitute without fainting, or if it already has a substitute.","shortDesc":"User takes 1/4 its max HP to put in a substitute.","type":"Normal","num":164,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.010524721959171871},{"id":"uturn","name":"U-turn","desc":"If this move is successful and the user has not fainted, the user switches out even if it is trapped and is replaced immediately by a selected party member. The user does not switch out if there are no unfainted party members, or if the target switched out using an Eject Button or through the effect of the Emergency Exit or Wimp Out Abilities.","shortDesc":"User switches out after damaging the target.","type":"Bug","num":369,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":70,"weightedUsage":0.004452061557193062},{"id":"sandstorm","name":"Sandstorm","desc":"For 5 turns, the weather becomes Sandstorm. At the end of each turn except the last, all active Pokemon lose 1/16 of their maximum HP, rounded down, unless they are a Ground, Rock, or Steel type, or have the Magic Guard, Overcoat, Sand Force, Sand Rush, or Sand Veil Abilities. During the effect, the Special Defense of Rock-type Pokemon is multiplied by 1.5 when taking damage from a special attack. Lasts for 8 turns if the user is holding Smooth Rock. Fails if the current weather is Sandstorm.","shortDesc":"For 5 turns, a sandstorm rages. Rock: 1.5x SpD.","type":"Rock","num":201,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.003986107406139424},{"id":"leer","name":"Leer","desc":"Lowers the target's Defense by 1 stage.","shortDesc":"Lowers the foe(s) Defense by 1.","type":"Normal","num":43,"category":"Status","priority":0,"accuracy":100,"pp":30,"basePower":0,"weightedUsage":0.0037304871388953195},{"id":"terablast","name":"Tera Blast","desc":"If the user is Terastallized, this move becomes a physical attack if the user's Attack is greater than its Special Attack, including stat stage changes, and this move's type becomes the same as the user's Tera Type. In addition, if the user's Tera Type is Stellar, this move has 100 power, is super effective against Terastallized targets and neutral against other targets, and lowers the user's Attack and Special Attack by 1 stage.","shortDesc":"If Terastallized: Phys. if Atk > SpA, type = Tera.","type":"Normal","num":851,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80,"weightedUsage":0.0031857252713896438},{"id":"nastyplot","name":"Nasty Plot","desc":"Raises the user's Special Attack by 2 stages.","shortDesc":"Raises the user's Sp. Atk by 2.","type":"Dark","num":417,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0,"weightedUsage":0.0018171076126209196},{"id":"knockoff","name":"Knock Off","desc":"If the target is holding an item that can be removed from it, ignoring the Sticky Hold Ability, this move's power is multiplied by 1.5. If the user has not fainted, the target loses its held item. This move cannot cause Pokemon with the Sticky Hold Ability to lose their held item or cause a Kyogre, a Groudon, a Giratina, an Arceus, a Genesect, a Silvally, a Zacian, or a Zamazenta to lose their Blue Orb, Red Orb, Griseous Orb, Plate, Drive, Memory, Rusted Sword, or Rusted Shield respectively. Items lost to this move cannot be regained with Recycle or the Harvest Ability.","shortDesc":"1.5x damage if foe holds an item. Removes item.","type":"Dark","num":282,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":65,"weightedUsage":0.0012543957086436125},{"id":"weatherball","name":"Weather Ball","desc":"Power doubles if a weather condition other than Delta Stream is active, and this move's type changes to match. Ice type during Snow, Water type during Primordial Sea or Rain Dance, Rock type during Sandstorm, and Fire type during Desolate Land or Sunny Day. If the user is holding Utility Umbrella and uses Weather Ball during Primordial Sea, Rain Dance, Desolate Land, or Sunny Day, this move remains Normal type and does not double in power.","shortDesc":"Power doubles and type varies in each weather.","type":"Normal","num":311,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":50,"weightedUsage":0.0011556464832561503},{"id":"snowscape","name":"Snowscape","desc":"For 5 turns, the weather becomes Snow. During the effect, the Defense of Ice-type Pokemon is multiplied by 1.5 when taking damage from a physical attack. Lasts for 8 turns if the user is holding Icy Rock. Fails if the current weather is Snow.","shortDesc":"For 5 turns, snow falls. Ice: 1.5x Def.","type":"Ice","num":883,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.0009346874898993321},{"id":"swagger","name":"Swagger","desc":"Raises the target's Attack by 2 stages and confuses it.","shortDesc":"Raises the target's Attack by 2 and confuses it.","type":"Normal","num":207,"category":"Status","priority":0,"accuracy":85,"pp":15,"basePower":0,"weightedUsage":0.0007846517742857253},{"id":"chillingwater","name":"Chilling Water","desc":"Has a 100% chance to lower the target's Attack by 1 stage.","shortDesc":"100% chance to lower the target's Attack by 1.","type":"Water","num":886,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":50,"weightedUsage":0.0007834632446202551},{"id":"focusblast","name":"Focus Blast","desc":"Has a 10% chance to lower the target's Special Defense by 1 stage.","shortDesc":"10% chance to lower the target's Sp. Def by 1.","type":"Fighting","num":411,"category":"Special","priority":0,"accuracy":70,"pp":5,"basePower":120,"weightedUsage":0.0007371062935763709},{"weightedUsage":0.0007075748468008019},{"id":"acrobatics","name":"Acrobatics","desc":"Power doubles if the user has no held item.","shortDesc":"Power doubles if the user has no held item.","type":"Flying","num":512,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":55,"weightedUsage":0.0006357737688309986},{"id":"endure","name":"Endure","desc":"The user will survive attacks made by other Pokemon during this turn with at least 1 HP. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"User survives attacks this turn with at least 1 HP.","type":"Normal","num":203,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.0004765799503354324},{"id":"fling","name":"Fling","desc":"The power of this move is based on the user's held item. The held item is lost and it activates for the target if applicable. If there is no target or the target avoids this move by protecting itself, the user's held item is still lost. The user can regain a thrown item with Recycle or the Harvest Ability. Fails if the user has no held item, if the held item cannot be thrown, if the user is under the effect of Embargo or Magic Room, or if the user has the Klutz Ability.","shortDesc":"Flings the user's item at the target. Power varies.","type":"Dark","num":374,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":0,"weightedUsage":0.00039932603842050124},{"id":"darkpulse","name":"Dark Pulse","desc":"Has a 20% chance to make the target flinch.","shortDesc":"20% chance to make the target flinch.","type":"Dark","num":399,"category":"Special","priority":0,"accuracy":100,"pp":15,"basePower":80,"weightedUsage":0.0003597371714474824},{"id":"hurricane","name":"Hurricane","desc":"Has a 30% chance to confuse the target. This move can hit a target using Bounce, Fly, or Sky Drop, or is under the effect of Sky Drop. If the weather is Primordial Sea or Rain Dance, this move does not check accuracy. If the weather is Desolate Land or Sunny Day, this move's accuracy is 50%. If this move is used against a Pokemon holding Utility Umbrella, this move's accuracy remains at 70%.","shortDesc":"30% chance to confuse target. Can't miss in rain.","type":"Flying","num":542,"category":"Special","priority":0,"accuracy":70,"pp":10,"basePower":110,"weightedUsage":0.00035927377816087803},{"id":"psychic","name":"Psychic","desc":"Has a 10% chance to lower the target's Special Defense by 1 stage.","shortDesc":"10% chance to lower the target's Sp. Def by 1.","type":"Psychic","num":94,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":90,"weightedUsage":0.00031160325198115093},{"id":"foulplay","name":"Foul Play","desc":"Damage is calculated using the target's Attack stat, including stat stage changes. The user's Ability, item, and burn are used as normal.","shortDesc":"Uses target's Attack stat in damage calculation.","type":"Dark","num":492,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":95,"weightedUsage":0.0002667176869228698},{"id":"aircutter","name":"Air Cutter","desc":"Has a higher chance for a critical hit.","shortDesc":"High critical hit ratio. Hits adjacent foes.","type":"Flying","num":314,"category":"Special","priority":0,"accuracy":95,"pp":25,"basePower":60,"weightedUsage":0.00020274937252934066},{"id":"sludgewave","name":"Sludge Wave","desc":"Has a 10% chance to poison the target.","shortDesc":"10% chance to poison adjacent Pokemon.","type":"Poison","num":482,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":95,"weightedUsage":0.00019649899300426698},{"id":"crunch","name":"Crunch","desc":"Has a 20% chance to lower the target's Defense by 1 stage.","shortDesc":"20% chance to lower the target's Defense by 1.","type":"Dark","num":242,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":80,"weightedUsage":0.00012830294516419648},{"id":"agility","name":"Agility","desc":"Raises the user's Speed by 2 stages.","shortDesc":"Raises the user's Speed by 2.","type":"Psychic","num":97,"category":"Status","priority":0,"accuracy":true,"pp":30,"basePower":0,"weightedUsage":0.00010995574203549547},{"id":"brickbreak","name":"Brick Break","desc":"If this attack does not miss, the effects of Reflect, Light Screen, and Aurora Veil end for the target's side of the field before damage is calculated.","shortDesc":"Destroys screens, unless the target is immune.","type":"Fighting","num":280,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":75,"weightedUsage":0.0000903598436381989},{"id":"metronome","name":"Metronome","desc":"A random move is selected for use, other than After You, Apple Acid, Armor Cannon, Assist, Astral Barrage, Aura Wheel, Baneful Bunker, Beak Blast, Behemoth Bash, Behemoth Blade, Belch, Bestow, Blazing Torque, Body Press, Branch Poke, Breaking Swipe, Celebrate, Chatter, Chilling Water, Chilly Reception, Clangorous Soul, Collision Course, Combat Torque, Comeuppance, Copycat, Counter, Covet, Crafty Shield, Decorate, Destiny Bond, Detect, Diamond Storm, Doodle, Double Iron Bash, Double Shock, Dragon Ascent, Dragon Energy, Drum Beating, Dynamax Cannon, Electro Drift, Endure, Eternabeam, False Surrender, Feint, Fiery Wrath, Fillet Away, Fleur Cannon, Focus Punch, Follow Me, Freeze Shock, Freezing Glare, Glacial Lance, Grav Apple, Helping Hand, Hold Hands, Hyper Drill, Hyperspace Fury, Hyperspace Hole, Ice Burn, Instruct, Jet Punch, Jungle Healing, King's Shield, Life Dew, Light of Ruin, Magical Torque, Make It Rain, Mat Block, Me First, Meteor Assault, Metronome, Mimic, Mind Blown, Mirror Coat, Mirror Move, Moongeist Beam, Nature Power, Nature's Madness, Noxious Torque, Obstruct, Order Up, Origin Pulse, Overdrive, Photon Geyser, Plasma Fists, Population Bomb, Pounce, Power Shift, Precipice Blades, Protect, Pyro Ball, Quash, Quick Guard, Rage Fist, Rage Powder, Raging Bull, Raging Fury, Relic Song, Revival Blessing, Ruination, Salt Cure, Secret Sword, Shed Tail, Shell Trap, Silk Trap, Sketch, Sleep Talk, Snap Trap, Snarl, Snatch, Snore, Snowscape, Spectral Thief, Spicy Extract, Spiky Shield, Spirit Break, Spotlight, Springtide Storm, Steam Eruption, Steel Beam, Strange Steam, Struggle, Sunsteel Strike, Surging Strikes, Switcheroo, Techno Blast, Tera Starstorm, Thief, Thousand Arrows, Thousand Waves, Thunder Cage, Thunderous Kick, Tidy Up, Trailblaze, Transform, Trick, Twin Beam, V-create, Wicked Blow, Wicked Torque, or Wide Guard.","shortDesc":"Picks a random move.","type":"Normal","num":118,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":0.000044043093185495275},{"id":"bulkup","name":"Bulk Up","desc":"Raises the user's Attack and Defense by 1 stage.","shortDesc":"Raises the user's Attack and Defense by 1.","type":"Fighting","num":339,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0,"weightedUsage":0.00003757230497528553},{"id":"rest","name":"Rest","desc":"The user falls asleep for the next two turns and restores all of its HP, curing itself of any non-volatile status condition in the process. Fails if the user has full HP, is already asleep, or if another effect is preventing sleep.","shortDesc":"User sleeps 2 turns and restores HP and status.","type":"Psychic","num":156,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0,"weightedUsage":0.000029703560476887923},{"id":"smackdown","name":"Smack Down","desc":"This move can hit a target using Bounce, Fly, or Sky Drop, or is under the effect of Sky Drop. If this move hits a target under the effect of Bounce, Fly, Magnet Rise, or Telekinesis, the effect ends. If the target is a Flying type that has not used Roost this turn or a Pokemon with the Levitate Ability, it loses its immunity to Ground-type attacks and the Arena Trap Ability as long as it remains active. During the effect, Magnet Rise fails for the target and Telekinesis fails against the target.","shortDesc":"Removes the target's Ground immunity.","type":"Rock","num":479,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":50,"weightedUsage":0.000029435593450974294},{"id":"extrasensory","name":"Extrasensory","desc":"Has a 10% chance to make the target flinch.","shortDesc":"10% chance to make the target flinch.","type":"Psychic","num":326,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":80,"weightedUsage":0.000008053438448694066},{"id":"hammerarm","name":"Hammer Arm","desc":"Lowers the user's Speed by 1 stage.","shortDesc":"Lowers the user's Speed by 1.","type":"Fighting","num":359,"category":"Physical","priority":0,"accuracy":90,"pp":10,"basePower":100,"weightedUsage":0.000006709649945848852},{"id":"bodyslam","name":"Body Slam","desc":"Has a 30% chance to paralyze the target. Damage doubles and no accuracy check is done if the target has used Minimize while active.","shortDesc":"30% chance to paralyze the target.","type":"Normal","num":34,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":85,"weightedUsage":0.000005083077239254634},{"id":"bite","name":"Bite","desc":"Has a 30% chance to make the target flinch.","shortDesc":"30% chance to make the target flinch.","type":"Dark","num":44,"category":"Physical","priority":0,"accuracy":100,"pp":25,"basePower":60,"weightedUsage":0.000003824637830999588},{"id":"uproar","name":"Uproar","desc":"The user spends three turns locked into this move. This move targets an opponent at random on each turn. On the first of the three turns, all sleeping active Pokemon wake up. During the three turns, no active Pokemon can fall asleep by any means, and Pokemon switched in during the effect do not wake up. If the user is prevented from moving or the attack is not successful against the target during one of the turns, the effect ends.","shortDesc":"Lasts 3 turns. Active Pokemon cannot fall asleep.","type":"Normal","num":253,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":90,"weightedUsage":0.0000026691502774785213},{"id":"gust","name":"Gust","desc":"Power doubles if the target is using Bounce, Fly, or Sky Drop, or is under the effect of Sky Drop.","shortDesc":"Power doubles during Bounce, Fly, and Sky Drop.","type":"Flying","num":16,"category":"Special","priority":0,"accuracy":100,"pp":35,"basePower":40,"weightedUsage":0.000002441677211293211},{"id":"hyperbeam","name":"Hyper Beam","desc":"If this move is successful, the user must recharge on the following turn and cannot select a move.","shortDesc":"User cannot move next turn.","type":"Normal","num":63,"category":"Special","priority":0,"accuracy":90,"pp":5,"basePower":150,"weightedUsage":0.0000010143224888310096},{"id":"thrash","name":"Thrash","desc":"The user spends two or three turns locked into this move and becomes confused immediately after its move on the last turn of the effect if it is not already. This move targets an opposing Pokemon at random on each turn. If the user is prevented from moving, is asleep at the beginning of a turn, or the attack is not successful against the target on the first turn of the effect or the second turn of a three-turn effect, the effect ends without causing confusion. If this move is called by Sleep Talk and the user is asleep, the move is used for one turn and does not confuse the user.","shortDesc":"Lasts 2-3 turns. Confuses the user afterwards.","type":"Normal","num":37,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":120,"weightedUsage":5.25806557445004e-7},{"id":"gigaimpact","name":"Giga Impact","desc":"If this move is successful, the user must recharge on the following turn and cannot select a move.","shortDesc":"User cannot move next turn.","type":"Normal","num":416,"category":"Physical","priority":0,"accuracy":90,"pp":5,"basePower":150,"weightedUsage":2.3787255182330924e-7},{"id":"fly","name":"Fly","desc":"This attack charges on the first turn and executes on the second. On the first turn, the user avoids all attacks other than Gust, Hurricane, Sky Uppercut, Smack Down, Thousand Arrows, Thunder, and Twister, and Gust and Twister have doubled power when used against it. If the user is holding a Power Herb, the move completes in one turn.","shortDesc":"Flies up on first turn, then strikes the next turn.","type":"Flying","num":19,"category":"Physical","priority":0,"accuracy":95,"pp":15,"basePower":90,"weightedUsage":2.012306406123432e-7},{"id":"reversal","name":"Reversal","desc":"The power of this move is 20 if X is 33 to 48, 40 if X is 17 to 32, 80 if X is 10 to 16, 100 if X is 5 to 9, 150 if X is 2 to 4, and 200 if X is 0 or 1, where X is equal to (user's current HP * 48 / user's maximum HP), rounded down.","shortDesc":"More power the less HP the user has left.","type":"Fighting","num":179,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":0,"weightedUsage":1.861653513622307e-7},{"id":"takedown","name":"Take Down","desc":"If the target lost HP, the user takes recoil damage equal to 1/4 the HP lost by the target, rounded half up, but not less than 1 HP.","shortDesc":"Has 1/4 recoil.","type":"Normal","num":36,"category":"Physical","priority":0,"accuracy":85,"pp":20,"basePower":90,"weightedUsage":1.7266943968340884e-7},{"id":"astonish","name":"Astonish","desc":"Has a 30% chance to make the target flinch.","shortDesc":"30% chance to make the target flinch.","type":"Ghost","num":310,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":30,"weightedUsage":3.9398443905866035e-8},{"id":"sleeptalk","name":"Sleep Talk","desc":"One of the user's known moves, besides this move, is selected for use at random. Fails if the user is not asleep. The selected move does not have PP deducted from it, and can currently have 0 PP. This move cannot select Assist, Beak Blast, Belch, Bide, Blazing Torque, Celebrate, Chatter, Combat Torque, Copycat, Dynamax Cannon, Focus Punch, Hold Hands, Magical Torque, Me First, Metronome, Mimic, Mirror Move, Nature Power, Noxious Torque, Shell Trap, Sketch, Sleep Talk, Struggle, Uproar, Wicked Torque, or any two-turn move.","shortDesc":"User must be asleep. Uses another known move.","type":"Normal","num":214,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0,"weightedUsage":3.017665864530547e-8},{"id":"facade","name":"Facade","desc":"Power doubles if the user is burned, paralyzed, or poisoned. The physical damage halving effect from the user's burn is ignored.","shortDesc":"Power doubles if user is burn/poison/paralyzed.","type":"Normal","num":263,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":70,"weightedUsage":3.825413522863683e-9},{"id":"thief","name":"Thief","desc":"If this attack was successful and the user has not fainted, it steals the target's held item if the user is not holding one. The target's item is not stolen if it is a Mail or Z-Crystal, or if the target is a Kyogre holding a Blue Orb, a Groudon holding a Red Orb, a Giratina holding a Griseous Orb, an Arceus holding a Plate, a Genesect holding a Drive, a Silvally holding a Memory, or a Pokemon that can Mega Evolve holding the Mega Stone for its species. Items lost to this move cannot be regained with Recycle or the Harvest Ability.","shortDesc":"If the user has no item, it steals the target's.","type":"Dark","num":168,"category":"Physical","priority":0,"accuracy":100,"pp":25,"basePower":60,"weightedUsage":1.102057399061384e-12}]}