{"name":"Trapinch","id":"trapinch","num":328,"types":["Ground"],"imgID":328,"baseStats":[45,100,45,45,45,10],"weight":15,"bst":290,"evos":["Vibrava"],"usage":0,"moves":[{"id":"astonish","name":"Astonish","desc":"Has a 30% chance to make the target flinch.","shortDesc":"30% chance to make the target flinch.","type":"Ghost","num":310,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":30},{"id":"bite","name":"Bite","desc":"Has a 30% chance to make the target flinch.","shortDesc":"30% chance to make the target flinch.","type":"Dark","num":44,"category":"Physical","priority":0,"accuracy":100,"pp":25,"basePower":60},{"id":"bodyslam","name":"Body Slam","desc":"Has a 30% chance to paralyze the target. Damage doubles and no accuracy check is done if the target has used Minimize while active.","shortDesc":"30% chance to paralyze the target.","type":"Normal","num":34,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":85},{"id":"bugbite","name":"Bug Bite","desc":"If this move is successful and the user has not fainted, it steals the target's held Berry if it is holding one and eats it immediately, gaining its effects even if the user's item is being ignored. Items lost to this move cannot be regained with Recycle or the Harvest Ability.","shortDesc":"User steals and eats the target's Berry.","type":"Bug","num":450,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":60},{"id":"bulldoze","name":"Bulldoze","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance lower adjacent Pkmn Speed by 1.","type":"Ground","num":523,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":60},{"id":"crunch","name":"Crunch","desc":"Has a 20% chance to lower the target's Defense by 1 stage.","shortDesc":"20% chance to lower the target's Defense by 1.","type":"Dark","num":242,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":80},{"id":"dig","name":"Dig","desc":"This attack charges on the first turn and executes on the second. On the first turn, the user avoids all attacks other than Earthquake and Magnitude but takes double damage from them, and is also unaffected by weather. If the user is holding a Power Herb, the move completes in one turn.","shortDesc":"Digs underground turn 1, strikes turn 2.","type":"Ground","num":91,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":80},{"id":"earthpower","name":"Earth Power","desc":"Has a 10% chance to lower the target's Special Defense by 1 stage.","shortDesc":"10% chance to lower the target's Sp. Def by 1.","type":"Ground","num":414,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":90},{"id":"earthquake","name":"Earthquake","desc":"Damage doubles if the target is using Dig.","shortDesc":"Hits adjacent Pokemon. Double damage on Dig.","type":"Ground","num":89,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":100},{"id":"endure","name":"Endure","desc":"The user will survive attacks made by other Pokemon during this turn with at least 1 HP. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"User survives attacks this turn with at least 1 HP.","type":"Normal","num":203,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0},{"id":"facade","name":"Facade","desc":"Power doubles if the user is burned, paralyzed, or poisoned. The physical damage halving effect from the user's burn is ignored.","shortDesc":"Power doubles if user is burn/poison/paralyzed.","type":"Normal","num":263,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":70},{"id":"feint","name":"Feint","desc":"If this move is successful, it breaks through the target's Baneful Bunker, Detect, King's Shield, Protect, or Spiky Shield for this turn, allowing other Pokemon to attack the target normally. If the target's side is protected by Crafty Shield, Mat Block, Quick Guard, or Wide Guard, that protection is also broken for this turn and other Pokemon may attack the target's side normally.","shortDesc":"Nullifies Detect, Protect, and Quick/Wide Guard.","type":"Normal","num":364,"category":"Physical","priority":2,"accuracy":100,"pp":10,"basePower":30},{"id":"firstimpression","name":"First Impression","desc":"Fails unless it is the user's first turn on the field.","shortDesc":"Hits first. First turn out only.","type":"Bug","num":660,"category":"Physical","priority":2,"accuracy":100,"pp":10,"basePower":90},{"id":"fissure","name":"Fissure","desc":"Deals damage to the target equal to the target's maximum HP. Ignores accuracy and evasiveness modifiers. This attack's accuracy is equal to (user's level - target's level + 30)%, and fails if the target is at a higher level. Pokemon with the Sturdy Ability are immune.","shortDesc":"OHKOs the target. Fails if user is a lower level.","type":"Ground","num":90,"category":"Physical","priority":0,"accuracy":30,"pp":5,"basePower":0},{"id":"flail","name":"Flail","desc":"The power of this move is 20 if X is 33 to 48, 40 if X is 17 to 32, 80 if X is 10 to 16, 100 if X is 5 to 9, 150 if X is 2 to 4, and 200 if X is 0 or 1, where X is equal to (user's current HP * 48 / user's maximum HP), rounded down.","shortDesc":"More power the less HP the user has left.","type":"Normal","num":175,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":0},{"id":"furycutter","name":"Fury Cutter","desc":"Power doubles with each successful hit, up to a maximum of 160 power. The power is reset if this move misses or another move is used.","shortDesc":"Power doubles with each hit, up to 160.","type":"Bug","num":210,"category":"Physical","priority":0,"accuracy":95,"pp":20,"basePower":40},{"id":"gigadrain","name":"Giga Drain","desc":"The user recovers 1/2 the HP lost by the target, rounded half up. If Big Root is held by the user, the HP recovered is 1.3x normal, rounded half down.","shortDesc":"User recovers 50% of the damage dealt.","type":"Grass","num":202,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":75},{"id":"gust","name":"Gust","desc":"Power doubles if the target is using Bounce, Fly, or Sky Drop, or is under the effect of Sky Drop.","shortDesc":"Power doubles during Bounce, Fly, and Sky Drop.","type":"Flying","num":16,"category":"Special","priority":0,"accuracy":100,"pp":35,"basePower":40},{"id":"hyperbeam","name":"Hyper Beam","desc":"If this move is successful, the user must recharge on the following turn and cannot select a move.","shortDesc":"User cannot move next turn.","type":"Normal","num":63,"category":"Special","priority":0,"accuracy":90,"pp":5,"basePower":150},{"id":"mudshot","name":"Mud Shot","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance to lower the target's Speed by 1.","type":"Ground","num":341,"category":"Special","priority":0,"accuracy":95,"pp":15,"basePower":55},{"id":"mudslap","name":"Mud-Slap","desc":"Has a 100% chance to lower the target's accuracy by 1 stage.","shortDesc":"100% chance to lower the target's accuracy by 1.","type":"Ground","num":189,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":20},{"id":"protect","name":"Protect","desc":"The user is protected from most attacks made by other Pokemon during this turn. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"Prevents moves from affecting the user this turn.","type":"Normal","num":182,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0},{"id":"quickattack","name":"Quick Attack","desc":"No additional effect.","shortDesc":"Usually goes first.","type":"Normal","num":98,"category":"Physical","priority":1,"accuracy":100,"pp":30,"basePower":40},{"id":"rest","name":"Rest","desc":"The user falls asleep for the next two turns and restores all of its HP, curing itself of any non-volatile status condition in the process. Fails if the user has full HP, is already asleep, or if another effect is preventing sleep.","shortDesc":"User sleeps 2 turns and restores HP and status.","type":"Psychic","num":156,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0},{"id":"rockslide","name":"Rock Slide","desc":"Has a 30% chance to make the target flinch.","shortDesc":"30% chance to make the foe(s) flinch.","type":"Rock","num":157,"category":"Physical","priority":0,"accuracy":90,"pp":10,"basePower":75},{"id":"rocktomb","name":"Rock Tomb","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance to lower the target's Speed by 1.","type":"Rock","num":317,"category":"Physical","priority":0,"accuracy":95,"pp":15,"basePower":60},{"id":"sandattack","name":"Sand Attack","desc":"Lowers the target's accuracy by 1 stage.","shortDesc":"Lowers the target's accuracy by 1.","type":"Ground","num":28,"category":"Status","priority":0,"accuracy":100,"pp":15,"basePower":0},{"id":"sandstorm","name":"Sandstorm","desc":"For 5 turns, the weather becomes Sandstorm. At the end of each turn except the last, all active Pokemon lose 1/16 of their maximum HP, rounded down, unless they are a Ground, Rock, or Steel type, or have the Magic Guard, Overcoat, Sand Force, Sand Rush, or Sand Veil Abilities. During the effect, the Special Defense of Rock-type Pokemon is multiplied by 1.5 when taking damage from a special attack. Lasts for 8 turns if the user is holding Smooth Rock. Fails if the current weather is Sandstorm.","shortDesc":"For 5 turns, a sandstorm rages. Rock: 1.5x SpD.","type":"Rock","num":201,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"sandtomb","name":"Sand Tomb","desc":"Prevents the target from switching for four or five turns (seven turns if the user is holding Grip Claw). Causes damage to the target equal to 1/8 of its maximum HP (1/6 if the user is holding Binding Band), rounded down, at the end of each turn during effect. The target can still switch out if it is holding Shed Shell or uses Baton Pass, Flip Turn, Parting Shot, Shed Tail, Teleport, U-turn, or Volt Switch. The effect ends if either the user or the target leaves the field, or if the target uses Mortal Spin, Rapid Spin, or Substitute successfully. This effect is not stackable or reset by using this or another binding move.","shortDesc":"Traps and damages the target for 4-5 turns.","type":"Ground","num":328,"category":"Physical","priority":0,"accuracy":85,"pp":15,"basePower":35},{"id":"scorchingsands","name":"Scorching Sands","desc":"Has a 30% chance to burn the target. The target thaws out if it is frozen.","shortDesc":"30% chance to burn the target. Thaws target.","type":"Ground","num":815,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":70},{"id":"sleeptalk","name":"Sleep Talk","desc":"One of the user's known moves, besides this move, is selected for use at random. Fails if the user is not asleep. The selected move does not have PP deducted from it, and can currently have 0 PP. This move cannot select Assist, Beak Blast, Belch, Bide, Blazing Torque, Celebrate, Chatter, Combat Torque, Copycat, Dynamax Cannon, Focus Punch, Hold Hands, Magical Torque, Me First, Metronome, Mimic, Mirror Move, Nature Power, Noxious Torque, Shell Trap, Sketch, Sleep Talk, Struggle, Uproar, Wicked Torque, or any two-turn move.","shortDesc":"User must be asleep. Uses another known move.","type":"Normal","num":214,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"stealthrock","name":"Stealth Rock","desc":"Sets up a hazard on the opposing side of the field, damaging each opposing Pokemon that switches in. Fails if the effect is already active on the opposing side. Foes lose 1/32, 1/16, 1/8, 1/4, or 1/2 of their maximum HP, rounded down, based on their weakness to the Rock type; 0.25x, 0.5x, neutral, 2x, or 4x, respectively. Can be removed from the opposing side if any opposing Pokemon uses Mortal Spin, Rapid Spin, or Defog successfully, or is hit by Defog.","shortDesc":"Hurts foes on switch-in. Factors Rock weakness.","type":"Rock","num":446,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0},{"id":"stoneedge","name":"Stone Edge","desc":"Has a higher chance for a critical hit.","shortDesc":"High critical hit ratio.","type":"Rock","num":444,"category":"Physical","priority":0,"accuracy":80,"pp":5,"basePower":100},{"id":"strugglebug","name":"Struggle Bug","desc":"Has a 100% chance to lower the target's Special Attack by 1 stage.","shortDesc":"100% chance to lower the foe(s) Sp. Atk by 1.","type":"Bug","num":522,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":50},{"id":"substitute","name":"Substitute","desc":"The user takes 1/4 of its maximum HP, rounded down, and puts it into a substitute to take its place in battle. The substitute is removed once enough damage is inflicted on it, or if the user switches out or faints. Baton Pass can be used to transfer the substitute to an ally, and the substitute will keep its remaining HP. Until the substitute is broken, it receives damage from all attacks made by other Pokemon and shields the user from status effects and stat stage changes caused by other Pokemon. Sound-based moves and Pokemon with the Infiltrator Ability ignore substitutes. The user still takes normal damage from weather and status effects while behind its substitute. If the substitute breaks during a multi-hit attack, the user will take damage from any remaining hits. If a substitute is created while the user is trapped by a binding move, the binding effect ends immediately. Fails if the user does not have enough HP remaining to create a substitute without fainting, or if it already has a substitute.","shortDesc":"User takes 1/4 its max HP to put in a substitute.","type":"Normal","num":164,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"sunnyday","name":"Sunny Day","desc":"For 5 turns, the weather becomes Sunny Day. The damage of Fire-type attacks is multiplied by 1.5 and the damage of Water-type attacks is multiplied by 0.5 during the effect. Lasts for 8 turns if the user is holding Heat Rock. Fails if the current weather is Sunny Day.","shortDesc":"For 5 turns, intense sunlight powers Fire moves.","type":"Fire","num":241,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0},{"id":"superpower","name":"Superpower","desc":"Lowers the user's Attack and Defense by 1 stage.","shortDesc":"Lowers the user's Attack and Defense by 1.","type":"Fighting","num":276,"category":"Physical","priority":0,"accuracy":100,"pp":5,"basePower":120},{"id":"takedown","name":"Take Down","desc":"If the target lost HP, the user takes recoil damage equal to 1/4 the HP lost by the target, rounded half up, but not less than 1 HP.","shortDesc":"Has 1/4 recoil.","type":"Normal","num":36,"category":"Physical","priority":0,"accuracy":85,"pp":20,"basePower":90},{"id":"terablast","name":"Tera Blast","desc":"If the user is Terastallized, this move becomes a physical attack if the user's Attack is greater than its Special Attack, including stat stage changes, and this move's type becomes the same as the user's Tera Type. In addition, if the user's Tera Type is Stellar, this move has 100 power, is super effective against Terastallized targets and neutral against other targets, and lowers the user's Attack and Special Attack by 1 stage.","shortDesc":"If Terastallized: Phys. if Atk > SpA, type = Tera.","type":"Normal","num":851,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80}],"abilities":[{"name":"Hyper Cutter","id":"hypercutter","desc":"Prevents other Pokemon from lowering this Pokemon's Attack stat stage.","shortDesc":"Prevents other Pokemon from lowering this Pokemon's Attack stat stage.","num":52},{"name":"Arena Trap","id":"arenatrap","desc":"Prevents opposing Pokemon from choosing to switch out unless they are airborne, are holding a Shed Shell, or are a Ghost type.","shortDesc":"Prevents opposing Pokemon from choosing to switch out unless they are airborne.","num":71},{"name":"Sheer Force","id":"sheerforce","desc":"This Pokemon's attacks with secondary effects have their power multiplied by 1.3, but the secondary effects are removed. If a secondary effect was removed, it also removes the user's Life Orb recoil and Shell Bell recovery, and prevents the target's Anger Shell, Berserk, Color Change, Emergency Exit, Pickpocket, Wimp Out, Red Card, Eject Button, Kee Berry, and Maranga Berry from activating.","shortDesc":"This Pokemon's attacks with secondary effects have 1.3x power; nullifies the effects.","num":125}],"teammates":[],"items":[],"spreads":[]}