{"name":"Tynamo","id":"tynamo","num":602,"moves":[{"id":"charge","name":"Charge","desc":"Raises the user's Special Defense by 1 stage. The user's next Electric-type attack will have its power doubled; the effect ends when the user is no longer active, or after the user attempts to use any Electric-type move besides Charge, even if it is not successful.","shortDesc":"+1 SpD, user's next Electric move 2x power.","type":"Electric","num":268,"category":"Status","priority":0,"accuracy":true,"pp":20,"basePower":0},{"id":"chargebeam","name":"Charge Beam","desc":"Has a 70% chance to raise the user's Special Attack by 1 stage.","shortDesc":"70% chance to raise the user's Sp. Atk by 1.","type":"Electric","num":451,"category":"Special","priority":0,"accuracy":90,"pp":10,"basePower":50},{"id":"knockoff","name":"Knock Off","desc":"If the target is holding an item that can be removed from it, ignoring the Sticky Hold Ability, this move's power is multiplied by 1.5. If the user has not fainted, the target loses its held item. This move cannot cause Pokemon with the Sticky Hold Ability to lose their held item or cause a Kyogre, a Groudon, a Giratina, an Arceus, a Genesect, a Silvally, a Zacian, or a Zamazenta to lose their Blue Orb, Red Orb, Griseous Orb, Plate, Drive, Memory, Rusted Sword, or Rusted Shield respectively. Items lost to this move cannot be regained with Recycle or the Harvest Ability.","shortDesc":"1.5x damage if foe holds an item. Removes item.","type":"Dark","num":282,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":65},{"id":"spark","name":"Spark","desc":"Has a 30% chance to paralyze the target.","shortDesc":"30% chance to paralyze the target.","type":"Electric","num":209,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":65},{"id":"tackle","name":"Tackle","desc":"No additional effect.","shortDesc":"No additional effect.","type":"Normal","num":33,"category":"Physical","priority":0,"accuracy":100,"pp":35,"basePower":40},{"id":"terablast","name":"Tera Blast","desc":"If the user is Terastallized, this move becomes a physical attack if the user's Attack is greater than its Special Attack, including stat stage changes, and this move's type becomes the same as the user's Tera Type. In addition, if the user's Tera Type is Stellar, this move has 100 power, is super effective against Terastallized targets and neutral against other targets, and lowers the user's Attack and Special Attack by 1 stage.","shortDesc":"If Terastallized: Phys. if Atk > SpA, type = Tera.","type":"Normal","num":851,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80},{"id":"thunderwave","name":"Thunder Wave","desc":"Paralyzes the target. This move does not ignore type immunity.","shortDesc":"Paralyzes the target.","type":"Electric","num":86,"category":"Status","priority":0,"accuracy":90,"pp":20,"basePower":0}]}