{"name":"Yungoos","id":"yungoos","num":734,"moves":[{"id":"bite","name":"Bite","desc":"Has a 30% chance to make the target flinch.","shortDesc":"30% chance to make the target flinch.","type":"Dark","num":44,"category":"Physical","priority":0,"accuracy":100,"pp":25,"basePower":60},{"id":"bulldoze","name":"Bulldoze","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance lower adjacent Pkmn Speed by 1.","type":"Ground","num":523,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":60},{"id":"chillingwater","name":"Chilling Water","desc":"Has a 100% chance to lower the target's Attack by 1 stage.","shortDesc":"100% chance to lower the target's Attack by 1.","type":"Water","num":886,"category":"Special","priority":0,"accuracy":100,"pp":20,"basePower":50},{"id":"crunch","name":"Crunch","desc":"Has a 20% chance to lower the target's Defense by 1 stage.","shortDesc":"20% chance to lower the target's Defense by 1.","type":"Dark","num":242,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":80},{"id":"dig","name":"Dig","desc":"This attack charges on the first turn and executes on the second. On the first turn, the user avoids all attacks other than Earthquake and Magnitude but takes double damage from them, and is also unaffected by weather. If the user is holding a Power Herb, the move completes in one turn.","shortDesc":"Digs underground turn 1, strikes turn 2.","type":"Ground","num":91,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":80},{"id":"doubleedge","name":"Double-Edge","desc":"If the target lost HP, the user takes recoil damage equal to 33% the HP lost by the target, rounded half up, but not less than 1 HP.","shortDesc":"Has 33% recoil.","type":"Normal","num":38,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":120},{"id":"endeavor","name":"Endeavor","desc":"Deals damage to the target equal to (target's current HP - user's current HP). The target is unaffected if its current HP is less than or equal to the user's current HP.","shortDesc":"Lowers the target's HP to the user's HP.","type":"Normal","num":283,"category":"Physical","priority":0,"accuracy":100,"pp":5,"basePower":0},{"id":"endure","name":"Endure","desc":"The user will survive attacks made by other Pokemon during this turn with at least 1 HP. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"User survives attacks this turn with at least 1 HP.","type":"Normal","num":203,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0},{"id":"facade","name":"Facade","desc":"Power doubles if the user is burned, paralyzed, or poisoned. The physical damage halving effect from the user's burn is ignored.","shortDesc":"Power doubles if user is burn/poison/paralyzed.","type":"Normal","num":263,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":70},{"id":"firefang","name":"Fire Fang","desc":"Has a 10% chance to burn the target and a 10% chance to make it flinch.","shortDesc":"10% chance to burn. 10% chance to flinch.","type":"Fire","num":424,"category":"Physical","priority":0,"accuracy":95,"pp":15,"basePower":65},{"id":"helpinghand","name":"Helping Hand","desc":"The power of the target's attack this turn is multiplied by 1.5 (this effect is stackable). Fails if there is no ally adjacent to the user or if the ally already moved this turn, but does not fail if the ally is using a two-turn move.","shortDesc":"One adjacent ally's move power is 1.5x this turn.","type":"Normal","num":270,"category":"Status","priority":5,"accuracy":true,"pp":20,"basePower":0},{"id":"icefang","name":"Ice Fang","desc":"Has a 10% chance to freeze the target and a 10% chance to make it flinch.","shortDesc":"10% chance to freeze. 10% chance to flinch.","type":"Ice","num":423,"category":"Physical","priority":0,"accuracy":95,"pp":15,"basePower":65},{"id":"lastresort","name":"Last Resort","desc":"This move fails unless the user knows this move and at least one other move, and has used all the other moves it knows at least once each since it became active or Transformed.","shortDesc":"Fails unless each known move has been used.","type":"Normal","num":387,"category":"Physical","priority":0,"accuracy":100,"pp":5,"basePower":140},{"id":"leer","name":"Leer","desc":"Lowers the target's Defense by 1 stage.","shortDesc":"Lowers the foe(s) Defense by 1.","type":"Normal","num":43,"category":"Status","priority":0,"accuracy":100,"pp":30,"basePower":0},{"id":"mudshot","name":"Mud Shot","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance to lower the target's Speed by 1.","type":"Ground","num":341,"category":"Special","priority":0,"accuracy":95,"pp":15,"basePower":55},{"id":"mudslap","name":"Mud-Slap","desc":"Has a 100% chance to lower the target's accuracy by 1 stage.","shortDesc":"100% chance to lower the target's accuracy by 1.","type":"Ground","num":189,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":20},{"id":"payback","name":"Payback","desc":"Power doubles if the user moves after the target this turn, including actions taken through Instruct or the Dancer Ability. Switching in does not count as an action.","shortDesc":"Power doubles if the user moves after the target.","type":"Dark","num":371,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":50},{"id":"protect","name":"Protect","desc":"The user is protected from most attacks made by other Pokemon during this turn. This move has a 1/X chance of being successful, where X starts at 1 and triples each time this move is successfully used. X resets to 1 if this move fails, if the user's last move used is not Baneful Bunker, Burning Bulwark, Detect, Endure, King's Shield, Max Guard, Obstruct, Protect, Quick Guard, Silk Trap, Spiky Shield, or Wide Guard, or if it was one of those moves and the user's protection was broken. Fails if the user moves last this turn.","shortDesc":"Prevents moves from affecting the user this turn.","type":"Normal","num":182,"category":"Status","priority":4,"accuracy":true,"pp":10,"basePower":0},{"id":"psychicfangs","name":"Psychic Fangs","desc":"If this attack does not miss, the effects of Reflect, Light Screen, and Aurora Veil end for the target's side of the field before damage is calculated.","shortDesc":"Destroys screens, unless the target is immune.","type":"Psychic","num":706,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":85},{"id":"raindance","name":"Rain Dance","desc":"For 5 turns, the weather becomes Rain Dance. The damage of Water-type attacks is multiplied by 1.5 and the damage of Fire-type attacks is multiplied by 0.5 during the effect. Lasts for 8 turns if the user is holding Damp Rock. Fails if the current weather is Rain Dance.","shortDesc":"For 5 turns, heavy rain powers Water moves.","type":"Water","num":240,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0},{"id":"rest","name":"Rest","desc":"The user falls asleep for the next two turns and restores all of its HP, curing itself of any non-volatile status condition in the process. Fails if the user has full HP, is already asleep, or if another effect is preventing sleep.","shortDesc":"User sleeps 2 turns and restores HP and status.","type":"Psychic","num":156,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0},{"id":"reversal","name":"Reversal","desc":"The power of this move is 20 if X is 33 to 48, 40 if X is 17 to 32, 80 if X is 10 to 16, 100 if X is 5 to 9, 150 if X is 2 to 4, and 200 if X is 0 or 1, where X is equal to (user's current HP * 48 / user's maximum HP), rounded down.","shortDesc":"More power the less HP the user has left.","type":"Fighting","num":179,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":0},{"id":"rocktomb","name":"Rock Tomb","desc":"Has a 100% chance to lower the target's Speed by 1 stage.","shortDesc":"100% chance to lower the target's Speed by 1.","type":"Rock","num":317,"category":"Physical","priority":0,"accuracy":95,"pp":15,"basePower":60},{"id":"sandattack","name":"Sand Attack","desc":"Lowers the target's accuracy by 1 stage.","shortDesc":"Lowers the target's accuracy by 1.","type":"Ground","num":28,"category":"Status","priority":0,"accuracy":100,"pp":15,"basePower":0},{"id":"sandstorm","name":"Sandstorm","desc":"For 5 turns, the weather becomes Sandstorm. At the end of each turn except the last, all active Pokemon lose 1/16 of their maximum HP, rounded down, unless they are a Ground, Rock, or Steel type, or have the Magic Guard, Overcoat, Sand Force, Sand Rush, or Sand Veil Abilities. During the effect, the Special Defense of Rock-type Pokemon is multiplied by 1.5 when taking damage from a special attack. Lasts for 8 turns if the user is holding Smooth Rock. Fails if the current weather is Sandstorm.","shortDesc":"For 5 turns, a sandstorm rages. Rock: 1.5x SpD.","type":"Rock","num":201,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"scaryface","name":"Scary Face","desc":"Lowers the target's Speed by 2 stages.","shortDesc":"Lowers the target's Speed by 2.","type":"Normal","num":184,"category":"Status","priority":0,"accuracy":100,"pp":10,"basePower":0},{"id":"seedbomb","name":"Seed Bomb","desc":"No additional effect.","shortDesc":"No additional effect.","type":"Grass","num":402,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":80},{"id":"sleeptalk","name":"Sleep Talk","desc":"One of the user's known moves, besides this move, is selected for use at random. Fails if the user is not asleep. The selected move does not have PP deducted from it, and can currently have 0 PP. This move cannot select Assist, Beak Blast, Belch, Bide, Blazing Torque, Celebrate, Chatter, Combat Torque, Copycat, Dynamax Cannon, Focus Punch, Hold Hands, Magical Torque, Me First, Metronome, Mimic, Mirror Move, Nature Power, Noxious Torque, Shell Trap, Sketch, Sleep Talk, Struggle, Uproar, Wicked Torque, or any two-turn move.","shortDesc":"User must be asleep. Uses another known move.","type":"Normal","num":214,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"stompingtantrum","name":"Stomping Tantrum","desc":"Power doubles if the user's last move on the previous turn, including moves called by other moves or those used through Instruct, Magic Coat, Snatch, or the Dancer or Magic Bounce Abilities, failed to do any of its normal effects, not including damage from an unsuccessful High Jump Kick, Jump Kick, or Mind Blown, or if the user was prevented from moving by any effect other than recharging or Sky Drop. A move that was blocked by Baneful Bunker, Detect, King's Shield, Protect, Spiky Shield, Crafty Shield, Mat Block, Quick Guard, or Wide Guard will not double this move's power, nor will Bounce or Fly ending early due to the effect of Gravity, Smack Down, or Thousand Arrows.","shortDesc":"Power doubles if the user's last move failed.","type":"Ground","num":707,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":75},{"id":"substitute","name":"Substitute","desc":"The user takes 1/4 of its maximum HP, rounded down, and puts it into a substitute to take its place in battle. The substitute is removed once enough damage is inflicted on it, or if the user switches out or faints. Baton Pass can be used to transfer the substitute to an ally, and the substitute will keep its remaining HP. Until the substitute is broken, it receives damage from all attacks made by other Pokemon and shields the user from status effects and stat stage changes caused by other Pokemon. Sound-based moves and Pokemon with the Infiltrator Ability ignore substitutes. The user still takes normal damage from weather and status effects while behind its substitute. If the substitute breaks during a multi-hit attack, the user will take damage from any remaining hits. If a substitute is created while the user is trapped by a binding move, the binding effect ends immediately. Fails if the user does not have enough HP remaining to create a substitute without fainting, or if it already has a substitute.","shortDesc":"User takes 1/4 its max HP to put in a substitute.","type":"Normal","num":164,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"sunnyday","name":"Sunny Day","desc":"For 5 turns, the weather becomes Sunny Day. The damage of Fire-type attacks is multiplied by 1.5 and the damage of Water-type attacks is multiplied by 0.5 during the effect. Lasts for 8 turns if the user is holding Heat Rock. Fails if the current weather is Sunny Day.","shortDesc":"For 5 turns, intense sunlight powers Fire moves.","type":"Fire","num":241,"category":"Status","priority":0,"accuracy":true,"pp":5,"basePower":0},{"id":"superfang","name":"Super Fang","desc":"Deals damage to the target equal to half of its current HP, rounded down, but not less than 1 HP.","shortDesc":"Does damage equal to 1/2 target's current HP.","type":"Normal","num":162,"category":"Physical","priority":0,"accuracy":90,"pp":10,"basePower":0},{"id":"tackle","name":"Tackle","desc":"No additional effect.","shortDesc":"No additional effect.","type":"Normal","num":33,"category":"Physical","priority":0,"accuracy":100,"pp":35,"basePower":40},{"id":"takedown","name":"Take Down","desc":"If the target lost HP, the user takes recoil damage equal to 1/4 the HP lost by the target, rounded half up, but not less than 1 HP.","shortDesc":"Has 1/4 recoil.","type":"Normal","num":36,"category":"Physical","priority":0,"accuracy":85,"pp":20,"basePower":90},{"id":"taunt","name":"Taunt","desc":"Prevents the target from using non-damaging moves for its next three turns. Pokemon with the Oblivious Ability or protected by the Aroma Veil Ability are immune.","shortDesc":"Target can't use status moves its next 3 turns.","type":"Dark","num":269,"category":"Status","priority":0,"accuracy":100,"pp":20,"basePower":0},{"id":"terablast","name":"Tera Blast","desc":"If the user is Terastallized, this move becomes a physical attack if the user's Attack is greater than its Special Attack, including stat stage changes, and this move's type becomes the same as the user's Tera Type. In addition, if the user's Tera Type is Stellar, this move has 100 power, is super effective against Terastallized targets and neutral against other targets, and lowers the user's Attack and Special Attack by 1 stage.","shortDesc":"If Terastallized: Phys. if Atk > SpA, type = Tera.","type":"Normal","num":851,"category":"Special","priority":0,"accuracy":100,"pp":10,"basePower":80},{"id":"thief","name":"Thief","desc":"If this attack was successful and the user has not fainted, it steals the target's held item if the user is not holding one. The target's item is not stolen if it is a Mail or Z-Crystal, or if the target is a Kyogre holding a Blue Orb, a Groudon holding a Red Orb, a Giratina holding a Griseous Orb, an Arceus holding a Plate, a Genesect holding a Drive, a Silvally holding a Memory, or a Pokemon that can Mega Evolve holding the Mega Stone for its species. Items lost to this move cannot be regained with Recycle or the Harvest Ability.","shortDesc":"If the user has no item, it steals the target's.","type":"Dark","num":168,"category":"Physical","priority":0,"accuracy":100,"pp":25,"basePower":60},{"id":"thrash","name":"Thrash","desc":"The user spends two or three turns locked into this move and becomes confused immediately after its move on the last turn of the effect if it is not already. This move targets an opposing Pokemon at random on each turn. If the user is prevented from moving, is asleep at the beginning of a turn, or the attack is not successful against the target on the first turn of the effect or the second turn of a three-turn effect, the effect ends without causing confusion. If this move is called by Sleep Talk and the user is asleep, the move is used for one turn and does not confuse the user.","shortDesc":"Lasts 2-3 turns. Confuses the user afterwards.","type":"Normal","num":37,"category":"Physical","priority":0,"accuracy":100,"pp":10,"basePower":120},{"id":"thunderfang","name":"Thunder Fang","desc":"Has a 10% chance to paralyze the target and a 10% chance to make it flinch.","shortDesc":"10% chance to paralyze. 10% chance to flinch.","type":"Electric","num":422,"category":"Physical","priority":0,"accuracy":95,"pp":15,"basePower":65},{"id":"trailblaze","name":"Trailblaze","desc":"Has a 100% chance to raise the user's Speed by 1 stage.","shortDesc":"100% chance to raise the user's Speed by 1.","type":"Grass","num":885,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":50},{"id":"uturn","name":"U-turn","desc":"If this move is successful and the user has not fainted, the user switches out even if it is trapped and is replaced immediately by a selected party member. The user does not switch out if there are no unfainted party members, or if the target switched out using an Eject Button or through the effect of the Emergency Exit or Wimp Out Abilities.","shortDesc":"User switches out after damaging the target.","type":"Bug","num":369,"category":"Physical","priority":0,"accuracy":100,"pp":20,"basePower":70},{"id":"wildcharge","name":"Wild Charge","desc":"If the target lost HP, the user takes recoil damage equal to 1/4 the HP lost by the target, rounded half up, but not less than 1 HP.","shortDesc":"Has 1/4 recoil.","type":"Electric","num":528,"category":"Physical","priority":0,"accuracy":100,"pp":15,"basePower":90},{"id":"workup","name":"Work Up","desc":"Raises the user's Attack and Special Attack by 1 stage.","shortDesc":"Raises the user's Attack and Sp. Atk by 1.","type":"Normal","num":526,"category":"Status","priority":0,"accuracy":true,"pp":30,"basePower":0},{"id":"yawn","name":"Yawn","desc":"Causes the target to fall asleep at the end of the next turn. Fails when used if the target cannot fall asleep or if it already has a non-volatile status condition. At the end of the next turn, if the target is still active, does not have a non-volatile status condition, and can fall asleep, it falls asleep. If the target becomes affected, this effect cannot be prevented by Safeguard or a substitute, or by falling asleep and waking up during the effect.","shortDesc":"Puts the target to sleep after 1 turn.","type":"Normal","num":281,"category":"Status","priority":0,"accuracy":true,"pp":10,"basePower":0},{"id":"zenheadbutt","name":"Zen Headbutt","desc":"Has a 20% chance to make the target flinch.","shortDesc":"20% chance to make the target flinch.","type":"Psychic","num":428,"category":"Physical","priority":0,"accuracy":90,"pp":15,"basePower":80}]}